
Барановичи. По городам Беларуси.
Барановичи, поездки, путешествия
"<p>Просидев весь день в субботу дома и ничего толком не сделав, я пришел к выводу, что трачу время зря. Пока есть возможности и нету обязательств и семьи, нужно тратить время с пользой и решил, что нужно все таки куда-нибудь съездить. Выбор пал на город Барановичи. Почему именно этот город? Потому что я в нем был очень много раз, но только проездом, когда ездил в свой родной город. Я решил исправить ситуацию и побывать в самом городе, а не только на вокзале.</p>

<p>Сразу хочу выразить благодарность моей однокласснице Ире, которая меня встретила, показала город (хотя я сам немного успел по нему пробежаться :) и накормила. </p>

<p>Дальше будет много фоток (3.1 Мб), так что у кого трафик важен, будте осторожны.</p>

<h2>Утро</h2>
<p>Перед поездками я&nbsp; всегда просыпаюсь рано и быстро. Видимо привычка. В этот раз я не выспался, но проснулся вовремя. Допил оствшийся с вечера кофе, собрал свой рюкзак и побрел на остановку. Поначалу желания ехать особо не было, но пересилил себя и решил не думать о том, что я буду делать там, а просто ехать.</p>

<p>На вокзал я добрался довольно быстро, все таки утро, да еще воскресенье. Дорога была пустой, автобус ехал шустро. На вокзале (а точнее на станции Институт Культуры) купил билет на электричку и вышел на перон ждать свой поезд. Случано был заскочил не в свой поезд, но вовремя спросил куда он следует и вышел :)</p>

<img src=\"http://klimchuk.com/upload/posts/baranovichi/01.jpg\">
<h2>Прибыли</h2>
<p>Ехать не долго, всего 2,5 часа. Даже чуть меньше. Правда, нужно выбирать скоростную электричку, потому есть такие, которые едут и 3,5 часа. Стоимость - 6340 белорусских рублей.</p>

<p>Выехал я из Минска в 9.08, прибыл в 11.30. На перроне было очень тихо. Меня это удивило, особенно после постоянного шума столицы.</p>

<img src=\"/upload/posts/baranovichi/02.jpg\"><p>Всем известно, что Барановичи - крупный железнодорожный узел и по сути город этим гордится. Совсем рядом с вокзалом на постаменте высится всем известный паровоз. Именно с них началось в свое время развитие железной дороги.

</p>

<img src=\"/upload/posts/baranovichi/03.jpg\"><p>А так выглядит сам вокзал со стороны города.</p>

<img src=\"../../upload/posts/baranovichi/04.jpg\">
<h2>Идем в город</h2>
<p>Я приехал на вокзал (один из двух) Барановичи-Полесские. Чтобы попасть в центральную часть города, нужно перебраться на другу сторону через многочисленные железнодорожные пути. Их там очень много. Сделать это можно, забравшись на мост, благо он рядом. </p>

<p>Пока я шел к мосту и искал пешеходный переход увидел вполне симпатичную башенку. Башенка оказалась наблюдательной башней пожарной станции. Проходя мимо, заметил, что она же и гараж для нескольких пожарных машин.</p>

<img src=\"../../upload/posts/baranovichi/05.jpg\"><img src=\"../../upload/posts/baranovichi/06.jpg\"><img src=\"../../upload/posts/baranovichi/07.jpg\"><p>Когда я начал подниматься на мост, я начал вспоминать, что тут я был когда-то. И действительно, когда я был маленький, в Барановичи мы приезжали на экскурсию. Мы отдыхали в санатории неподалеку и нас привозили в музей железнодорожной техники. К слову, он виден из поезда, если ехать со стороны Минска. Но к сожалению, в выходные музей закрыт и я смог посмотреть на технику только сверху.</p>

<p>Такая вот зенитка на рельсах стоит почти под самым постом.</p>

<img src=\"../../upload/posts/baranovichi/08.jpg\"><img src=\"../../upload/posts/baranovichi/09.jpg\"><p>А вот тут целая колона паровозов и тепловозов. Когда я был маленький тут, в один из тепловохов можно было даже залезть. По крайней мере нам тогда разрешили.</p>

<img src=\"../../upload/posts/baranovichi/10.jpg\"><img src=\"../../upload/posts/baranovichi/11.jpg\"><p>А такой вид открывается с другой стороны моста. Множество рельсовых дорожек завораживает.</p>

<img src=\"../../upload/posts/baranovichi/12.jpg\">
<h2>Ближе к центру</h2>
<p>Перебравшись через мост на другую сторону города, я пошле бродить по улицам города. Улицы как улицы, таких много в любом городе. С магазинами, небольшими деревцами. Но иногда попадались и интересные памятники. Такой вот необычный памятник с вечным огнем. Солнце было в зените, потому фото получилось не очень высокого качества, а памятник не развернешь.</p>

<img src=\"../../upload/posts/baranovichi/13.jpg\"><p>А сразу за ним я увидел такой вот обычный, серый, ничем неприглядный Дом культуры.</p>

<img src=\"../../upload/posts/baranovichi/14.jpg\"><p>Решив походить по малолюдным улочкам, набрел случайно на гимназию.</p>

<img src=\"../../upload/posts/baranovichi/16.jpg\"><p>А рядом с ней обнаружилась такая вот красота.</p>

<img src=\"../../upload/posts/baranovichi/15.jpg\"><img src=\"../../upload/posts/baranovichi/17.jpg\"><img src=\"../../upload/posts/baranovichi/18.jpg\"><p>А рядом - большой камень, на котором написано, что сквер назван в честь финского города-побратима Хейнала.</p>

<img src=\"../../upload/posts/baranovichi/19.jpg\"><p>Пройдя еще дальше увидел необычное здание. Я не религиозный человек, потому не стал выяснять суть. Кому интересно, я думаю узнают. Моя цель была просто посетить город.&nbsp;</p><p>Как выяснилось позднее, это Барановический Дворец Бракосочетаний. Спасибо Valentinych за подсказку.<br /></p><p>
</p><img src=\"../../upload/posts/baranovichi/20.jpg\"><br /><br /><img src=\"../../upload/posts/baranovichi/21.jpg\"><p>Так как я города не знал на тот момент, я решил далеко не заходить вглубь и повернул обратно, ближе к центру. Проходя мимо зеленого домика словил себя на мысли, что он либо только сверху обшит деревянными планками либо и сам деревянный. Дерево и ладно, но дом двухэтажный - это меня и заинтересовало.</p>

<img src=\"../../upload/posts/baranovichi/22.jpg\"><p>А напротив расположился банк. Вот не знаю почему, но я считаю, что такой фасад больше всего подходит банку. Внушительный и солидный и при этом красивый.</p>

<img src=\"../../upload/posts/baranovichi/23.jpg\"><p>А возле гостины (здания классического советского образца - большое и серое), которую я не стал фотогрфировать, нашел такую вот лошадку.</p>

<img src=\"../../upload/posts/baranovichi/24.jpg\"><p>А за ней ухоженную альпийскую горку и небольшой фонтанчик в виде водопадика.</p>

<img src=\"../../upload/posts/baranovichi/25.jpg\">
<h2>Двигаемся дальше</h2>
<p>Не особо представля где я, движимый только интуицией я пошел дальше гулять по городу. Видимо меня заманил своим цветом оранжевый экскаватор, так как я попал на разобранную улицу. Что меня поразило, что там кладут не привычный всем асфальт, а делают настоящую мостовую из камней. Возможно улица будет пешеходной.</p>

<img src=\"../../upload/posts/baranovichi/26.jpg\"><p>Пройдя немного дальше увидел вывеску музея. Заходить не стал, так как время было ограниченно.</p>

<img src=\"../../upload/posts/baranovichi/27.jpg\">
<h2>В другую сторону</h2>
<p>Прогулявшись по центральным улицам я попал на небольшие улочки. Осмотревшись через Google Maps где я, направился в противоположную сторону, туда, где на карте было написано - \"Новый парк\".</p>

<p>По пути увидел длинное и красивое здание, но что за оно я не понял. Возможно школа. А рядом с ним был современный дом, но построенный в интересном стиле. </p>

<img src=\"../../upload/posts/baranovichi/28.jpg\"><img src=\"../../upload/posts/baranovichi/29.jpg\"><p>До парка я все таки дошел и увидел там красивую карету. Время поджимало и я не хотел, чтобы меня ждали, поэтому не стал кататься.</p>

<img src=\"../../upload/posts/baranovichi/30.jpg\"><p>В парк я решил зайти на обратном пути и сверяясь с картой пошле искать кинотеатр. Как я позже узнал от своей спутницы, главный кинотеатр в городе. Есть еще несколько, но этот самый главный, так сказать :) Но по пути увидел строения очень знакомые. Такие я видел в одном старом районе Минска. Может просто похоже, а может и своя история у них.</p>

<img src=\"../../upload/posts/baranovichi/31.jpg\"><p>Ну а вот и сам кинотеатр.</p>

<img src=\"../../upload/posts/baranovichi/32.jpg\"><p>Напротив кинотеатра находится главный вход в парк. Удачно я выбрал маршрут.</p>

<img src=\"../../upload/posts/baranovichi/33.jpg\"><p>Местный Герой Грицевец Сергей Иванович. Именно в честь его установлен этот памятник.</p>

<img src=\"../../upload/posts/baranovichi/34.jpg\"><p>Выйдя из парка я попал опять на центральные улицы. Город гораздо больше, но как и везде - окраины - это спальные районы. Но я увидел название улицы, вернее бульвара. Это название мне до сих пор не дает покоя. Я не могу понять его смысл. Может кто подскажет?</p>

<img src=\"../../upload/posts/baranovichi/35.jpg\"><p>А вот такую замечательную бабушку я встретил в одном из дворов.</p>

<img src=\"../../upload/posts/baranovichi/36.jpg\">
<h2>Площадь, встреча, прогулка</h2>
<p>Наконец я добрался до центральной площади города. Площадь Ленина. Такие площади остались почти в каждом городе. Она классическая - с памятником. Но меня не впечатлил ее размер. Но с друго стороны я увидел здание в стиле... футуризма что ли.</p>

<img src=\"../../upload/posts/baranovichi/37.jpg\"><p>На площади я встретился с однокласницей своей. После небольших подсчетов выяснилось, что я с ней не виделся целых 8 лет. Долго рассказывать, почему так случилось. Но поговорить было о чем и фотографировал я немного меньше, а местами заговорившись, совсем забывал. Прошу меня простить за эту оплошность. Но, например, мужика, выбирающего из люка, я не мог пропустить. </p>

<img src=\"../../upload/posts/baranovichi/38.jpg\"><p>Дальше мы пошли в совсем другой район города - микрорайон Северный. Название говорит само за себя - он на севере города. Район новый и как мне показалось, больше промышленный. Забыл сфотографировать ледовый дворец, но видимо засмотрелся на танцующих пчелок... Но подходя к острову любви увидел интересную задумку. С виду обычный вагон, но давили купол и уже небольшая церквушка. Экономно и практично.</p>

<img src=\"../../upload/posts/baranovichi/39.jpg\"><img src=\"../../upload/posts/baranovichi/40.jpg\"><p>А потом мы посетили остров любви. Такие места есть во многих городах. Но некоторые вещи меня удивили :)</p>

<img src=\"../../upload/posts/baranovichi/41.jpg\"><p>Удивил пример очень крепкой семьи... и такой вот большой амбарный замок.</p>

<img src=\"../../upload/posts/baranovichi/43.jpg\"><img src=\"../../upload/posts/baranovichi/42.jpg\"><p>Недалеко от вокзала, уже возвращаясь, заметил церковь \"Адвентистов седьмого дня\". Надеюсь не ошибся с названием.</p>

<img src=\"../../upload/posts/baranovichi/44.jpg\"><p>А еще, не знаю правда что это за район, увидел такую вот полуторку.</p>

<img src=\"../../upload/posts/baranovichi/47.jpg\"><p>В целом на этом путешествие закончилось. Еще я побывал в гостях у своей одноклассницы, познакомился с ее маленьким сыночком Максимкой. Меня вкусно накормили. Через какое-то время пришлось все таки прощаться и возвращаться домой в Минск.</p>

<p>В подтверждение, что я там был, моя физиономия :)</p>

<img src=\"../../upload/posts/baranovichi/46.jpg\"><p>И огромное спасибо Ире, за то что встретила и составила компанию и показала город.</p>

<img src=\"../../upload/posts/baranovichi/45.jpg\"><p>Поездка домой была сонной и сказывалась усталость за день. Но ехал я довольный и отдохнувший от серых будней шумного Минска.</p>

<p>P.S. Фото для сайта были урезаны и ужаты, потому полные версии фото я оформил отдельным архивом. Скачать по можно по этой <a href=\"http://test.alroniks.com/baranovichi.zip\" title=\"\">ссылке</a></p></cut>"

---

Появился favicon на сайте
IE, favicon, блог, иконка, инициалы, браузер, ico, Internet Explorer, зло
"<p>Признаком качественно сайта на данный момент является так же всем известный <i>favicon</i>. Если кто не знает - маленькая иконка в строке браузера, слева от адреса страницы. Кроме того, в различных каталогах, приложениях эти иконки учитываются и показываются. Так что рано или поздно нужно было сделать такую иконку и для своего сайта. </p>

<cut>

<h2>Идея</h2>

<p>Идея до безобразия проста. Сайт личный, да еще и с доменом фамильным, поэтому нужно было отразить это как-то в иконке, или даже почти логотипе сайта. Самое простое, что приходит на ум для личного сайта - инициалы. Именно инициалы и легли в основу задумки. Меня зовут Иван Климчук. На латиннице инициалы будут выглядеть так: <b>IK</b>. А теперь смотрим на картинку и пытаемся угадать где \"I\", a где \"K\"? :)</p>

<p><img src=\"../../upload/posts/favicon-big.png\" width=\"256px\"></p>

<h2>Установить на сайт</h2>

<p>Рассказывать, как рисовать свою иконку в Photoshop или Gimp я не стану, мы сейчас не об этом. Главное, после того, как мы создали свою иконку, уменьшить ее до разумных размеров и положить в корень сайта. Разумные размеры? Тут сложно сказать, что считать разумным. Браузерам обычно нужна картина 16х16px, но мало ли где еще иконка может использоваться. Я сделал размер 32x32px, хотя и этого может быть мало. Еще лучше всего назвать ее именно favicon.<br /></p>

<p>Дальше нужно подключить ее к странице - это делается очень просто:</p>

<pre class=\"html4strict\" style=\"font-family: monospace;\"><ol><li style=\"font-weight: normal; vertical-align: top;\"><div style=\"font: 1em/1.2em monospace; margin: 0pt; padding: 0pt; background: none repeat scroll 0% 0% transparent; vertical-align: top;\"><span style=\"color: rgb(0, 153, 0);\"><<span style=\"color: rgb(0, 0, 0); font-weight: bold;\">link</span> <span style=\"color: rgb(0, 0, 102);\">rel</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"icon\"</span> <span style=\"color: rgb(0, 0, 102);\">href</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"/favicon.png\"</span> <span style=\"color: rgb(0, 0, 102);\">type</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"image/x-icon\"</span>></span><br /></div></li><li style=\"font-weight: normal; vertical-align: top;\"><div style=\"font: 1em/1.2em monospace; margin: 0pt; padding: 0pt; background: none repeat scroll 0% 0% transparent; vertical-align: top;\"><span style=\"color: rgb(0, 153, 0);\"><<span style=\"color: rgb(0, 0, 0); font-weight: bold;\">link</span> <span style=\"color: rgb(0, 0, 102);\">rel</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"shortcut icon\"</span> <span style=\"color: rgb(0, 0, 102);\">href</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"/favicon.png\"</span> <span style=\"color: rgb(0, 0, 102);\">type</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"image/x-icon\"</span>></span><br /></div></li></ol></pre>

<h2><br /><span style=\"font-family: monospace;\"></span></h2>

<h2><span style=\"font-family: monospace;\"></span>Internet Explorer - вселенское зло</h2>

<p>Хотя на самом деле особых проблем нету с IE, но я не стал связываться с ним. Дело в том, что он требует иконку только в формате ICO. Я не люблю IE, и советую пользователям, кто им все же пользуется - скачайте нормальный браузер! И извиняюсь сразу же за то, что у вас не будет иконка отображаться.</p></cut>"

---

Рецепты приготовления MODX
рецепты, приготовление, modx, revolution, Иван, Климчук, Иван Климчук
"<p>Выкладываю видео своего выступления. Хоть и с опозданием большим, но для порядку нужно, чтобы оно тут было.</p>

<p><iframe src=\"http://player.vimeo.com/video/28147253?portrait=0&amp;color=59a5d1\" width=\"540\" height=\"405\" frameborder=\"0\"></iframe></p>

<p>Так же ссылка на презентацию (работает в браузере):&nbsp;<a target=\"_blank\" href=\"http://klimchuk.com/pres/rcm/\" title=\"Откроется в новом окне\">Рецепты приготовления MODx</a></p>"

---

Seo-марафон (гостевой пост)
seo марафон, seo marafon, seo, marafon, марафон, сео
"<p>На курсах seo специалистов компании Artox Media в самом разгаре борьба за место в топе по учебному запросу - seo марафон.</p>

<p>Хочу подержать в данной, пусть и учебной, но гонке блог <a href=\"http://seoeuronet.ru/\"><strong>seo марафон</strong></a>.</p>

<p>Успехов!</p>"

---

reader.jquery — читаем с удовольствием
jquery, safari reader, safari, apple, plugins, javascript, разработка, велосипеды, habrahabr
"<p><img src=\"http://habreffect.ru/files/6c6/d105e9ad7/image2.png\" alt=\"image\"> </p>

<p>Как мы помним, совсем недавно вышел Safari 5. Одной из интересных особенностей новой версии браузера оказался так называемый \"читальщик\" - Safari Reader. Данный модуль позволяет выделить на странице основной текст и отобразить его в удобном виде без лишних элементов сайта и рекламы. Согласитесь, довольно удобно читать, когда тебе ничего не мешает. К плюсам модуля также стоит отнести и возможность минимальной, но нужной настройки размера шрифта (скролл сайта увеличит все и не всегда хорошо). Из минусов - работает только в Safari.</p>

<p>Решение проблемы отчасти было <a href=\"http://habrahabr.ru/blogs/browsers/95908/\">придумано</a> . Но меня не устроило то, что все плагины и расширения нужно устанавливать в браузер (кроме Safari разумеется). Я то поставлю, а вот человек постарше этого делать не станет из-за незнания или страха что-то сломать или вообще из-за лени. В связи с этим у меня возникла идея: а что если предложить ему тоже самое, но только средствами самого сайта? Что я собственно и попытался сделать.</p>

<p><habracut text=\"Что за зверь такой?\"><b>Reader</b> - это обычный плагин для популярной библиотеки jQuery. Особенностью плагина, как и любых других, является легкость подключения к сайту и простая настройка плагина под свои нужды. К тому же он более гибкий, нежели Safari Reader или плагины для других браузеров, так как есть возможность задавать параметры отображения. Это позволяет оформить окно \"ридера\" в стиле сайта.</p>

<p><habracut text=\"Что за зверь такой?\">С опциями по умолчанию он выглядит почти так же, как и Safari Reader.</p>

<p><habracut text=\"Что за зверь такой?\"> <img src=\"http://habreffect.ru/files/8d9/29ddedeb4/image1.png\"><br /></p>

<h2>Важно</h2>

Для правильной работы содержимое страницы, которое предполагается выводить с помощью плагина, следует поместить в блочный элемент. Важным условием является наличие внутри заголовка H1, именно к нему цепляется кнопка активации режима чтения.

<p>Для более гибкой настройки в самом плагине в функции analysis можно указать правила для фильтрации контента. Правила задаются в виде регулярных выражений. В планах сделать фильтрацию настраиваемой с помощью опций.</p>

<h2>Как использовать</h2>

Думаю, рассказывать хабралюдям, как подключать скрипты к страницам не имеет смысла, но все же приведу пример.

<blockquote><ol><li><font color=\"#009900\"><<font color=\"#660066\">script</font> <font color=\"#000066\">type</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"text/javascript\"</font> <font color=\"#000066\">src</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"jquery-1.4.2.js\"</font>><<font color=\"#66cc66\">/</font><font color=\"#660066\">script</font>></font></li>
		<li><font color=\"#009900\"><<font color=\"#660066\">script</font> <font color=\"#000066\">type</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"text/javascript\"</font> <font color=\"#000066\">src</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"reader.jquery.js\"</font>><<font color=\"#66cc66\">/</font><font color=\"#660066\">script</font>></font></li></ol
</blockquote>

Самый простой пример инициализации плагина:

<blockquote><ol><li>$<font color=\"#009900\">(</font><font color=\"#3366CC\">\"document\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">ready</font><font color=\"#009900\">(</font><font color=\"#003366\">function</font><font color=\"#009900\">(</font><font color=\"#009900\">)</font><font color=\"#009900\">{</font></li><li> </li><li>    $<font color=\"#009900\">(</font><font color=\"#3366CC\">\"#reader\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">reader</font><font color=\"#009900\">(</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li><li> </li><li><font color=\"#009900\">}</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li></ol
</blockquote>

Инициализация с опциями:

<blockquote><ol><li>$<font color=\"#009900\">(</font><font color=\"#3366CC\">\"document\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">ready</font><font color=\"#009900\">(</font><font color=\"#003366\">function</font><font color=\"#009900\">(</font><font color=\"#009900\">)</font><font color=\"#009900\">{</font></li><li>    $<font color=\"#009900\">(</font><font color=\"#3366CC\">\"#post\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">reader</font><font color=\"#009900\">(</font><font color=\"#009900\">{</font>                </li><li>        <font color=\"#3366CC\">\"shadow\"</font> <font color=\"#339933\">:</font> <font color=\"#009900\">{</font>                    </li><li>            <font color=\"#3366CC\">\"opacity\"</font><font color=\"#339933\">:</font> <font color=\"#3366CC\">\".8\"</font></li><li>        <font color=\"#009900\">}</font><font color=\"#339933\">,</font></li><li>        <font color=\"#3366CC\">\"window\"</font> <font color=\"#339933\">:</font> <font color=\"#009900\">{</font></li><li>            <font color=\"#3366CC\">\"width\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"800px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"color\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"#000\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontFamily\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"Georgia\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontSize\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"16px\"</font></li><li>        <font color=\"#009900\">}</font><font color=\"#339933\">,</font></li><li>        <font color=\"#3366CC\">\"button\"</font> <font color=\"#339933\">:</font> <font color=\"#009900\">{</font></li><li>            <font color=\"#3366CC\">\"background\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"#54ACFE\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"color\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"#FFFFFF\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"text\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"основное\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"padding\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"0 4px 1px 4px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"margin\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"0 0 0 10px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontSize\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"12px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontFamily\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"sans-serif\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontWeight\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"normal\"</font></li><li>        <font color=\"#009900\">}</font></li><li>    <font color=\"#009900\">}</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li><li><font color=\"#009900\">}</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li></ol
</blockquote>
</habracut><p>

Описания параметров:</habracut></p>

<h3>shadow</h3>

Набор опций задает настройки для тени. Пока доступна только одна возможная настройка для тени.
<dl><dt><b>opacity</b></dt>
<dd>
Задает степень прозрачности для фона.
</dd></dl>

<h3><br /></h3>
<h3>window</h3>

Набор опций задает настройки для окна, в котором отображается текст статьи.
<dl>
<dt><b>width</b></dt>
<dd>
Задает ширину окна.
</dd>

<dt><b>color</b></dt>
<dd>
Задает цвет текста внутри окна.
</dd>

<dt><b>fontFamily</b></dt>
<dd>
Указывает шрифт для отображения текста.
</dd>

<dt><b>fontSize</b></dt>
<dd>
Указывает размер шрифта по умолчанию для окна.
</dd>
</dl>

<h3>button</h3>

Набор опций задает настройки для кнопки, формируемой рядом с заголовком статьи.

<dl>
<dt><b>background</b></dt>
<dd>
Задает цвет фона кнопки.
</dd>

<dt><b>color</b></dt>
<dd>
Задает цвет текста внутри кнопки.
</dd>

<dt><b>text</b></dt>
<dd>
Указывает какой текст выводить на кнопке.
</dd>

<dt><b>padding</b></dt>
<dd>
Указывает внутренние отступы.
</dd>

<dt><b>margin</b></dt>
<dd>
Указывает внешние отступы.
</dd>

<dt><b>fontSize</b></dt>
<dd>
Указывает размер шрифта для кнопки.
</dd>

<dt><b>fontFamily</b></dt>
<dd>
Указывает семейство шрифтов для кнопки.
</dd>

<dt><b>fontWeight</b></dt>
<dd>
Задает полужирный шрифт текста на кнопке.
</dd>
</dl>

<h2>Ссылки</h2>
<p><a href=\"http://klimchuk.com/projects/reader\">Страница проекта</a></p>

<p><a href=\"http://klimchuk.com/reader-demo.html\">Демонстрация</a></p>

<p><a href=\"http://klimchuk.com/reader.jquery.zip\">Скачать в zip</a></p>

<h2>В качестве заключения</h2>
<p>
На чистоту и красоту кода я не претендовал, делал так, чтобы работало. Я не профи в jQuery, поэтому не ругайте сильно. Рад критике и любым предложениям по поводу реализации самого плагина.

Пользуйтесь на здоровье!
</p>

<p><a href=\"http://habrahabr.ru/blogs/jquery/98387/\" title=\"Оригинал статьи на habrahabr.ru\">Оригинал статьи</a></p>"

---

Велопрогулка по Минску
велик, поездки, путешествия, Минск
"<p>Как-то заработался и совсем забыл про свой блог. Оправдываться не буду. Потому дальше только по теме.</p>

<p>А тема такая. Кататься на велосипеде я люблю, к тому же для программиста спорт просто необходим из-за сидячего образа жизни. Вот я и решил размять мышцы и совершить мини-марафон на велосипеде. Описание поездки, впечатления и немного фото ниже.</p>

<h2>Начало.</h2>

<p>Началось все с того, что своего велика у меня нет, пришлось брать на прокат. Радует, что в этом плане в Минске сервис немного начал развиваться. Найти прокат велосипедов не совсем просто, но и не сложно. Основные точки у всех на слуху и всегда можно узнать или через знакомых или спросить у Google.  </p>

<p>Я уже который год беру велик в одном месте - точка проката по адресу Сухая, 23. Вполне нравятся тамошние велосипеды. Не новые, но за ними следят. К тому же цена вполне приемлема. Из минусов - на выходные разбирают почти всю технику.</p>

<p>Так вот, велосипед я взял. Прокатился по центру, освоился после длительного перерыва и решил сгонять по делам к другу. Ехать пришлось в самое Уручье. Для минчан несложно представить маршрут: метро Фрунзенская - метро Уручье. Добрался я туда не сказать чтобы быстро, просто ехал не спеша и не по самому короткому маршруту, но дела уладил и решил отправиться домой поспать, поесть и готовиться к основной вылазке.</p>

<p>Домой ехал я дольше, так как от Уручья до Лошицы значительно дальше, но справился. Хотя ехать было весело, так как дороги я не знал короткой и удобной. Спас навигатор, без него я колесил бы по городу куда дольше.</p>

<p>Зато когда искал дорогу из Серебрянки в Лошицу, наткнулся на забавных уток, которые совсем не боятся людей. <br /><img src=\"http://klimchuk.com/upload/posts/velo/utki.jpg\"></p>

<p>А вот путь из поселка к самому дому был просто экстремальным. К сожалению уже смеркалось и моя камера просто отвратительно запечатлела местность, потому фото не покажу. Но мне пришлось проехать по маленькой, едва заметной тропинке, порядка 400 метров. Адреналина добавляли трава и сорняки в рост человека и еще листья растения, очень похожего на борщевик. Этот участок я проскочил очень быстро :)</p>

<p>Дальше я ужинал, читал новости и спал.</p>

<h2>День второй.</h2>

<p>Маршрут на 2 день был выбран самый простой - обновить недавно построенную велодорожку в Минске. Протяженность - 27 км. Начинается в Чижовке и заканчивается за Веснянкой, проходя через весь город. Как оказалось, 27 км мне оказалось мало, о чем я потом немного жалел.</p>

<p>Так как я живу в Лошице, то чтобы попасть на старт, мне пришлось объехать Чижовское водохранилище вокруг, так как я не рискнул опять прокатиться по тропинке среди зарослей. Смотрится красиво.<br /><img src=\"http://klimchuk.com/upload/posts/velo/chig1.jpg\"></p>

<p><br /><img src=\"http://klimchuk.com/upload/posts/velo/chig2.jpg\"></p>

<p>Собственно момент старта я не подумал сфотографировать. Все таки цель была - велопоездка, я не фотосессия. Но ближе к центру я исправился.<br /><img src=\"http://klimchuk.com/upload/posts/velo/road1.jpg\"></p>

<p>По отдельный участкам дорожки я катался и раньше, но тогда это было не так хорошо, как сейчас. Тогда местами ее просто не было. Сейчас это просто отличная трасса, с отличным покрытием. Из минусов я отметил бы только 2 моста в районе студгородка БГУ и парочку крутых поворотов на спусках.</p>

<h2>День пожарника.</h2>

<p>Трасса проходит через Детский парк имени Горького. И так получилось, что в тот день свой профессиональный праздник отмечали пожарники. Пару кадров я решил сделать для коллекции.<br /><img src=\"http://klimchuk.com/upload/posts/velo/fire1.jpg\"></p>

<p><br /><img src=\"http://klimchuk.com/upload/posts/velo/fire2.jpg\"></p>

<p><br /><img src=\"http://klimchuk.com/upload/posts/velo/fire3.jpg\"></p>

<h2>Привал.</h2>

<p>Я люблю кататься на относительно высокой скорости. Не гоняю конечно, но и не медленно езжу. Отдыхать иногда тоже нужно. Поэтому недалеко от стеллы \"Город-герой Минск\" решил устроить небольшой отдых и зафоткать велик и себя.<br /><img src=\"http://klimchuk.com/upload/posts/velo/merida.jpg\"></p>

<p><br />Я получился размытым из-за ветра. Телефон несколько раз падал и я решил не мучаться и оставить лучшее из того, что получилось.<br /><img src=\"http://klimchuk.com/upload/posts/velo/iam.jpg\"></p>

<h2>До конца.</h2>

<p>Дальше я уже не фотографировал. Начало выглядывать солнце, стало жарко, да и усталость накапливалась. Я добрался до разворотного кольца, но решил посмотреть что за ним и проехал чуть дальше. И дернул меня черт посмотреть на карту. Увидел, что вроде недалеко Минское море и мне жутко захотелось на него посмотреть, так как не видел его до этого ни разу. И я поехал. Дороги нет, дорожка уже позади. Опять спас навигатор. По проложенному маршруту я быстро добрался до места назначения. Увидел, не сильно впечатлился и решил ехать назад. А назад ехать ни много не мало, а почти 30 километров. Учитывая что я уже проехал 27 км дорожки, добавляем сюда объезд Чижовки и путь от кольцевой до Минского моря - набираются все 40. Но делать нечего - я поехал.</p>

<p>Поплутал по рынку на въезде в Минск, прокатился мимо своей работы по Тимирязева и отвез велик. Почему не рассказываю, как ехал домой? Потому что был уставший и уже смутно помню все. Последние километры давались с трудом.</p>

<h2>Домой.</h2>

<p>Велик я сдал обратно. Уставший, но довольный поездкой, отправился домой. Ноги отказывались нести, но силы еще были. Плюхнулся в автобус, доехал до дома и дальше был просто отдых.</p>

<p><b>Самому кататься мне не привыкать, но кататься компанием порой все же интереснее. Поэтому если кто-то читает эту заметку и загорелся желанием покататься на велике, но не знает как и где его взять - пишите. Я с радостью с кем-нибудь покатаюсь.</b></p>

</cut>"

---

Дома вкусно кормят - 2
Лунинец, путешествия, дом
"Как и обещал, решил рассказать о втором дне поездки домой. К сожалению, время нашлось только сейчас и все в деталях уже не помню, но постараюсь вспомнить самое интересное.

<h2>Утро</h2>

<p>Утро было самым обычным. Летом дома как всегда жарко до невыносимости, но я спал как убитый. Сказалась дорога в субботу ночью и вечер программинга на С++ и Qt. Но выспаться как следует мне не дали. Мама разбудила, аргументировав: \"Пора завтракать!\". =)</p>

<p>Хорошенько подкрепившись (не зря в названии упоминается еда), было решено съездить навестить бабушку и другую родню, так как домой я приезжаю не часто. Поехали я, брат и батя. Дорога как дорога, ничего особенного. Но мне удалось порулить. Прав у меня пока нету, потому свободно где попало рулить я не могу, но вдалеке от города ГАИ не так часто встретишь, потому там мне кататься можно. </p>

<h2>Приплыли</h2>

<p>Сюрприз нас ждал, когда мы заехали к первой бабушке. После того, как мы распрощались, а время было ограниченно, зоркий взгляд брата-автомеханика заметил поломку. Поломка вроде пустяковая, но риск угробить двигатель приличный. Слетел ремень генератора и разбился натяжной ролик для этого ремня. Время поджимало, под рукой ничего не было, но брат не последний человек в городе и уже через 5 минут на помощь летел его друг с нужной деталью. Стоит заметить, что расстояние от города - 30 км, а нам порой и 300 метров бывает лень пройти. Вот он - пример настоящей дружбы и взаимовыручки.</p>

<h2>Едем дальше</h2>

<p>Устранив поломку тронулись дальше. Так как времени стало еще меньше, решено было ехать быстро и потому меня в скорости никто не ограничивал, что мне собственно и понравилось. Быстро ездить я люблю :)&nbsp; Ко второй бабушке заскочили мы быстро, пробыли там где-то с полчаса и тронулись обратно. Мне нужно было в определенное время ехать обратно в Минск, поэтому все происходило быстро и неинтересно.</p>

<p>По приезду домой меня опять накормили, я собрал вещи и приготовился ехать обратно в столицу, учиться и работать.</p>

<h2>В качестве заключения</h2>

<p>Так вот прошел 2 день моей поездки домой. Без фото, без интересных фактов, скучно и обыденно, но без этого топика образ поездки остался бы незавершенным, тем более что я обещал вторую часть. Но это не последнее мое путешествие и не только домой, так что в скором времени можно будет прочитать о новых местах, где я был, что видел. Я обязательно поделюсь своими впечатлениями и фото.</p>

</cut>"

---

Завершился круглый стол по Rails в Минске
ruby, rails, разработка, конференции
"<p>Все таки попал я на эту конференцию, хотя злоключений по пути было, но сейчас не об этом.</p>

<h2>Начало</h2>
<p>К началу я не успел, к сожалению, и опоздал минут на 10. К тому времени, когда я зарегистрировался, уже потихоньку началось выступление. Хотя, как оказалось, выступал организатор мероприятия, а доклад начался позже. Началось все с рассказа об истории языка Ruby: кто его разработал, почему и зачем, как он развивался и откуда появились Рельсы (Rails). Было довольно интересно слушать. Так же оказалось, что многие известные проекты, такие&nbsp; как Twitter, BaseCamp и др. были разработаны с использованием языка Ruby. Для кого-то это может и не новость, но я был слегка удивлен. </p>

<p>После небольшого экскурса в историю начали разбираться, что за зверь такой - Ruby. Как сказали докладчики, сравнивать нужно с чем-то, потому будем сравнивать с Java, которую немножко обидели. Но по заверениям тех же докладчиков, другие языки ни чем не хуже Ruby, просто он сам по себе хорош как язык и приятен. С такой позицией я согласен, каждый язык хорош в своем деле и холивары устраивать на пустом месте незачем. Видимо, это поняли и все остальные участники конференции, кроме одного бойкого и ярого питониста, но питонистам это простительно =) </p>

<h2>Ruby. Основы.</h2>

<p>Далее нам рассказали о преимуществах и особенностях языка, причем даже с примерами. К сожалению мое зрение с последних рядов не позволяло мне увидеть все, а народа было много. Организаторам пришлось приносить дополнительные стулья. Но что мне не понравилось, что слишком уж много было \"технических\" моментов озвучено, вместо того, чтобы рассказать об основных идейных принципах языка Ruby и фреймворка Rails. Видимо организаторы слегка просчитались с аудиторией, потому что знающих Ruby было всего процентов 20, а то и меньше, и в таком случае нужно было делать упор на рекламу языка и популяризацию, а не на технические аспекты. Хотя мне, как программисту со стажем, многие вещи все же были понятны.</p>

<p>Затем очень кратко и сжато было рассказано о фреймворке Rails. Штука оказалась интересной и не сильно сложной, что побудило ее в ближайшее время потрогать собственными руками. Время было ограниченно и многое пришлось лишь вскользь упомянуть, хотя о многих вещас стоило бы рассказать подробнее. Хотя докладчики и говорили, что язык и фреймворк сделаны так, чтобы ими можно было удобно пользоваться, не особо зная как это работает. Возможно это так, но профессионально разрабатывать приложения и не знать как они работают - это плохой путь. Всему виной явилась нехватка времени.</p>

<p>В целом сжато, местами скомкано, но все же было довольно интересно рассказано. Думаю, у начинающих изучать Ruby, или просто заинтересовавшихся сложилось хорошее впечатление о языке и его возможностях (я, например, подумываю заняться им серьезно). Дальше был кофе-брейк. </p>

<h2>Перерыв.</h2>

<p>Орагнизаторы поступили разумно и заготовили печеньки и кофе с чаем, так чтобы студентам или трудящимся людям было чем подкрепиться после учебы или работы. Ничего примечательного во время перерыва не было, просто передохнули немного.<br /><img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/1.jpg\"></p>

<h2>Блог за 15 (45 :) минут</h2>

<p>Дальше начался практический урок о том, как написать на Ruby on Rails блог с <strike>блекджеком и шлюхами</strike> постами и комментариями к ним. Если быть честным, то было немного скучновато, хотя звук рвущегося скотча в микрофон порадовал всех. Скучно было, потому что с задних рядов по прежнему было не очень видно что и как происходит на экране, к тому же окна сменялись достаточно быстро. Кто программировал, тот знает, что такое переключаться между окнами хоткеями и как при этом выглядит процесс со стороны. Поэтому в это время я читал твиттер и спрашивал гугл о жизни, отвлекаясь только на важные моменты и когда мне удавалось хоть что-нить разглядеть с экрана проектора.</p>

<p>В теме было заявлено, что блог можно сделать за 15 минут, вместе с комментариями мы уложились за 45 минут. Хотя я уверен, что у программиста с хорошим опытом создание такого блога действительно займет не больше 15 минут. У меня на php на простой блог уходит около часа без использования фремфорков, так что цифры вполне реальные.</p>

<img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/3.jpg\">

<h2>Круглый стол</h2>

<p>После того, как блог был написан, начался круглый стол. Часть людей ушли, кто по делам, кто еще по каким причинам, но около половины решило остаться, несмотря на позднее время. Было начало 10 вечера.</p>

<p>Во время круглого стола технические вопросы уже не рассматривались. Говорили больше об экономической составляющей разработки на Ruby on Rails и перспективах развития как языка, так и сферы применения возможностей технологии. Было затронуто множество вопросов касательно стоимости разработки на Ruby, были описаны проблемы поиска первого проекта для разработки, докладчики, выступающие теперь в роли экспертов, рассказывали о своем первом опыте в Ruby. Последний час обсуждения мне понравился больше, чем первые доклады, потому что во время обсуждения прозвучали реальные доводы в пользу разработки на RoR.</p>

<p>Правда время было ограниченно и вопросы из зала уже не успели прозвучать, в основном вопросы задавал ведущий и со стороны казалось что они играют в эдакий театр, а мы зрители. Но все прошло отлично, думаю все остались довольны.</p>

<img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/4.jpg\">
<img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/5.jpg\">

<h2>Заключение</h2>

<p>Для первой встречи такого рода мероприятие организовано толково, а накладки случаются даже у профессионалов. Думаю, следующая встреча буде куда интереснее и будет время, чтобы успеть пообщаться подольше (если орагнизуют в выходной день). Те, кто пришел на конференцию, получили нужную информацию для размышления и возможно сделают правильные выводы и примут в последствии верные решения, но это их уже дела. Орагнизаторам хочу пожелать не останавливаться на достигнутом, а продолжать работать в том же духе и проводить новые мероприятия, более интересные и запоминающиеся.</p>

<h2>PS</h2>

<p>Если верить словам докладчиков, велась аудиозапись выступлений и скоро данная запись и презенетации с конференции будут доступны в сети. Узнать можно будет <a href=\"http://belarusrubyonrails.org\">на сайте сообщества belarusrubyonrails.org</a></p>

</cut>"

---

Почему все считают неправильно?
блоги, твиттер, разработка, активность, пользователи
"<p>Вот задался я таким вопросом и сейчас объясню суть проблемы. Примером возьмем твиттер, хотя подойдет и любой другой сервис или сайт, или даже программа.</p>

<p>Проблема заключается в алгоритме подсчета активности пользователя - т.е. сколько он чего сделал в определенный промежуток времени. Все, как правило, поступают следующим образом: берется текущая дата, дата регистрации или начала активности пользователя, считается количество дней в этом промежутке и количество действий делится на количество дней, получаем результат - столько-то пунктов в день. Это обычное среднее арифметическое и в целом оно отражает верную картину, но не совсем.</p>

<p>Рассмотрим пример. Вот завел я себе твиттер, написал первый твитт и забыл о сайте на месяц, а потом вспомнил и стал активным пользователем. Рассчитанное среднее арифметическое упорно твердит мне, что я делаю 2 твитта в день, хотя на самом деле количество иногда достигает 10 или более. Понятно, что таким образом сглаживаются острые пиковые значения, но если я действительно оставляю каждый день 5 твиттов в течении недели, а потом опять замолкаю. Получается что в данный момент показатель неверен, как неверен и потом, когда я молчу. Я же тогда не пишу ничего, но показатель не на нуле.</p>

<h2>Проблемы</h2>

<p>Ясное дело, что посчитать среднее арифметическое до безобразия просто и даже работая с базой данных, приходится выполнять не так много запросов и вообще действий в программе, чтобы получить требуемое значение. Более сложный алгоритм работал бы медленнее. Не желание правильно считать терпимо для таких гигантов, как твиттер или другие социальные сети. Но минус в том, что с популярных сервисов все копируют не особо задумываясь, как улучшить копию. Это отдельная тема, почему там происходит.</p>

<p>Еще одной проблемой можно считать то, что для реализации более сложного алгоритма требуются хорошие познания в математике, если требуется решить задачу эффективно, что собственно удорожает разработку. Но я считаю эту проблему некритической, так как тут скорее важны объемы обрабатываемых данных. Потому что для среднего арифметического нам достаточно получить время первой активности и количество записей в БД за это время, т.е. всего 2 значения из БД и получить текущее время средствами языка программирования или самой БД. Итого выходит всего 3 значения, а если разрабатывать сложный алгоритм, нам нужно знать пики активности, спады и другие параметры, что замедлит работу. В этом заключается вторая проблема - неприменимость к существующим средствам хранения данных.</p>

<h2>Решение</h2>

<p>Есть более просто решение, которое не решит задачу полностью, но будет отражать более правильную картину. На каждом сервисе можно приблизительно посчитать среднее время реакции пользователей. Не знаю как правильно это назвать, но приведу пример для сравнения: ответ на форуме приходится ждать от нескольких часов до нескольких дней, в социальной сети чуть быстрее, в сервисах мгновенного обмена сообщениями - почти сразу же. Таким образом мы можем предположить, какое время отклика пользователя у нас на сайте. Зная это время мы можем рассчитать активность более точно.</p>

<p>На твиттере данные обновляются довольно часто, но у нас в условии изначально стояла задача - получить активность за день. Самый простой способ - взять текущий день, получить количество твиттов за этот день и вот вам активность, но она не будет отражать правды. Для такого случая одного дня не достаточно, нужно немного расширить временные границы. Узнать, до какой степени расширять диапазон, можно, основываясь на показателе времени отклика. Если у нас форум, то можно считать посты за последнюю неделю, если социальная сеть, то за несколько дней, если это сервис IM - то вообще за несколько часов или минут. Идея, я думаю, ясна.</p>

<p>Такая реализация мало чем отличается от реализации с крайними границами и средним арифметическим, но возможно будет работать быстрее, так как нам не нужно узнавать дату первой активности, мы ее можем получить просто вычетом длины диапазанона из текущего времени. </p>

<h2>Итог</h2>

<p>Что в итоге? В итоге, с теми же малыми затратами на ресурсы мы получаем более точную информацию об активности пользователя. Если я 3 дня подряд писал по 10 твиттов, а потом замолк на неделю, то мой показатель активности постепенно упадет до 0 и это будет правдой, так как он будет показывать, что последние дни я ничего не пишу.</p>

<p>Если у вас возникли вопросы или есть чем поделиться, пишите в комментариях. Я с радостью пообщаюсь на эту тему.</p>"

---

Дома вкусно кормят
дом поезд поездки путешествия Лунинец
"<p>На этих выходным по просьбам родителей, да и так уже по необходимости изредка появляться домой, ездил к себе на родину, в свой родной город. Там я уже не живу 4 года (ровно столько я учусь в университете). Поездкой я остался весьма доволен, чтото успел запечатлеть на фото, когда телефон с камерой был под рукой. </p>

<h2>Вечер пятницы</h2>

<p>С работы в начале думал отпраситься пораньше, но не получилось этого сделать. Сидел до упора. Потом проделал путь до вокзала лишь для того, чтобы убедиться, что билетов на поезд нет. Это меня огорчило и уже было пропало желание ехать домой, так как были другие важные нерешенные дела и перспектива добираться обратно в Минск непонятно на чем (а это 270 км пути) меня собственно не радовала. Но ближе к вечеру вопрос разрешился, нашлись нужные люди, телефоны и я договорился, что за умеренную плату обратно в Минск меня повезут машиной, что собственно и случилось, но об этом ниже. После непродолжительных сборов в 00.00 я отправился на вокзал, ловить электричку, так как ехать мне предстояло с пересадками. До 3 часов ночи ничего примечательного не случалось, так как включив хорошую музыку в наушниках я мило дремал в вагоне. В 3 часа ночи электричка приехала в Барановичи, где мне предстояло провести почти 2 часа в ожидании дизель-поезда до своего города. </p>

<h2>Привал</h2>

<p>Ничем не примечательный вокзал в Барановичах, за 4 года поездок абсолютно ничем не примечательный :).&nbsp; Единственная особенность, что там ночью работают все кафешки, две газетно-книжных лавки и киоск. И что меня поразило, там можно было спокойно пить пиво, прямо возле ларька, никто никого не гонял и не штрафовал. Из моих событий - там лишь была подзаправка кофе, так чтобы немного взбодриться, а все остальное время я провел в зале ожидания разгребая барахло из бекапа на нетбуке. </p>

<h2>Едем дальше</h2>

<p>Потом я сел в свой поезд, открыл нетбук и продолжил чтение книги почти до самого города. Ехал я всего 2 часа, но когда едешь целую ночь, тянуться они очень долго. Книга не дала скучать :)</p>

<p>Фотки ночью я не делал, так как качество было бы овтратительное, да и смотреть ночью нечего, а когда стало светать, я совсем забыл про то, что у меня есть камера в телефоне.</p>

<h2>Приплыли :)</h2>

<p>Приехал я на вокзал, там меня встретил брат, отвез домой на машине. Дома меня отлично накормили, так что даже спать перехотелось и я вспомнил, что камера есть, и что нада бы узнать, что дома изменилось за время моего отсутствия. А изменилось не так чтобы много, но было чему менятся. Были снегопады, были ливни и пришлось родителям и брату чинить крышу и сделали они нормальную лестницу на 2 этаж. Стыдно признаваться, но в свои 21 с хвостиком год я ни разу не был на крыше своего дома (всего 2 этажа) и решил туда залезть. Виды оттуда прекрасные, хоть и не очень высоко.</p>

<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-1.jpg\" width=\"500px\"></p>

<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-2.jpg\" width=\"500px\"></p>

<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-3.jpg\" width=\"500px\"></p>

<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-4.jpg\" width=\"500px\"></p>

<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-5.jpg\" width=\"500px\"></p>

<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-6.jpg\" width=\"500px\"></p>

<h2>Что было дальше?</h2>

<p>А дальше был отдых. Просто отдых - обычное ничегонеделание :) Покормили, поспал, поругался на dial-up, поигрался на компутере и тут меня ждал подвох, пришлось чинить компьютер брата. Проблема - перегрев. Ребята чистили компьютер - про пасту на процессор они конечно не в курсе. К счастью нашлись добрые люди и выручили, комп я починил. Поиграть мне удалось, ближе к вечеру я еще и попрограммировать успел. Вернее мое попрограммировать растянулось часа эдак на 4, но это уже издержки профессии. </p>

<p>День закончился неожиданно быстро и было решено лечь спать, а потом начался следующий день. Приключения были и там, но об этом напишу завтра, сегодня уже нету сил :)</p>"

---

Новый дизайн сайта

"<h2>Вместо предисловия<br /></h2>
<p>Как вы уже наверное заметили, уважаемые читатели, работа не стоит на месте. Постоянно я что-то делаю и меняю как на сайте, так и в блоге. Сайт родился недавно и это закономерно. Рубрика называется \"Новости блога\" и именно в ней я собираюсь рассказывать о новых возможностях и фичах моего сайта и блога. Я же программист и постоянно хочется что-то новое написать :)</p>

<h2>С чего все началось?<br /></h2>

<p>Изначально я сделал сайт в серых тонах. Выглядел он красиво, все таки умение верстать никуда не пропало, но вот с цветом я прогадал. Кому не показывал сайт, все говорили что какой-то он скучноватый, серый весь, тоску навевает. И я решил исправиться. Я не знаю вашего мнения пока что, но надеюсь я его услышу в <a href=\"../../blog/kommentarii-k-blogu\" title=\"\">комментариях</a>, которые уже работают. Один мой друг высказался: \"твою мать, какой яркий!\".&nbsp; Это еще не показатель, но это говорит о том, что направление верное.</p>

<h2>Почему именно голубой?<br /></h2>

<p>Всегда моим любимым цветом был зеленый, но как показала практика его применения, использовать его нужно осторожно и с умом. А мой максимализм и желание увидеть побольше зеленого цвета мешает соблюсти правильный баланс, потому я выбрал более нейтральные, но не менее привлекательный (по статистике самый любимый цвет у людей) - небесно-голубой. Из положительных качеств цвета - он практически не раздражает, не вызывает эмоций как красный, не нагоняет тоску как черный, не вызывает отвращение как коричневый. Я конечно не беру в расчет фанатов этих цветов, у всех у нас различные пристрастия, но всем не угодишь, поэтому самый рациональный путь в данном случае - путь наименьшего сопротивления. Если кто-то против голубого цвета, выскажитесь в комментариях. Мне будет интересно выслушать ваши мнения по поводу цвета, возможно даже, проблеме цвета можно посвятить отдельную статью.</p>

<h2>Что еще планирую менять?<br /></h2>

<p>Ответ будет коротким: пока ничего. В самом деле, пока все нравится и менять ничего не хочется. Исключения составят различные мелочи и исправления недочетов. О каком-либо крупном изменении я обязательно напишу, да и вы сами заметите.</p>

<p>На этом пожалуй закончу свой рассказ. Задавайте вопросы в комментариях или в <a href=\"../../fb\" title=\"\">форму обратной связи</a> , я всегда рад пообщаться.</p>

</cut>"

---

Лицемерие живет в каждом
тупые американцы, лицемерие, Беларусь, общество
"<p>Помнится, все от смеха падали, когда Задорнов в своих выступлениях так протяжно говорил: «Ну американцы и тупые! Ну тупые!!».</p>

<p>И все смеялись, когда смотрели видео-ролики об американцах, которым на улице задают элементарные вопросы, на которые они не могут ответить. Мы то думали, что вот они тупые, а мы все тут академики. И только молодое поколение дебилы, которые смотрят только телик. Согласитесь, взрослые иногда позволяют себе такие высказывания в адрес молодежи. </p>

<p>Люди бывают разные и порой я могу стерпеть такие выпады в свой адрес, потому что действительно еще молодой, неопытный, не прожил того, что прожили они. Но оказывается, лицемерие в обществе - это абсолютно нормально. Нормально так же то, что люди не разобравшись в вопросе пытаются навязать свое мнение, хотя заведомо знают, что они не правы. Но я не об этом.</p>

<p>С американцев мы плакали от смеха, а вот с видео, которые размещено ниже, нужно плакать от горя. Ибо мне стыдно за своих соотечественников. </p>

<p>
<object width=\"500\" height=\"400\"><param name=\"movie\" value=\"http://www.youtube.com/v/_0CNOliaACM?fs=1&hl=en_US&color1=0x006699&color2=0x54abd6\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/_0CNOliaACM?fs=1&hl=en_US&color1=0x006699&color2=0x54abd6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"400\"></object></p>

<p>И не говорите, что вот если бы меня спросили, то я сразу бы ответил. А вас спрашивали? А вы отвечали? Рядом с google.com каждый может считать себя умным. Так может проблема не в тупых американцах?</p>

<p>P.S. Спасибо авторам за видео. Открыли глаза.</p>"

---

Developing an Extras in MODx: configuring of the environment
modx, extra, developing, configuration, environment, настройка окружения, разработка
"<p><b>Hi, colleagues!</b></p>

<p>Some days ago I did have some free minutes and I started develop a new Extra for MODx Revolution. Results you will see later. But now I talk as about I configured my development environment for the comfortable developing and for simple assembly and deploying packages for MODx.</p>

<p>At first, I read article <a href=\"http://www.markhamstra.com/\" target=\"_blank\">Mark Hamstra</a>, where he wrote how we can change destination directory for assembling package. It was handy. Thanks, Mark! But I went on. Because... By this way I need every time build new packages and install it. And yet one problem - for successfull installation I need to change version for the packages. It takes a lot of time. But... I found a solution! (Maybe my solution will not interesting for MODx Team, as they create and build packages every day almost, but it will usefull for other developers).</p>

<p>My solution allow skip the stage of build and instalation of packages. We just writing code, debugging and if our code works, then we build our packages and we gives somebody it. Let\'s start!</p>

<h2>1. Environment</h2>
<p>I use Ubuntu 11.10 and this instruction is applied only for OS based on linux.</p>

<p>My instance of Revolution  was placed in directory on server:</p>

<pre><code class=\"bash\">/home/www/modx</code>
</pre>
<p>My packages placed in special folder near with Revo instance (we can put it to other place):</p>

<pre><code class=\"bash\">/home/www/pkgs/</code>
</pre>
<p>Example of pkgs folder:</p>

<pre><code class=\"bash\">root@server:/home/www/pkgs# tree -L 1
    .
    ├── modx-articles
    ├── modx-minishop
    └── modx-semanager

    3 directories, 0 files
</code>
</pre>
<p>Code of an Extra placed in folder with name as package name and this folder have this structure:</p>
<pre><code class=\"bash\">root@server:/home/www/pkgs/modx-semanager# tree -L 1
    .
    ├── assets
    ├── _build
    ├── config.core.php -&gt; /home/www/modx.by/config.core.php
    ├── core
    └── README

    3 directories, 2 files
</code></pre>
<p>In this example you see this line:</p>

<pre><code class=\"bash\">|-- config.core.php -&gt; /home/www/modx/config.core.php</code></pre>
<p>It is a symlink. What is a Symlink? <a href=\"http://en.wikipedia.org/wiki/Symbolic_link\" target=\"_blank\">Wiki</a> is describing it very details.</p>

<h2>2. Symlinks</h2>
<p>Symlinks on Ubuntu and on others Linux systems is a file, that contains path to destination. System thinks that it not a file, it is follow path and it is seeing other files, on that symlink is pointing. It is as pointer or just a simple link to other file or directory.
And this fact allow us use it for the good of us.</p>

<h3>core.config.php</h3>
<p>You see, that config.core.php is a symlink who follow my instance of modx revolution. It is nessessary for to work of the connectors and processors, because on /assets/components/modx-semanager/connector.php (on working instance of modx) contains this lines:</p>

<pre><code class=\"php\">require_once dirname(dirname(dirname(dirname(__FILE__)))).\'/config.core.php\';</code></pre>
<p>It means, that our connector.php trying get config.core.php from root path of our site on MODx. But if we have our package\'s code in other place, server will return error, because file will be not found. For exclude this situation we create symlink to original 
file config.core.php. In our case we need write the command in dir with our package:</p>

<pre><code class=\"bash\">ln -s /home/www/modx/config.core.php config.core.php</code></pre>
<p><strong>Note! You should write path to your own modx instance.</strong></p>

<h3>core and assets</h3>
<p>Our code placed in package\'s folder, but modx at the time of work will be try get code from the own packages folders as assets/components/component_name and core/components/component_name. To avoid this we need заставить modx to think, that code of packages placed in it own folders. Symlinks can help us.</p>

<p>Going on to /home/www/modx/core/components/ and make there our symlink:</p>

<pre><code class=\"bash\">ln -s /home/www/pkgs/modx-semanager/core/components/semanager semanager</code></pre>
<p>and going on to /home/www/modx/assets/components/ and make there other symlink:</p>

<pre><code class=\"bash\">ln -s /home/www/pkgs/modx-semanager/assets/components/semanager semanager</code></pre>
<p>After this manipulations modx will be think that code of components placed in it own folders, but in fact code will be placed in our special for package folder.</p>

<h2>3. What it will give?</h2>
<p>We is starting develop a new Extra in our modx folder. I am writing some code into file and I am refreshing page on back-end and it works. And if we wrote some code and it passed all test we can build packages in our directory with sources. And we can initiate git or hg repository in our folder, that will not include other source of code. </p>

<p>My name is Ivan Klimchuk. You can to ask me.</p>

<p>Sorry for my English. I am not a profi on english, but I hope I will better by time.</p>

<p>Your asks you can write to <a href=\"http://twitter.com/iklimchuk\">my twitter</a> or <a href=\"#addcomment\">via comments</a> at bottom. Thanks.</p>"

---

Новое на сайте

"<div><span class=\"Apple-style-span\" style=\"line-height: normal; \">Система стоит, нормально работает. Хорошее правило админов: \"работает - не трогай!\". Но оно применимо для тех вещей, которые настроил и забыл. Но если бы так поступали бы с сайтами, сидели бы мы в 90 годах и по сей день. Поэтому сайт должен быть динамичным, развиваться и совершенствоваться. Сразу конфетку создать нельзя.</span></div><div>Поэтому я тоже стараюсь не забрасывать сайт. И кроме обновления информации на сайте, написания новых постов в блог, слежу за технической составляющей сайта и дорабатываю недостающие элементы. Назвать это революцией на сайте нельзя, это просто улучшения косметические и технические и сделаны для того они, чтобы вам, пользователям, было удобнее пользоваться моим сайтом. Дальше я расскажу несколько подробнее о нововведениях.</div><div>кат</div><div>Обновленные комментарии</div><div>В системе стоит огромный модуль блога, где есть все средства для управления по сути всем происходящим. Многие вещи для вас останутся незамеченными, так как они разрабатывались для административной части сайта, но удобства это добавит.</div><div>Раз уж начала писать об админке, то о фишках в ней и расскажу сразу.</div><div>Наконец я дописал толковое управление комментариями в админке, что теперь позволяет быстрее реагировать на них. Борьба со спамом - основная проблема на настоящий момент. Каптча отчасти позволяет решить проблему, но лишает удобство пользования. Приходится лишний раз напрягаться, чтобы различить еле заметные символы, а боты совершенствуются и легко взламывают такие каптчи. Поэтому я отказался вообще от применения каптчи. Зато сделал несколько другую систему для упреждения потока спама. </div><div>Система позволяет банить неугодные IP адреса, следить за другими параметрами комментария, сканировать текст и делать соответствующие выводы. В таком случае комментарий попадает ко мне в любом случае, но не публикуется сразу на сайте. Что это дает - нормальные комментарии сразу попадают на сайт и мне не нужно тратить время, чтобы оперативно их публиковать, а плохие попадают в черный список, который я могу просмотреть и решить - спам это или нет. Исходя из практики скажу - это весьма удобно.</div><div>На этом фишки админки заканчиваются. Теперь о фишках пользовательской части.</div><div>Теги форматирования</div><div>Очень часто бывает так, что нужно в комментарии выделит какие-то слова, процитировать кого-то, привести пример. Можно все написать сплошным текстом, но это не так красиво получается и не всегда можно уловить суть автора комментария. Поэтому я добавил возможность простого форматирования текста в комментариях. Тех html-тегов, что я добавил, я считаю, достаточно, чтобы оформить текст более презентабельно. Работая с HTML уже почти 6 лет, могу сказать, что больше не нужно.</div><div>Цитирование</div><div>Я думаю, многие видели как устроены древовидные комментарии, когда можно отвечать на комментрий, а кто-то может ответить на твой комментарий. Это удобно, но не всегда. Порой проще отвечать на комментарии как на форуме - просто процитировав оппонента. Такую возможность добавил и я.</div>"

---

Комментарии к блогу
комментарии, блог, сайт, фишки, вопрос, уникальный, хабр
"<p>Выходной день выдался удачным и продуктивным, несмотря на такую жаркую погоду. В итоге я завершил работу над функционалом комментариев. Еще, правда, много работы в этом направлении, но это касается скорее административной части сайта. <cut></p>

<h2>Как комментировать?</h2>
<p>Учить как пользоваться комментариями не стану, расскажу лишь о том, что нужно для успешного добавления комментария. </p>

<p>В форме всего 3 поля для заполнения и все они являются обязательными. Указать нужно лишь имя, адрес emal и непосредственно само сообщение. Сразу хочу ответить на вопрос, зачем мне email? Я не собираю базу для спам-рассылки или чего-то еще, это нужно лишь для обратной связи с вами и для выявления уникальных пользователей по связке Имя-Email. Если кто-то боится оставлять свой адрес, я не заставляю, укажите любой другой адрес, главное чтобы он был правильным (например mail@example.com). </p>

<p>Если все поля заполнены, то комментарий успешно запишется в базу. На этом добавление комментария будет завершено.</p>

<h2>Фишки</h2>
<p>Из фишек комментариев на данный момент есть возможность давать уникальные ссылки на комментарий. Это должно быть как должное, но пока это является фишкой :) </p>

<p>Так же немного переделал внешний вид списка блогов, так теперь отображается количество комментариев и ссылка на комментарии непосредственно.</p>

<h2>Чего еще нет?</h2>
<p>Пока нету веток комментариев. Это не так уж и сложно реализовать и это будет, но не сразу. Есть так же желание сделать систему оценки комментариев (как на хабре), но пока это не главная задача.</p>

<h2>Критика.</h2>
<p>Если в механизме комментариев вас что-то не утсраивает или вы можете предложить какое-то решение, пишите. Пишите или в виде комментариев к этому посту, или через <a href=\"../../fb\" title=\"\">форму обратной связи</a>.</p>"

---

Как я брал напрокат машину в Минске
Как взять машину напрокат в Минске, прокат авто в Минске
"http://avr.by/"
draft

