Первичной организации БНП РУПП «Гранит» быть!
рупп, гранит, микашевичи, лунинец, брестская область, независимость, профсоюзы
<p><i>Меня радует, что на моей практически малой родине нашлись разумные и смелые люди, готовые отстаивать свои интересны последовательно и до конца. Выражаю уважение и поддержку парням в нелегкой борьбе с прогнившей системой!</i></p><p>В декабре 2011 года рабочие РУПП «Гранит» в г. Микашевичи Брестской области решили выйти из первичной профсоюзной организации, входящей в состав ФПБ, и организовать новую профсоюзную организацию и вступить в состав Белорусского независимого профсоюза (БНП).</p>

<p>Конкретный шаг в защиту своих законных интересов вызвал небывалое агрессивное отношение к ним власть имущих. В ход был запущен давно испробованный механизм угроз и расправы над рабочими РУПП «Гранит» и их близкими.</p>

<p>Более того, был освобожден от работы руководитель предприятия. В кои времена на предприятие прибыл председатель Брестского облисполкома <b>Сумар К. А.</b> не для того, чтобы рассмотреть низкий уровень зарплаты, а урезонить рабочих, заявивших во весь голос о создании собственной профсоюзной организации и желании вернуть законное право на достойную жизнь.</p>

<p>Самоорганизация рабочих, вылившаяся в создание первичной профсоюзной организации БНП на РУПП «Гранит», была произведена в полном соответствии с Конституцией Республики Беларусь, законодательными актами и Уставом БНП.</p>

<p>Мы заявляем решительный протест нынешнему руководству РУПП «Гранит», местной вертикали власти г.Микашевичи, руководству Брестского облисполкома за вмешательство во внутренние дела первичной организации профсоюза и их осознанное нежелание исполнять соответствующие законы Республики Беларусь.</p>

<p>Мы требуем:</p>

<p></p><blockquote style=\"margin: 0 0 0 40px; border: none; padding: 0px;\">От руководства предприятия - незамедлительно предоставить юридический адрес для регистрации профсоюзной организации;<br />От местных и областных структур власти - прекратить давление и запугивание рабочих и их родственников и близких и зарегистрировать первичную профсоюзную организацию РУПП «Гранит».<br />Мы заявляем солидарность с рабочими РУПП «Гранит» и будем использовать все возможные меры и средства по защите их законных прав.<br />Мы объявляем сбор пожертвований во всех регионах республики для оказания материальной помощи членам БНП – рабочим РУПП «Гранит».</blockquote>
<p></p>

<p><b>Знайте - Вы не одни! Мы с вами! Первичной организации БНП РУПП «Гранит» быть!</b></p>

<p></p>

---

Первая запись блога
0
<p>Доброго времени суток, уважаемые пользователи.</p>
<p>Этим постом я хочу начать свой блог.</p>
<p>Для начала хотелось бы рассказать, о чем я хочу писать в свой блог и почему я не пользуюсь уже готовыми сервисами типа ЖЖ и другие. А также рассказать для кого я буду писать, о чем я буду писать и как часто я буду писать в свой блог.</p>
<h2>Почему не ЖЖ и сотоварищи?</h2>

<p>В целом ЖЖ очень удобная площадка для ведения блогов. Команда сервиса многое сделала для того, чтобы пользоваться им было крайне удобно. Это несомненно так, к тому же там достаточно много пользователей, которые прочитают твой блог и поделятся мнением. Свой сайт или блог продвигать куда сложнее, и это я оспаривать не стану, но есть некоторые ньюансы. </p>

<p>Чем меня привлекает ведение отдельного блога? Тем, что в своем блоге я имею полную свободу и независимость. Нет, я конечно завишу от хостера, но все же. Я имею доступ к сверверу, умею программировать и могу в своем блоге реализовывать такие вещи, которые в том же ЖЖ почти никогда не будут реализованы. Там слишком много людей и всем не угодишь, а я для себя и для тех пользователей, кто будет заходить в мой блог, могу реализовать любой функционал. Вторым пунктом идет безопасность и сохранность данных. Несомненно, крупные сервисы очень хорошо заботятся о безопасности, но мне спокойнее когда я сам могу сделать backup своих записей, и я не боюсь того, что в один прекрасный момент часть из них случайно пропадет.</p>

<h2>Для кого этот блог?</h2>

<p>Мне друзья задавали вопросы, мол а для кого и для чего я это делаю? Ответ очень прост. Сайт я делаю для себя, как хобби. На своем сайте я размещаю информацию о себе, как о человеке, как о специалисте в своей области. Конкретно для кого блог? Для всех, кому я или мои увлечения, занятия интересны. Я программист, но это не значит что у меня нет других интересов или увлечений. Я увлекаюсь и психологией и коммуникацией и мне порой есть что сказать или просто поделиться наблюдениями, так что я думаю блог будет интересен многим.</p>

<h2>О чем я буду писать?</h2>

<p>Я уже описал немного о чем я буду писать в абзаце выше, но немножко конкретизирую. Писать я буду о том, чем я интересуюсь или увлекаюсь в данный момент. Это и программирование (о чертов гик :), и психология, и спорт и многое другое. Тем для общения предостаточно, главное чтобы это было интересно читать. Не буду обещать всего и много, потому что кто его знает как оно будет получаться. Посмотрим вместе, что получится из затеи с блогом :).</p>

<h2>Как часто я буду писать?</h2>

<p>Регулярно выходят газеты, журналы. Там работают профессиональные журналисты, которые умеют писать и пишут постоянно. Я же не профессиональный журналист и писать каждый день новости не умею (на крайний случай есть <a href=\"http://twitter.com/Alroniks\" title=\"\">twitter</a>). Каждый день хорошо я умею делать только одну вещь - программировать (и то бывают случаи). Так что писать я буду согласно внутренним позывам поделиться новостью или идеей с читалетем. Все таки я считаю, что писать - это творческий процесс, если писать качественно и интересно и торопиться нельзя.</p>

<h2>В качестве заключения.</h2>

<p>Какие-то общие моменты я постарался затронуть, возможно не все учел. Но это всего лишь первый пост. Следите за новыми записями, учавствуйте в обсуждениях (комментарии я в самое ближайщее время сделаю), делитесь своим мнением. За сим перед вами откланяюсь.</p>

---

Крестный отец
отец, крестный, папа, серафим, семья, крещение, светлана
<p>Сегодня утром я был посвящен в таинство крещения и стал крестным отцом будущему мужчине Серафиму. Для меня это было в новинку и, честно признаться, пришлось немного поволноваться. Много нового, куча неизвестного, я не владею и не контролирую ситацию. Но деваться некуда, отказываться не принято вообще, так что справился. Отдельная благодарность крестной маме Светлане, с которой мы теперь духовные наставники Серафимки :) Она помогала.</p><p>А совсем юному Серафиму я желаю здоровья крепкого и чтобы сильно не вредничал, а то не за что подарками баловать будет :)</p>

---



{"id": 26,"pagetitle": "Инерция мысли","longtitle": "психология, мысли, инерция, думайте, носки, рекламы, механика, инерция мысли","description": "","alias": "inercija-mysli","published": 0,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Все учились в школе и объяснять что такое инерция, я думаю, смысла нету. Если кто забыл - учебник физики, раздел - механика. Но мы не о физической инерции.</p><p>Сколько раз вы ловили себя на том, что вот вы сидите, думаете, думаете - а потом - БАЦ! Вас осенило! Произошла мелочь буквально. Одно слово, один взгляд, пылинка на плече, или дурак, перебегающий дорогу на красный? Не важно. Важно, что вас осенило. Мысль крутились в голове, виднелся ее хвост, но поймать не удавалось, а тут как будто капкан захлопнулся и мысль ваша. Знакомо? Уверен, что знакомо.</p><p>А что вас подтолкнуло к этому? Правильно, импульс. Вы вынашивали идею, или вы думали, потом не думали, а потом опять начали думать и у вас эта мысль созревала, формировалась и потом небольшой толчок - и родилась. Но! Тут приложили внешнюю силу - был сторонний импульс. По большому счету к инерции мысли это факт имеет отдаленное отношение, но так происходит всегда.</p><p>А вот что мы не замечаем, когда оно происходит? Я начал замечать это в последнее время, когда мне начали говорить, что я делаю и думаю, что мне говорят. И я просто стал себя лавить в такие моменты. И заметил странную особенность.</p><p>Мысль - это как вязкая жидкость. Она может течь сама по себе, но она вязка и липкая и так и норовит прилипнуть к чему-нибудь, в какой-нибудь поверхности. Мы общаемся, мы обмениваемся словами, мнениями, разговариваем, спорим, обсуждаем и это все влияет на мысль. Каждое слово - как новая поверхность. Но одно слово может быть как пластик - гладким и скользским - тогда мысль не прилипнет к нему, а может быть деревянным и не струганым и мысль за него цепляется. Но мы этого не замечаем. Мысль зацепилась, а мы продолжаем думать, как будто мы сами к этому пришли.</p><p>Простой пример. Сидите вы и разговариваете с человеком, думаете о чем-то, но вдруг он произности какое-то слово, которое вас зацепило или рассказывает историю интересную, а у вас сразу всплывают воспоминания, или что-то подобное прочитанное и вы начинаете думать об этом, и вы слушаете собеседника, но уже представляете образы, только свои, из воспоминаний и у тут вы, чтобы поддержать беседу, говорите: \"А я вспомнил похожую историю, которая случилась с моим дядей\". Или: \"А я знаю еще анекдот\". Знакомо? Вполне.</p><p>Но эти то ситуации очевидны, тут и говорить нечего, капитан очевидность отдыхает. Но такое случает постоянно. И в большинстве случаев этого мы не замечаем. Услышали слово, начали думать, придумали и радуетесь, что вы придумали, а на самом деле нет - слово подтолкнуло в нужную сторону, а вы просто развили тему на основе своих воспоминаний. И все бы хорошо, если бы не реклама. На этом умные люди научились зарабатываться деньги, рекламируя нам товары. Телевизор, радио, наружная реклама, любая другая реклама - создают такие ловушки для нашего сознания. Есть разные типы реклам и действуют по разному и не только реклама тут сильна, но если ненавязчиво говорить нужные слова, то по инерции мы сами придумаем нужное оправдание нашим поступкам либо по инерции примем то, что нам пытаются навязать, за собственные мысли.</p><p>Мои размышления тоже могут быть подверженны инерции, я это не исключаю. Но я всего лишь наблюдал и пришел к такому выводу. К тому же, инерцию можно создать самому, если периодически вспоминать что-то определенное. Это сложнее и как это сделать, я рассказать не смогу. Вам же я посоветую контролировать свои мысли или хотя бы наблюдать за тем, как вы думаете. Подумайте, как вы думаете. Подумайте! Носки. ;)</p>","createdon": 1326666952,"editedon": 1326666952,"deletedon": 0,"publishedon": 1326666952,"menutitle": "","uri": "blog/closet/inercija-mysli/"}, {"id": 27,"pagetitle": "Настоящие имена и анонимность в сети","longtitle": "анонимность, сеть, социальная сеть, порядок, фамилии, имена, настоящие, жизнь, общество","description": "","alias": "nastojashhie-imena-i-anonimnost-v-seti","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Сегодня прочитал по ссылке из twitter вот&nbsp;<a href=\"http://www.bbc.co.uk/russian/society/2011/07/110728_google_real_names.shtml\" title=\"\">этот пост</a>&nbsp;про то, зачем Google наши настоящие имена. Многие тезисы описаны вполне правильно. И я с ними согласен.</p><p>Спамеры, другие мошенники - все они ищут способ легко заработать на доброте, незнании, наивности людей. Одним словом пользуются слабостями человека и извлекают из этого выгоду. Не сказать, что они не работают. Они работают, пишут или покупают программы для спама, пишут зловредных ботов, но зарабатывают на обмане. Но единственное, что их спасает, это то, что никто не знает имен. Под ником может скрываться кто угодно. А знаете у скольких людей ник например \"Angel87\"? Или любой другой такой. У миллионов.&nbsp;</p><p>А когда ты в сети оставляешь имя, свое настоящее имя, фамилию, ты начинаешь чувствовать ответственность. Это раньше можно было творить что-то в сети и оно никак не отразилось бы в настоящей жизни. А сейчас, когда даже официальные ответы можно получить через твиттер, любое действие в сети может вызвать череду действий в реальности. А раз ты указал свое настоящее имя, будешь и по голове получать реально. Поэтому и ответственность и понимание, что накажут.&nbsp;</p><p>Некоторые верят, что в сети можно оставаться анонимным. Хотелось бы верить, что это возможно. Уже много статей на эту тему написано и технических и не очень. Абсолютной анонимности в сети нет. Я за 20 минут на днях накопал досье на одного человека. Без использования каких-то взломов, воровства паролей и т.п. Просто поиск в Google, использование информации из социальной сети о друзьях и&nbsp;немного мыслительного процесса - и основная информация о человеке есть. Хотя человек этот очень старательно скрывался, а вы говорите анонимность.&nbsp;</p><p>Поэтому я сделал вывод, что смысла скрываться нет. Лучше указать свои настоящие данные. Это к тому же и дисциплинирует. Под ником ты можешь кого-нить оскорбить, а под своим именем придется отвечать. К тому же указание имен приводит к порядку. Я, например, записываю все свои контакты по имени и фамилии. Везде: в телефоне, в аське, в скайпе, в джаббере. Запомнить порядка 100 ников сложновато, а по имени и фамилии человека всегда легко идентифицировать. Это приводит к порядку. Причем не только в моей книге контактов, а в целом в интернете.</p><p>Многие говорят о построении сетевого общества. И это происходит. Реальная жизнь уже тесно перемешана с виртуальной, только вот проблема - в реальной жизни один, в виртуальной другой. Так и шизофреников не долго стать. А если совмещать и то и то. И в реальной жизни я, и в виртуальной жизни я. Не разный, всегда одинаков. И реальностей не 2, а одна, просто совмещенная. Социальные сети этому очень помогают. Есть контакты человека: можешь позвонить, можешь написать, можешь по видео пообщаться с ним по интернету, а если случайно рядом оказались, можно и встретится. Но контакт есть почти всегда. А раньше нужно было несколько дней ехать лошадьми на расстояние, которые сейчас за пару часов проезжается. А самолеты? Тоже часы между материками. А сеть? Пару секунд, пока пакеты обработаются оборудованием - и вы уже общаетесь. Это замечательно. Но! Опять же - достоверные данные, имя-фамилия - это вызывает доверие, ник - нет.</p><p>Анонимности нет, общество строим, мошенников плодим, называться сопротивляемся. Зачем? КГБ, ФСБ, ФБР найдут и без соц. сети, если им понадобится, у них информации хватает и так. А может вы мошенник, преступник, если не хотите называть себя? Я нет, мне скрывать нечего. Давайте приводить в порядок этот информационный хаос.</p><meta http-equiv=\"content-type\" content=\"text/html; charset=utf-8\">","createdon": 1311883200,"editedon": 1311883200,"deletedon": 0,"publishedon": 1311883200,"menutitle": "","uri": "blog/closet/nastojashhie-imena-i-anonimnost-v-seti/"}, {"id": 28,"pagetitle": "Новый блоговый движок","longtitle": "блог, сайт, новый дизайн, разработка","description": "","alias": "novyj-blogovyj-dvizhok","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Как-то последнее время зрела мысль, чтобы эдакое сотворить с сайтом. В данном виде, как он есть, сайт уже больше года существует. Но он перестал меня удовлетворять. Нужно переделать дизайн, упростить верстку, убрать лишний хлам в виде скрипта, который меняет размеры буковок в зависимости от разрешения. На 800 он крутенько делает буковки мелкими, а вот на 1900 - это без мата и не назовешь :)</p><p>Поэтому собираюсь сделать полномасштабную уборку этого гадюшника. Видели бы вы, сколько мусора валяется в корне сайта. В планах выпилить движок блога из текущей CMS. Систему текущую видимо придется пока оставить, потому что новая еще не скоро допишется, а вот блог придется переписать по человечески и отдельным движком. Так будет быстрее и лучше, чем пилить все вместе. Есть идея так же написать блог на питоне, но то видимо будет отдельный проект для души и не будет касаться написания заметок для читателей.</p><p>Если у вас есть замечания к текущему блогу или к функционалу сайта - высказывайтесь. Буду записывать все замечания. В идеале конечно выложить весь код на какой-нить гитхаб или битбукет и открыть там багтрекер (на битбакете он есть встроенный), чтобы туда можно было писать баги. Но это потом, пока пишите просто в комментарии.</p><p>Новый упрощенный дизайн блога и возможно сайта в ближайшее время ждите 100% :) Сроки - месяц максимум.</p>","createdon": 1310598383,"editedon": 1310598383,"deletedon": 0,"publishedon": 1310598383,"menutitle": "","uri": "blog/closet/novyj-blogovyj-dvizhok/"}, {"id": 29,"pagetitle": "Просто подкаст. Номер 0","longtitle": "личное, работа, универ, велосипед, подкаст","description": "","alias": "prosto-podkast-nomer-0","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<h2>Шоу-ноты
</h2>
- Вступление.О чем я вообще?<br>
- Ах да! Я закончил универ! :)<br>
- Почему я не хочу менять работу и согласен получать меньше<br>
- А как же без личных проектов? Они есть!<br>
- Велосипед. Страсть<br>
- Пишите предложения<br><br>

<object width=\"500\" height=\"40\" classid=\"clsid:D27CDB6E-AE6D-11cf-96B8-444553540000\"><param name=\"movie\" value=\"http://s.rpod.ru/swf/playa.swf?xmlURL=http%3A%2F%2Fs.rpod.ru%2Fxml%2Faudio%2Fa200832.xml\"><param name=\"allowfullscreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://s.rpod.ru/swf/playa.swf?xmlURL=http%3A%2F%2Fs.rpod.ru%2Fxml%2Faudio%2Fa200832.xml\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"40\"></object>","createdon": 1310068800,"editedon": 1310068800,"deletedon": 0,"publishedon": 1310068800,"menutitle": "","uri": "blog/closet/prosto-podkast-nomer-0/"}, {"id": 30,"pagetitle": "Время = Деньги. Экономить?","longtitle": "игры, жизнь, время, сериалы, фильмы, распорядок","description": "","alias": "vremja-dengi-jekonomit","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Хотел для начала спросить, от каких вещей с возрастом вы отказались? От чего отвыкли, к чему, может быть, привыкли? Если есть что ответить, жду в комментариях. А я расскажу, от чего отвык я.</p>

<cut>
<h2>Игры</h2>
<p>Последние года полтора, наверное, стал замечать за собой, что компьютер превратился исключительно в инструмент для работы. Нет, я бывает отдыхаю, когда смотрю на нем какой-нибудь фильм и ролики на yuotube, но вот компьютерные игры для меня ушли в небытие. Можно возразить, что мол у меня же Линукс и у меня игры не идут, и я тут вот просто завидую тем, у кого есть возможность играть. На самом деле все куда серьезнее. Собственно из-за того, что меня не держали игры я и перешл безболезненно на новую операционную систему. А игры как перестали интересоваться, так и до сих пор интереса к ним нет.&nbsp;</p>

<p>Это не значит, что я вообще не умею играть или не хочу. Нет. Иногда я могу конечно погонять в гоночки, когда уж совсем нечего делать, но пристрастия такого нету, чтобы вот пришел с работы и давай играть. Это касается любых игр, будь то экшены или гонки или стратегии, они стали неинтересны и воспринимаются как пустая трата времени. А в тему игр вспомнился недавний диалог на bash.org.ru, где обсуждалась покупка оборудования для отличной игры за 1000$. Ответ был логичным - за 1000 можно купить жигуль с 100% физикой и графикой :) Не вижу смысла вообще тратить деньги на игры, как и время. А время = деньги. В любом случае тратятся деньги.</p>


<h2>О фильмах и сериалах</h2>
<p>Раз не играю, значит видимо занят чем-то другим. Возможно, но не просмотром сериалов. На самом деле я смотрел много сериалов. Если верить статистике myshows.ru, то я потратил 260 часов своей жизни на просмотр сериалов. Это очень много и видимо подсознательно я начал это понимать. Очень многие сериалы я не стал досматривать, потому что мне стало неинтересно. Опять же экономим время.</p>

<p>С фильмами немного другая история. Хорошие фильмы стоит иногда смотреть. И я смотрю. В среднем выходит от 3 до 10 фильмов в месяц. Не интересно.</p>


<h2>Чем занимаюсь?</h2>
<p>Раз такое время высвободил, то резонный вопрос, чем я занимаюсь. Да, сериалы не смотрю, не играю, но много времени провожу в сети. В какой-то мере можно назвать это общение, но скорее поглощаю текстовую информацию. Твиттер стал отнимать часть времени. Пока не катастрофическую, но в целом интернет много требует на себя внимания и следующим этапом будет сократить время бесполезного пребывания в сети.</p>

<p>Остальное время идет на собственные проекты и стартапы, спорт (велосипед), образование.&nbsp;</p>


<h2>Выводы</h2>
<p>Я не говорю, что я у меня все идеально со временем и что нужно поступать так, как я. Не смотреть сериалы и не играть удобно в первую очередь для меня, для остальных это может быть неприемлемо. Но интересно, как от привычек, навязанных нам \"сверху\", избавляетесь вы?</p>","createdon": 1306662885,"editedon": 1306662885,"deletedon": 0,"publishedon": 1306662885,"menutitle": "","uri": "blog/closet/vremja-dengi-jekonomit/"}, {"id": 31,"pagetitle": "Не сношайте мне мозг","longtitle": "мозг, общество, накипело","description": "","alias": "ne-snoshajte-mne-mozg","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Казалось, бы люди тем и отличаются от животных тем, что умеют говорить и на основе этого строят свои взаимоотношения. Польза в этом какая-то есть, несомненно. Но как же порой раздражает общество в целом со своим сводом, зачастую, очень глупых правил.</p><p>Вспоминается одна история. Пришли люди к Богу и давай жаловаться, мол надоели правила и условия, хотим жить вольно! На что он им ответил: \"Хорошо, верните то, что я вам дал и живите вольно\". И начали везти люди целыми тачками всякие свитки и книги и сваливать в кучу. На что бог им ответил: \"Верните мне только мои 10 заповедей, которые я вам дал на гранитной плите. То, что вы сами для себя придумали и написали, мне не нужно\".</p><p>Эта история мне понравилась как раз тем, что показывает реальную проблему общества как раньше, так и сейчас. Каждый раз люди с благими намерениями вводят законы, правила, стремятся заставить других их соблюдать, потому что им так удобно, а мнение других их мало волнует. Это же правильно, а остальные еретики!</p><p>А потом люди начинают эти правила нарушать, потому что в определенной ситуации это необходимо. Самое интересное, что даже в законах есть такой пункт, когда правонарушение, которое предотвратило большее правонарушение не считается таковым. Но общество непреклонно - это неправильно, аморально, еще как-то.&nbsp;</p><p>А сколько было примеров, когда миссионеры \"ценностей\" сами оказывались злостными нарушителями правил? Да сотни тысяч. Постоянно в новостях мелькают такие истории.&nbsp;</p><p>Я бы написал больше, но не хочу и скажу коротко: \"Не ебите мозги своими дебильными правилами!\"</p><p>Если тебе не нравится человек - не общайся с ним. Если он тебя достал - дай ему в морду. Общество навязывает ценности, которые удобны ему, а не человеку. Личность должна создавать общество вокруг себя, такое, в котором Личности комфортно. У нас же общество диктует Личности, какой ей быть. А то, что в общество достаточно быдла, об этом мало кто задумывается.&nbsp;</p>","createdon": 1305316800,"editedon": 1305316800,"deletedon": 0,"publishedon": 1305316800,"menutitle": "","uri": "blog/closet/ne-snoshajte-mne-mozg/"}, {"id": 32,"pagetitle": "Первые покатушки","longtitle": "Минск, велосипед, Чижовка, Лошица, Trek, veloby","description": "","alias": "pervye-pokatushki","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Только вчера я купил себе велосипед. Остановился на вполне сносной модели Trek 3500 за разумные деньги.&nbsp;</p>

<p><img src=\"http://klimchuk.com/upload/posts/pervye-pokatushki/vel.jpg\"></p>

<p>Понятное дело, что новый велик и не покататься — это неправильно. Немного погонять я успел еще вчера, когда ехал из магазина на работу и потом с работы домой. Назвать то покатушками сложно, я скорее просто искал дорогу домой и спешил до закрытия ларька, чтобы купить карточку для интернета, так как анлим закончился. Но сегодня решил немного размяться, проехаться не спеша по окрестностям. Давно хотел узнать свой район, в котором живу почти год. Подробности поездки под катом.</p>

<cut>




<h2>Поездочка :)</h2>



<p>Началось все с того, что пришлось спускаться с великом по лестнице, так как напрочь заглючил лифт в доме. Хорошо, что живу не на последнем этаже. С 7 можно и пешком. Дальше сел и поехал. Все просто :)</p>







<p>Местами было трудно ехать, так как ветер дул в лицо, еще в один момент я поехал не туда, но вовремя сверился с картой. Когда возвращался почти домой, решил, что покатался мало и свернул в сторону Чижовского водохранилища. Разведал там парочку тропинок, а так же увидел, но пока не понял назначения, многочисленные дамбы из песка. По одной из них я выехал куда-то на другой берег.</p>







<p>Ехать по ним местами страшно (там стоят таблички с надписью \"Опасная зона\"), так как рядом вода и самой дороги, а с другой стороны &mdash; обрыв до воды метра в 2. Но как оказалось потом, это не самое страшное.</p>











<h2>Я был похож на идиота</h2>



<p>На Чижовском водохранилище есть непонятная мне дамба, которая перекрывается его не по середине, но в одном из уголков (<a target=\"blank\" href=\"http://maps.google.com/maps?f=q&amp;source=s_q&amp;hl=en&amp;geocode=&amp;q=Minsk,+Belarus&amp;aq=1&amp;sll=37.0625,-95.677068&amp;sspn=50.777825,79.013672&amp;ie=UTF8&amp;hq=&amp;hnear=Minsk,+%D0%9C%D1%96%D0%BD%D1%81%D0%BA%D1%96+%D1%80%D0%B0%D1%91%D0%BD,+Minsk+Province,+Belarus&amp;ll=53.841925,27.605306&amp;spn=0.004659,0.009645&amp;t=h&amp;z=17\" title=\"\">Google Maps - чтобы было понятно</a>). По идее, будь она нормальной дамбой с нормальной дорожкой - это было просто супер, потому что тогда можно было бы из Чижовки попасть к началу велодорожки.</p>







<p><img src=\"http://klimchuk.com/upload/posts/pervye-pokatushki/kosa.jpg\"></p>







<p>Я поехал по ней проверить. Лучше бы не ехал! Кричащие чайки только дополняли атмосферу. Местами дорожка сужается до 1,5 метра, кругом вода и жуткий крик чаек. Было немного не по себе. Но куда опаснее было то, что там песок! Он сухой, и его много. Колеса просто тонут в нем и ехать почти невозможно даже на низкой передаче. Добавим сюда узкую дорожку - есть риск, что одно неловкое движение и ты летишь вместе с великом в воду. Тем, кто неуверенно себя чувствует на велосипеде, туда лучше вообще не соваться. Меня спас мой многолетний опыт езды по такого рода дорогам.</p>







<p>Проехал по этой \"тропе\" я два раза, потому что когда я добрался до конца и думал, что вылезу на берег.... Как же я ошибался :)</p>







<p><img src=\"http://klimchuk.com/upload/posts/pervye-pokatushki/tupic.jpg\"></p>







<p>Вот так вот! Столько мучился и последнее испытание - почти 10 метров воды! Тут помогли бы навыки левитации, но я ей не владею, к сожалению. Пришлось повернуть обратно.</p>







<p>Домой я добрался уже благополучно и теперь отдыхаю.&nbsp;</p>







<p><i>P.S. Постараюсь периодически рассказывать об интересных моментах моих велопрогулок.</i></p>



</cut>","createdon": 1302897600,"editedon": 1302897600,"deletedon": 0,"publishedon": 1302897600,"menutitle": "","uri": "blog/closet/pervye-pokatushki/"}, {"id": 33,"pagetitle": "Мои соболезнования семьям погибших в Минске","longtitle": "Минск, метро, 2011, взрыв, люди, помощь, доноры, апрель","description": "","alias": "moi-soboleznovanija-semjam-pogibshih-v-minske","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Уже всем известно, что произошло вечером, в час пик на минской станции метро - Октябрьская. В 17:56 там прогремел взрыв, унесший жизни 11 человек (предположительно), более сотни получили травмы разной степени тяжести. <b>Выжившим я желаю скорейшего выздоровления. И выражаю свою скорбь и соболезнования семьям невинно погибших людей.</b>&nbsp;</p>

<p>Пока в интернете и на новостных сайтах информация появляется отрывками, местами не совсем достоверная. Это понятно. Журналисты работают, многое непонятно и многим просто страшно. Мы сегодня вечером сделали сайт&nbsp;<a href=\"http://metro11.info\" title=\"\">metro11.info</a> чтобы помочь людям. Возможно кто-то хочет сдать кровь и помочь пострадавшим, или узнать, есть ли среди пострадавших родственники. Мы будем стараться собирать имеющуюся информацию и публиковать на сайте. Если у вас есть какие-либо сведения, сообщайте пожалуйста по почте&nbsp;<a href=\"mailto:minskmetro11@gmail.com\" title=\"\">minskmetro11@gmail.com</a>&nbsp;.</p>

<p>Важно сейчас помочь людям, о политике и всем остальном будем думать потом.&nbsp;</p>","createdon": 1302552000,"editedon": 1302552000,"deletedon": 0,"publishedon": 1302552000,"menutitle": "","uri": "blog/closet/moi-soboleznovanija-semjam-pogibshih-v-minske/"}, {"id": 34,"pagetitle": "CSS Naked Day","longtitle": "css, naked day, html, 9, april, апрель, 9 апреля, без css","description": "","alias": "css-naked-day","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": "",



"content": "<p>9 апреля во всем мире проводится день без CSS -&nbsp;CSS Naked Day. Web-мастера отключают на своих сайтах весь css и показывают свой сайт голым, т.е. только верстка в html, без какого-либо оформления.&nbsp;</p>

<p>Скажете, зачем? Особо то может и не зачем, но я вижу в этом большую пользу. Грамотно сверстанный html будет смотреть одинаково хорошо как и с css так и без. Мне скрывать нечего и стыдиться тоже, потому мой сайт сегодня голый. Присоединяйтесь!</p>","createdon": 1302339559,"editedon": 1302339559,"deletedon": 0,"publishedon": 1302339559,"menutitle": "","uri": "blog/closet/css-naked-day/"}, {"id": 35,"pagetitle": "Изменения грядут!","longtitle": "mercurial, subversion, blog, site, news, bitbucket, новости","description": "","alias": "izmenenija-grjadut","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Несмотря на громкий заголовок, заметка будет короткой. В связи с тем, что я все больше увлекаюсь системой контроля версий под название Mercurial, я планирую перенести раздел сайта Проекты на bitbucket.org. Если получится договориться с тех-поддержкой хостинга о том, чтобы мне сменили CNAME для поддомена, то будет вообще шикарно. Пока же мои открытые проекты можно увидеть по адресу <a href=\"http://bitbucket.org/alroniks \" title=\"\">http://bitbucket.org/alroniks</a>. На этом, пожалуй, все. </p>","createdon": 1299445200,"editedon": 1299445200,"deletedon": 0,"publishedon": 1299445200,"menutitle": "","uri": "blog/closet/izmenenija-grjadut/"}, {"id": 36,"pagetitle": "О событиях, планах","longtitle": "Новый год, планы, события, блог","description": "","alias": "o-sobytijah-planah","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Не буду в посте влезать в политику, так уже многое сказано и показано. Я не остался равнодушен, но не то настроение сейчас, чтобы писать об этом в блог.</p><p>Тема данного поста немного другая. События в заголовке упомянуты неспроста. Я извиняюсь за редкие записи в блоге, но на то он и дневник, чтобы писать сюда когда есть время и желание. Так вот, если желание порой есть, то времени к сожалению, нет. У меня сейчас сессия в самом разгаре, что и объясняет мое редкое появление даже на собственном сайте. Так что извиняйте.</p><p>А теперь о планах. Планов накопилось множество, но до нового года остались считанные дни и глупо рассчитывать осуществить задуманное до этой даты, жалуясь на нехватку времени выше. Так что радовать реализацией планов буду уже в следующем году.</p><p>А в планах есть пару интересных идей. Для начала немного изменить дизайн сайта. В целом мне нравится такой, какой он есть сейчас, но с точки зрения юзабилити&nbsp; - это кошмар. Сам бы я наверное ушел бы с такого сайта. Потому будут изменения в дизайне, но не пугайтесь, концепция останется прежней. Ну и второе - допилить функционал системы управления всем этим хозяйством до того уровня, который давно планировался. Ну и самое первое из списка, что я сделаю, это прикручу уведомления об ответах и новых комментариях к постам. Ну и все таки сяду и допишу свой антиспам-движок, чтобы не приходилось ждать моей постмодерации. <br /></p><p>Но все это будет уже в следующем году, когда появится чуть больше свободного времени. А сейчас поздравляю вас всех с праздниками, с Новым годом, с Рождеством, которое прошло и с Рождеством, которое будет еще. Веселитесь, отдыхайте, радуйте близких и не болейте!<br /></p>","createdon": 1293411359,"editedon": 1293411359,"deletedon": 0,"publishedon": 1293411359,"menutitle": "","uri": "blog/closet/o-sobytijah-planah/"}, {"id": 37,"pagetitle": "MODx. Долгожданный релиз 2.0.5","longtitle": "cms, modx, revolution, php, mysql","description": "","alias": "modx-dolgozhdannyj-reliz-205","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Всего два месяца прошло с момента прошлого релиза, но этот ждали все с нетерпением. Еще бы - одних только исправлений и улучшений оказалось <b>175</b> штук. Команда не подвела и выпустила новую версию в срок. </p>

<cut>

Новое в версии:
<ul class=\"list\">
	<li>Исправлено и внесено улучшений - 175 штук.</li>
	<li>Улучшена катомизация форм</li>
	<li>Новые политики управления доступом для шаблонов</li>
	<li>Более стабильный код для работы с контекстами и файловым менеджером.</li>
	<li>Множество улучшений и исправлений в xPDO</li>
	<li>Множество улучшений в интерфейсе, например, дерева русоурсов. Больше опций для phpthumb, улучшенный drag&amp;drop и другие.</li>
	<li>Исправлены проблемы при работе с APC, WinCache, eAccelerator и другими системами кеширования.</li>
	<li>Усилена защита от XSS, добавлены дополнительные проверки передаваемых данных.</li>
	<li>Исправлены проблемы с radio и resourcelist в переменных шаблона, исправлены другие конфликты с TV.</li>
</ul>


<p>Как обновить до версии 2.0.5 можно почитать <a href=\"http://rtfm.modx.com/display/revolution20/Upgrading+to+Revolution+2.0.5\">здесь</a>.</p>




<p>Скачать: <a href=\"http://modxcms.com/download/#pl\">Revolution 2.0.5-pl2</a></p>




<p>Документация: <a href=\"http://modxcms.com/learn/documentation.html\">Revolution Documentation</a></p>




<p>Команда разработки просит отправлять информацию о багах <a href=\"http://bugs.modx.com/\">сюда</a>.</p>




<p><meta http-equiv=\"content-type\" content=\"text/html; charset=utf-8\"><a href=\"http://modxcms.com/forums/index.php/topic,58256.msg332568.html#msg332568\" title=\"\">Можно ознакомиться</a> с полным списком улучшений и исправлений.</p>

</cut>","createdon": 1291842000,"editedon": 1291842000,"deletedon": 0,"publishedon": 1291842000,"menutitle": "","uri": "blog/closet/modx-dolgozhdannyj-reliz-205/"}, {"id": 38,"pagetitle": "Выборы 19 декабря. Ни днем раньше!","longtitle": "выборы, 19 декабря, президент, Беларусь","description": "","alias": "vybory-19-dekabrja-ni-dnem-ranshe","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Интересная какая идея пришла сегодня, когда я находился в универе.&nbsp;</p>

<p>Всем обычно раздают напечатанные приглашения на выборы. Это такие бумажки красно-зеленого цвета с одной стороны и с текстом на другой стороне. Ничего необычного. Но важнее то, что там написанно.</p>

<p><img src=\"http://klimchuk.com/upload/elect.jpg\"></p><cut>

<p>А написано, что выборы 19 декабря, а не 13 или 15. Именно 19 декабря и написано куда придти голосовать. Я к чему это. Считать это официальным документом нельзя, так как я таких сам могу вагон напечатать, но как аргумент, я думаю, в споре можно использовать.</p>

<p>Например, вас заставляют проголосовать досрочно, а вы не хотите, но вам угрожают или принуждают любым другим способом. Способов, как этого избежать, в сети уже довольно много. Я предлагаю еще один довольно простой и невинный.</p>

<p>У вас есть приглашение, где написано, что выборы 19 декабря. Вас заставляют - показываете приглашение и говорите, что тут написано 19 декабря. Дальше можно сослаться на любые причины, почему вы верите написанному, а не тому, что вам кто-то говорит.&nbsp;</p>

<p>Способо не оригинальный, но в запасе пускай будет на всякий случай. И ни в коем случае не голосуйте досрочно! Рассказывать, что происходит при досрочном голосовании я не стану, сами не глупые и все понимаете :)</p></cut>","createdon": 1291323600,"editedon": 1291323600,"deletedon": 0,"publishedon": 1291323600,"menutitle": "","uri": "blog/closet/vybory-19-dekabrja-ni-dnem-ranshe/"}, {"id": 39,"pagetitle": "Ubuntu и Asus EEE PC - настраиваем подсветку экрана","longtitle": "acpi, ubuntu, подсветка, asus, eee pc","description": "","alias": "ubuntu-i-asus-eee-pc-nastraivaem-podstvetku-jekrana","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Стояла раньше у меня на нетбуке Ubuntu Netbook Edition. И параллельно ей жила там мной не любимая Windows. Жила, потому что нужно было делать задания по учебе в университете, иначе никак. Но вот учебы нет, для диплома все есть и в линуксах, и решил я навести порядок на нетбуке. Почистить зверинец вирусов, вообще все почистить, чем и занялся сегодня вечером. В целом расписывать что и как было не стану. Запишу лишь себе одно напоминание, которое возможно понадобится еще кому-нибудь. </p>

<p>В свое время долго мучался я с нерабочей подстветкой в своей машинке. Т.е. плохо работала кнопка \"fn\". Нажимал, а оно подстветку рандомно меняло при каждом нажатии, хотя апплет правильно показывал положение ползунка. Я нашел решение когда-то и забыл про него. При установке повезло вспомнить о том, что проблемы были и я решил записать это решение, чтобы в случае чего потом знать, где искать.</p>

<p>А делается все просто (по крайней мере для моего аппарата).</p>

<p>Для начала открываем любимую консоль и пишем:</p>

<code>sudo nano /etc/default/grub</code>

<p>Там находим строчку вида GRUB_CMDLINE_LINUX_DEFAULT=\"тут какие-то параметры могут быть\"</p>

<p>И дописываем туда свои параметры. У меня в итоге получилось следующее:</p>

<code>GRUB_CMDLINE_LINUX_DEFAULT=\"quiet splash acpi_osi=Linux acpi_backlight=vendor\"</code>

<p>Нажимаем Ctrl+O, затем Ctrl+X и выполняем обновление конфигурации grub:</p>

<code>sudo update-grub</code>

<p>И перезагружаемся. Теперь проблем быть не должно. Если проблемы есть, ну тогда поздравляю вас с новым диагнозом - красноглазие ;)</p>

<p><br /></p>","createdon": 1299099600,"editedon": 1299099600,"deletedon": 0,"publishedon": 1299099600,"menutitle": "","uri": "blog/closet/ubuntu-i-asus-eee-pc-nastraivaem-podstvetku-jekrana/"}, {"id": 40,"pagetitle": "Ruby, Python & more Meetup","longtitle": "meetupby, RPMM, Минск, конференции","description": "","alias": "ruby-python-and-more-meetup","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>«В споре рождается истина». В ходе <a href=\"http://di.by/2010/3331/\">дискуссии «Ruby vs Python»</a> во время конференции Деловой интернет участники сошлись во мнении, что на мероприятиях <strong>нужно не просто говорить о технологиях, но и работать с ними</strong>.
 Например, такие языки как Ruby и Python постоянно развиваются и 
совершенствуются именно благодаря сообществу энтузиастов - тех, кому 
интересен результат, совершенствование инструментов и саморазвитие. Эти 
сообщества не ставят перед собой коммерческих целей, но открыты для 
новых участников. Здесь обучают новому, обмениваются опытом, развивают 
существующие инструменты, создают и совершенствуют новые полезные 
проекты.</p><cut>

<p><img alt=\"\" src=\"http://meetup.by/sites/default/files/5000045252_4d8f8b1e30_z.jpg\" style=\"width: 500px;\"></p>

<p>В таком формате не только новички приобретают знания и опыт. 
Профессионалы тоже развивают собственные умения и навыки: в обучении 
других, в проведении докладов и мастер-классов, самосовершенствуясь от 
встречи к встрече.</p>

<p>Мы надеемся, что подобные мероприятия будут стимулировать развитие 
IT-коммьюнити в Беларуси, способствовать появлению и развитию 
высококлассных специалистов и спикеров.</p>

<p>Темой нового митапа стало продолжение и развитие дискуссии о Ruby и 
Python, начатой в рамках IDeaCamp на Деловом Интернете (Devcamp), однако
 уже не в стихийном формате, а с продуманной программой, 
профессиональными спикерами, планом работ и новыми идеями. Затронуты на 
митапе будут и другие родственные темы.</p>

<p>В распоряжение участников будут предоставлены помещение в формате Open 
Space, где можно передвигать столы и стулья в желаемое положение, 
проектор и экран, розетки и кофе-паузы. А весь ивент будет снят на видео
 для того, чтобы максимально возможное количество людей смогло в любое 
удобное время ознакомиться с контентом мероприятия, а спикеры смогли 
провести ретроспективу своего доклада.
</p><p>
</p><p>Кроме <a href=\"http://meetup.by/partners\">постоянных инфопартнеров</a> партнерами Ruby, Python &amp; more митапа уже стали датская компания <a href=\"http://ciklum-minsk.blogspot.com/\">Ciklum</a>, информационный портал <a href=\"http://it-job.by/\">it-job.by</a>, а также проект <a href=\"http://sef.by/\">SEF.BY</a>.</p><p><br /></p>

<p>
	<strong>Встреча запланирована</strong> на 4 декабря. Начало в 11:00 - 6 этаж 4-го корпуса БГУИР (ул. Гикало, 9 - <a href=\"http://maps.interfax.by/minsk/gis/25284\">см. карту</a>).</p><p><br /></p>

<p>
	<strong>Участие в мероприятии - свободное</strong>. Необходимо только зарегистрироваться, заполнив онлайн-форму: <a href=\"http://bit.ly/rpmmeetup\">http://bit.ly/rpmmeetup&nbsp;</a></p></cut>","createdon": 1290373200,"editedon": 1290373200,"deletedon": 0,"publishedon": 1290373200,"menutitle": "","uri": "blog/closet/ruby-python-and-more-meetup/"}, {"id": 41,"pagetitle": "Над всей Испанией безоблачное небо","longtitle": "небо, Испания, кодовая фраза, выборы, Беларусь","description": "","alias": "nad-vsej-ispaniej-bezoblachnoe-nebo","published": 0,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



    "content": "<blockquote><p>Вошедшая в историю Европы кодовая фраза, переданная 18 июля 1936 г. радиостанцией г. Сеута (в те годы испанское Марокко) и послужившая сигналом к началу государственного переворота в Испании. Возглавил заговор против законного республиканского правительства генерал испанской армии Франсиско Франко. 23 июля 1936 г. в г. Бургосе он сформировал правительство из своих приверженцев, и это стало фактическим началом гражданской войны в Испании.
</p><p>
Война закончилась в марте 1939т. победой мятежников-франкистов, поддержанных нацистской Германией и фашистской Италией, и установлением диктатуры генерала Франко. На параде в честь своей победы, вскинув руку в фашистском приветствии, он заявил: «Мы навсегда покончили в Испании с идеями энциклопедистов».
</p><p>
Период диктатуры официально закончился в 1978 г., когда в Испании демократическим путем была принята новая конституция, в которой страна провозглашалась республикой при действующем монархе-гаранте конституции.
</p><p>
Цитируется как фраза-символ условного сигнала, дающего старт какому-либо процессу или акции.</p>
</blockquote>

<p>Возможно, 19 декабря 2010 года станет исторической датой.</p>","createdon": 1288731600,"editedon": 1288731600,"deletedon": 0,"publishedon": 1288731600,"menutitle": "","uri": "blog/closet/nad-vsej-ispaniej-bezoblachnoe-nebo/"}, {"id": 42,"pagetitle": "Версия сайта для нетбуков","longtitle": "netbook, mobile, браузеры, телефоны, смартфоны, opera mobile, сайты","description": "","alias": "versija-sajta-dlja-netbukov","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Вот ведь какое дело, появились давным-давно первые сайты. Неказистые, ужасные, не всегда красивые. На то были причины: не было html5 и css3, опыта было не так много у разработчков, браузеры не все могли. Сейчас ситуация поменялась в лучшую сторону и намного в лучшую. Но я не об этом. Дело в том, что раньше сайты смотрели только на мониторах и ни где больше, а вот теперь появились мобильники и другие устройства. Далее об этом и пойдет речь.</p>

<cut>

<h2>Мобильники и смартфоны</h2>


<p>Появились новые устройства с экранами - это еще ничего. Но как только стало возможным выходить с телефона в сеть, аккулы от бизнеса сразу увидели в этом выгоду и начали это дело под себя подминать. Они не прогадали. Сейчас мобильный телефон есть у каждого и аудитория очень большая для того, чтобы прилично заработать. Чего стоят только игры за 1$, которые за день раскупают по миллиону штук. Посчитайте сами, сколько так можно заработать за пару дней ;).</p>



<p>Вернемся к технической части. Сайты были написаны для нормальных мониторов, а не мелких дисплеев в телефонах. Масштабы не те ведь :). А показывать что-то нужно. Так родились мобильные версии сайтов. Сказать, что это плохо - нельзя, так как универсальность - не панацея. Нужно учитывать реальность и я, как владелец телефона, замечу, что пользоваться мобильной версией с мобильника куда удобнее, чем обычным сайтом с того же аппарата. Не помогает даже крутая Opera Mobile на смартфоне -все равно не удобно.&nbsp;</p>




<h2>m и точка</h2>


<p>Так вот, стали появляться на сайтах ссылки на мобильные версии (или как на некотрых ресурсах еще их называют - PDA-версии). Сделать такую версию не сложно, если делать сайт качественно изначально. Я не расписывал подробно в предыдущем посте, как я сделал мобильную версию своего сайта, поэтому расскажу немного здесь.&nbsp;
</p>

<p>Оказалось, мобильную версию сделать довольно просто. Изначально продуманная и четкая структура сайта, оформление вынесено в отдельный CSS-файл... и это по-сути все! Сайт читаем даже без CSS благодаря четкой структуре и правильной верстке. И, чтобы нам правильно настроить оформление сайта, достаточно немного поработать с CSS. Именно так я и сделал и многие так делают. Это логично, так как это самый простой путь: легко менять, благодаря хорошей архитектуре сайта и правильному коду - легко поддерживать. Но это мобильники.</p>




<h2>Новые устройства и новые требования</h2>


<p>Казалось бы, есть сайт основной, а есть сайт для телефонов - и можно жить спокойно. Я так тоже думал, пока не стал пользователем нетбука. Сейчас поясню почему.</p>



<p>Если раньше мониторы не могли особо похвастаться параметрами, то сейчас один круче другого. И диагонали широкие и разрешения зашкаливают. Согласен, работать за широким монитором одно удовольствие и места больше в таком случае и сайт красивше смотрится. Одни плюсы. Но стоит зайти на сайт, сделанный для такого монитора с нетбука, как им становится невозможным пользоваться. Нетбуки пока не такие крутые и разрешение у них в лучшем случае стандартные 1024px, а ведь есть и меньше.</p>



<p>На основе этих рассуждений у меня появилась идея: а почему нельзя сделать версию сайта, оптимизированную для нетбуков? Сделать это, как и в случае с мобильной версией, не так уж и сложно, а вот отдача будет ощутимой. Если владельцы ресурса заботятся о своих пользователях, это вызывает доверие и как следствие признание качества. А это уже и успех и реклама среди друзей, что куда качественнее случайных пользователей из поисковика.</p>




<h2>Точка после n</h2>


<p>В итоге, я предлагаю владельцам сайтов и просто разработчикам не забывать о владельцах нетбуков и потратить свое время на создание версий сайта для нетбуков. Если мобильные версии у нас <b>m.klimchuk.com</b> - от слова <i>mobile</i>, то почему нельзя сделать версию сайта <b>n.klimchuk.com</b> - от слова <i>netbook</i>. К тому же, при должном подходе возможностей открывается много, так как при ориентации на пользователя и его потребности мы получаем больший обратный фидбек, вследствие чего и прибыль от него :)</p>



<p>Удачных проектов вам, коллеги!</p>","createdon": 1287691200,"editedon": 1287691200,"deletedon": 0,"publishedon": 1287691200,"menutitle": "","uri": "blog/closet/versija-sajta-dlja-netbukov/"}, {"id": 43,"pagetitle": "Добро и зло. Что это?","longtitle": "добро, зло, другой, человек, жизнь, относительность","description": "","alias": "dobro-i-zlo-chto-jeto","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Вот казалось бы, извечный вопрос о добре и зле. Что такое добро? А что такое зло? А почему зло плохое, а добро хорошее? А вон тот мужик вообще по другому думает. Вот у него забрали права - значит гаишник злой, потому что лишит прав и теперь он ездить не может, а он этим семью кормил. Злой гаишник? Злой! А вот мужик скорость превысил. А ведь мог на такой скорости не заметить и сбить человека. Был бы еще злее гаишника. Да и так уже злой. Разве не так? Конечно так. Только теперь гаишник добрый - наказал злого, но лишил семью хлеба - все равно злой. Так что такое добро и зло?&nbsp;</p>
<p>Понятия относительные скажете вы. Ну да, в чем ты вы правы. Только относительно чего это добро и зло? Вот в средние века сжигали ведьм. Во имя добра, разумеется, но творили то зло - людей убивали. Или крестовые походы. Во имя добра воевали, но людей сколько убили. Ну так неверных же убили. А они не люди? Тогда думали, что нет. А творили зло относительно жизни человека.&nbsp;</p>
<p>Вообще идея того, что добро и зло понятия относительные, конечно, верна, только нужно учитывать некоторые моменты. А именно, что добро и зло для каждого свои. Как в примере с гаишником. Правда у каждого своя. Это верно. Только вот добро и зло сюда плохо подходит. А что, если добро - это то, что нам нравится, что нам подходит, а зло - это что-то другое, что нам не нравится и мы считаем его злом. Только ведь это уже не зло по определению. Это просто что-то другое, но не подходящее нам. Так почему оно должно называться злом для всех, если оно только для нас зло. Мы или вы последняя инстанция? Вам бы хотелось бы в это верить или даже хотелось бы, чтобы так и было, но это не так. Вы не последняя инстанция, а значит и не вам решать, что такое зло и добро. Для себя - пожалуйста, за других - не смейте. Ну или иначе вы будете творить зло. А кому нравится, когда его чего-то лишают или указывают что-то делать.</p>
<p>Конечно, убивать плохо. Для меня плохо, для вас плохо, для сотен других людей плохо, а для маньяка хорошо. Он виноват. Но! Он нарушил закон, а ведь с собой он как раз в ладах. У него даже идеи есть. Я маньяка оправдываю? А как вы будете оправдывать себя, подсиживая коллегу по работе, чтобы занять его место, обманывая кондуктора, показывая пробитый уже несколько раз билет, радуясь, когда вам случайно на рынке дали лишней сдачи. Вы честны перед собой? Вы сделали добро? По вашему вы правы, по моему нет.&nbsp;</p>
<p>Все начинается с человека, с малого человека. Пока каждый из нас не осознает, что он делает не так, что он делает плохо, а что делает хорошо, порядка в мире не будет. Слова могу показаться пафосными, но во всех бедах виноват человек и только человек. И не нужно винить Бога или кого-либо еще - виноваты вы сами. И вы творите добро и зло как для других, так и для себя. Сначала познайте себя, потом судите других.</p>","createdon": 1311969600,"editedon": 1311969600,"deletedon": 0,"publishedon": 1311969600,"menutitle": "","uri": "blog/closet/dobro-i-zlo-chto-jeto/"}, {"id": 44,"pagetitle": "Мобильная версия сайта","longtitle": "Opera Mobile, сайт, разработка, мобильная версия, интерфейсы, верстка","description": "","alias": "mobilnaja-versija-sajta","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Посидев пару часиков сегодня вечерком, почитав подборку литературы, посмотрев примеры, сделал себе нормальную мобильную версию сайта. Opera Mobile умеет отображать любой сайт, но хотелось именно той простоты и удобства, которая есть в мобильных версиях других сайтов. Сделал нечто подобное.</p><p>В мобильной версии где-то могут быть недочеты или мелкие баги, все таки делал ее буквально за пару часов. Поэтому, если встретиться что-нибудь \"интересное\", дайте мне знать через&nbsp;<a href=\"/fb\" title=\"\">форму обратной связи</a>. Заранее благодарен.</p><p>Чтобы пользоваться мобильной версией сайта, достаточно указать в качестве адреса поддомен \"m\": &nbsp;<span class=\"Apple-style-span\" style=\"line-height: normal; \"><a href=\"http://m.klimchuk.com\" title=\"\">http://m.klimchuk.com</a></span><span class=\"Apple-style-span\" style=\"line-height: normal; \">.</span></p>","createdon": 1284331614,"editedon": 1284331614,"deletedon": 0,"publishedon": 1284331614,"menutitle": "","uri": "blog/closet/mobilnaja-versija-sajta/"}, {"id": 45,"pagetitle": "Прыжок с моста. Радиаторный","longtitle": "радиаторный, мост, Минск, прыжки, ropejumping, роуп","description": "","alias": "pryzhok-s-mosta-radiatornyj","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Совсем недавно я переборол еще один природный страх - страх перед высотой. Хотя для меня страха как такового и не было, но человек всегда боится высоты, так как действует инстинкт самосохранения. Упасть с высоты - значит гарантированно разбиться, зачастую насмерть, поэтому организм и мозг пытаются таким образом нас защитить.</p>

<p>Я же решил свой страх перебороть и вопреки установкам и инстинктам все же прыгнул с моста. Нет, я не дурак просто взять и прыгнуть с моста :) Я прыгнул, страхуемый веревками. Пока, как видите, жив здоров.</p>

<p>Особо рассказывать о своем геройском подвиге я не буду. Я не \"Славик\", прыгнул тихо и скучновато, но как есть.</p>

<cut>


<h2>Видео прыжка</h2><div>К слову, прыгал я 08.09.2010.&nbsp;</div>
<div class=\"redactor_video_box\"><object width=\"540\" height=\"430\"><param name=\"movie\" value=\"http://www.youtube.com/v/arLcOyWeZ0c?fs=1&amp;hl=en_US&amp;color1=0x006699&amp;color2=0x54abd6\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/arLcOyWeZ0c?fs=1&amp;hl=en_US&amp;color1=0x006699&amp;color2=0x54abd6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"540\" height=\"430\"></object></div>

<h2>Ощущения</h2>
<p>Что касается ощущений, которые я пережил во время прыжка? Если честно, не помню. В самом начале было тяжело решиться отпустить перила и улететь вниз. Я понимал, что меня страхуют, что я обвязан, что карабин застегнут, но все же не мог.&nbsp;</p>

<p>Я думал, будет сложнее прыгнуть, по крайней мере так казалось, когда я на прошлых прыжках участвовал только в качестве наблюдателя. Оказалось все проще. Первая попытка отпустить перила не увенчалась успехом. Я только слегка присел, но не полетел. А вот со второй попытки.... Я не \"собирался\" и не \"разбирался\", я просто отключил мозг, как советовали бывалые. В итоге получилось и я полетел.&nbsp;</p>


<h2>Полет</h2>
<p>Полет занимает мало времени, хотя стоя на мосту кажется, что летит \"прыгун\" долго. Видимо все таки стресс берет свое. Куда интереснее, когда на троллее тебя тормозит траховочный тросс и ты по инерции подлетаешь и потом болтаешься во все стороны. Весело, когда рядом с тобой дерево и ты летишь, болтаясь, на него. Стресс проходит и уже становиться интересно.</p>

<p>Извиняюсь за легкую сумбурность. С момента прыжка прошло уже несколько дней, эмоции притупились, часть эмоций была поглощена болезнью. Прыгнуть я хочу еще не один раз, так что думаю в следующий раз рассказ получиться куда веселее и интереснее.</p>

<p>P.S.: Если есть желание прыгнуть, то в &nbsp;Минске регулярно проводятся прыжки с моста и не только. Можно найти компанию в контакте, можно спросить у &nbsp;меня. Если я не могу пойти, то я могу подсказать вам, как добраться до мест проведения прыжков или связать вас с нужными людьми. Обращайтесь.</p>

</cut>","createdon": 1284235200,"editedon": 0,"deletedon": 0,"publishedon": 1284304240,"menutitle": "","uri": "blog/closet/pryzhok-s-mosta-radiatornyj/"}, {"id": 46,"pagetitle": "Перестал работать Вконтакте","longtitle": "вконтакте, социальные сети, epic fail, не работает, Беларусь","description": "","alias": "perestal-rabotat-vkontakte","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Вот уже 2 день не работает социальная сеть \"Вконтакте\". Учитывая то, что я живу в Беларуси, как и многие, сразу начали грешить на известный скандальный указ №60. Но со временем ситуация проясняется и паниковать не стоит.</p>

<p>Исходя из новых данных, нету \"контакта\" в Беларуси и в некоторых регионах России. Что по сути отметает доводы о том, что это проделки ОАЦ.&nbsp;</p>

<p>Через анонимайзеры, прокси-сервера, серви Opera Turbo все прекрасно работает. Так что видимо проблемы на пути к серверам. Судя по данным трассировки путей зависание происходит на IP 95.167.77.98.</p>

<p>Говорят, виноват Ростелеком. Обещают скоро все исправить.</p>

<p>Некоторые сайты в Беларуси так же недоступны, но открываются через анонимайзеры. Их возможно и фильтруют, но есть версия, что они так же находятся на иностранных серверах, к которым пропал линк аналогично \"Вконтакте\".</p>

<p>Следим за развитием событий. Вскоре все прояснится. Не паникуем. Не нужно ломиться в контакт - там все равно почти никого нет из тех, кто вам нужен. Не работает у большинства :)</p><p>UPD: Судя по сообщениям с форумов, у некоторых контакт начал работать. Видимо частично поправили. Ждем обновления DNS и новых маршрутов. Скоро должен заработать у всех.</p>","createdon": 1283630400,"editedon": 0,"deletedon": 0,"publishedon": 1283685187,"menutitle": "","uri": "blog/closet/perestal-rabotat-vkontakte/"}, {"id": 47,"pagetitle": "Время твоего поступка","longtitle": "политика, государство, поступки, смелость, время","description": "","alias": "vremja-tvoego-postupka","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p><i>Во всех странах молодёжь была в авангарде борьбы за свободу и лучшую 
жизнь. И в Беларуси большинство тех, кто выходит на акции оппозиции, - 
это молодые люди. Но сегодня хотелось бы обратиться к нашим ровесникам, 
которые наблюдают за этими самыми акциями через окно квартиры или экран 
телевизора.</i></p>
<cut><p>
Да, мы знаем, что вам не нравится то, что происходит в нашей стране. 
Знаем, что в университетских «курилках» вы обсуждаете то, что написано в
 независимых газетах. Знаем о том, как вы под школьными партами 
передаете друг другу листовки. Знаем, как хвастаетесь перед друзьями 
знакомством с «парнем из оппозиции», у которого можно попросить стикер. 
Знаем, что вы нас иногда поддерживаете. </p>



<p>
Знаем, даже то, что вы нам завидуете. Ведь только в своих мечтах и снах вы делаете то, что мы делаем в реальной жизни! </p>



<p>
Вы говорите: «Если бы я был уверен, что это поможет изменить ситуацию, я
 бы вышел на площадь». И не выходите. Только ли из-за отсутствия 
уверенности? Может из-за чего-нибудь другого? </p>



<p>
Когда чешские студенты Ян Палах и Ян Заец сожгли себя на Вацлавской 
площади Праги, протестуя против оккупации своей страны советскими 
войсками, они точно не могли «быть уверены», что именно их отчаянный 
поступок принесет свободу родине. Они просто знали, что так дальше жить 
нельзя. У них, тогдашних, было мало способов бороться за свободу, – на 
советский танк с чернильницей не попрешь. </p>



<p>
Сегодня другое время. Свобода - ближе! Не нужно выходить под танки, 
нужно просто выйти! Да, для этого тоже нужно личное мужество. А ещё 
нужна солидарность. Ведь нас на самом деле много. И будущее на самом 
деле зависит от нас! И нам решать, в какой Беларуси будем жить. </p>



<p>
Не будь трусом, которого можно заставить молчать, терпеть и становиться в
 нужную позу. И не надейся, что вот, ты окончишь школу или университет, и
 тогда станешь крутым, независимым и гордым. Так не бывает. </p>



<p>
Жизнь не прощает трусости. Не стоит надеяться, что годы несвободы 
пройдут, унижения сотрутся из памяти. Что забудется, как отсиделся, 
когда другие стояли, промолчал, когда другие сказали, спрятался, когда 
другие вышли. </p>



<p>
Чтобы совершить поступок, не обязательно долго готовиться. Хватит одной 
минуты, чтобы решить, где твое место. И когда ты решишь, то поймёшь, 
насколько смешными и убогими кажутся оправдания тех, кто так и не смог 
преодолеть свой страх.</p>

</cut>","createdon": 1283112000,"editedon": 0,"deletedon": 0,"publishedon": 1284328673,"menutitle": "","uri": "blog/closet/vremja-tvoego-postupka/"}, {"id": 48,"pagetitle": "Барановичи. По городам Беларуси.","longtitle": "Барановичи, поездки, путешествия","description": "","alias": "baranovichi-po-gorodam-belarusi","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,



"content": "<p>Просидев весь день в субботу дома и ничего толком не сделав, я пришел к выводу, что трачу время зря. Пока есть возможности и нету обязательств и семьи, нужно тратить время с пользой и решил, что нужно все таки куда-нибудь съездить. Выбор пал на город Барановичи. Почему именно этот город? Потому что я в нем был очень много раз, но только проездом, когда ездил в свой родной город. Я решил исправить ситуацию и побывать в самом городе, а не только на вокзале.</p>

<p>Сразу хочу выразить благодарность моей однокласснице Ире, которая меня встретила, показала город (хотя я сам немного успел по нему пробежаться :) и накормила. </p>

<p>Дальше будет много фоток (3.1 Мб), так что у кого трафик важен, будте осторожны.</p>

<cut>

<h2>Утро</h2>
<p>Перед поездками я&nbsp; всегда просыпаюсь рано и быстро. Видимо привычка. В этот раз я не выспался, но проснулся вовремя. Допил оствшийся с вечера кофе, собрал свой рюкзак и побрел на остановку. Поначалу желания ехать особо не было, но пересилил себя и решил не думать о том, что я буду делать там, а просто ехать.</p>

<p>На вокзал я добрался довольно быстро, все таки утро, да еще воскресенье. Дорога была пустой, автобус ехал шустро. На вокзале (а точнее на станции Институт Культуры) купил билет на электричку и вышел на перон ждать свой поезд. Случано был заскочил не в свой поезд, но вовремя спросил куда он следует и вышел :)</p>

<img src=\"http://klimchuk.com/upload/posts/baranovichi/01.jpg\">
<h2>Прибыли</h2>
<p>Ехать не долго, всего 2,5 часа. Даже чуть меньше. Правда, нужно выбирать скоростную электричку, потому есть такие, которые едут и 3,5 часа. Стоимость - 6340 белорусских рублей.</p>

<p>Выехал я из Минска в 9.08, прибыл в 11.30. На перроне было очень тихо. Меня это удивило, особенно после постоянного шума столицы.</p>

<img src=\"/upload/posts/baranovichi/02.jpg\"><p>Всем известно, что Барановичи - крупный железнодорожный узел и по сути город этим гордится. Совсем рядом с вокзалом на постаменте высится всем известный паровоз. Именно с них началось в свое время развитие железной дороги.

</p>

<img src=\"/upload/posts/baranovichi/03.jpg\"><p>А так выглядит сам вокзал со стороны города.</p>

<img src=\"../../upload/posts/baranovichi/04.jpg\">
<h2>Идем в город</h2>
<p>Я приехал на вокзал (один из двух) Барановичи-Полесские. Чтобы попасть в центральную часть города, нужно перебраться на другу сторону через многочисленные железнодорожные пути. Их там очень много. Сделать это можно, забравшись на мост, благо он рядом. </p>

<p>Пока я шел к мосту и искал пешеходный переход увидел вполне симпатичную башенку. Башенка оказалась наблюдательной башней пожарной станции. Проходя мимо, заметил, что она же и гараж для нескольких пожарных машин.</p>

<img src=\"../../upload/posts/baranovichi/05.jpg\"><img src=\"../../upload/posts/baranovichi/06.jpg\"><img src=\"../../upload/posts/baranovichi/07.jpg\"><p>Когда я начал подниматься на мост, я начал вспоминать, что тут я был когда-то. И действительно, когда я был маленький, в Барановичи мы приезжали на экскурсию. Мы отдыхали в санатории неподалеку и нас привозили в музей железнодорожной техники. К слову, он виден из поезда, если ехать со стороны Минска. Но к сожалению, в выходные музей закрыт и я смог посмотреть на технику только сверху.</p>

<p>Такая вот зенитка на рельсах стоит почти под самым постом.</p>

<img src=\"../../upload/posts/baranovichi/08.jpg\"><img src=\"../../upload/posts/baranovichi/09.jpg\"><p>А вот тут целая колона паровозов и тепловозов. Когда я был маленький тут, в один из тепловохов можно было даже залезть. По крайней мере нам тогда разрешили.</p>

<img src=\"../../upload/posts/baranovichi/10.jpg\"><img src=\"../../upload/posts/baranovichi/11.jpg\"><p>А такой вид открывается с другой стороны моста. Множество рельсовых дорожек завораживает.</p>

<img src=\"../../upload/posts/baranovichi/12.jpg\">
<h2>Ближе к центру</h2>
<p>Перебравшись через мост на другую сторону города, я пошле бродить по улицам города. Улицы как улицы, таких много в любом городе. С магазинами, небольшими деревцами. Но иногда попадались и интересные памятники. Такой вот необычный памятник с вечным огнем. Солнце было в зените, потому фото получилось не очень высокого качества, а памятник не развернешь.</p>

<img src=\"../../upload/posts/baranovichi/13.jpg\"><p>А сразу за ним я увидел такой вот обычный, серый, ничем неприглядный Дом культуры.</p>

<img src=\"../../upload/posts/baranovichi/14.jpg\"><p>Решив походить по малолюдным улочкам, набрел случайно на гимназию.</p>

<img src=\"../../upload/posts/baranovichi/16.jpg\"><p>А рядом с ней обнаружилась такая вот красота.</p>

<img src=\"../../upload/posts/baranovichi/15.jpg\"><img src=\"../../upload/posts/baranovichi/17.jpg\"><img src=\"../../upload/posts/baranovichi/18.jpg\"><p>А рядом - большой камень, на котором написано, что сквер назван в честь финского города-побратима Хейнала.</p>

<img src=\"../../upload/posts/baranovichi/19.jpg\"><p>Пройдя еще дальше увидел необычное здание. Я не религиозный человек, потому не стал выяснять суть. Кому интересно, я думаю узнают. Моя цель была просто посетить город.&nbsp;</p><p>Как выяснилось позднее, это Барановический Дворец Бракосочетаний. Спасибо Valentinych за подсказку.<br /></p><p>
</p><img src=\"../../upload/posts/baranovichi/20.jpg\"><br /><br /><img src=\"../../upload/posts/baranovichi/21.jpg\"><p>Так как я города не знал на тот момент, я решил далеко не заходить вглубь и повернул обратно, ближе к центру. Проходя мимо зеленого домика словил себя на мысли, что он либо только сверху обшит деревянными планками либо и сам деревянный. Дерево и ладно, но дом двухэтажный - это меня и заинтересовало.</p>

<img src=\"../../upload/posts/baranovichi/22.jpg\"><p>А напротив расположился банк. Вот не знаю почему, но я считаю, что такой фасад больше всего подходит банку. Внушительный и солидный и при этом красивый.</p>

<img src=\"../../upload/posts/baranovichi/23.jpg\"><p>А возле гостины (здания классического советского образца - большое и серое), которую я не стал фотогрфировать, нашел такую вот лошадку.</p>

<img src=\"../../upload/posts/baranovichi/24.jpg\"><p>А за ней ухоженную альпийскую горку и небольшой фонтанчик в виде водопадика.</p>

<img src=\"../../upload/posts/baranovichi/25.jpg\">
<h2>Двигаемся дальше</h2>
<p>Не особо представля где я, движимый только интуицией я пошел дальше гулять по городу. Видимо меня заманил своим цветом оранжевый экскаватор, так как я попал на разобранную улицу. Что меня поразило, что там кладут не привычный всем асфальт, а делают настоящую мостовую из камней. Возможно улица будет пешеходной.</p>

<img src=\"../../upload/posts/baranovichi/26.jpg\"><p>Пройдя немного дальше увидел вывеску музея. Заходить не стал, так как время было ограниченно.</p>

<img src=\"../../upload/posts/baranovichi/27.jpg\">
<h2>В другую сторону</h2>
<p>Прогулявшись по центральным улицам я попал на небольшие улочки. Осмотревшись через Google Maps где я, направился в противоположную сторону, туда, где на карте было написано - \"Новый парк\".</p>

<p>По пути увидел длинное и красивое здание, но что за оно я не понял. Возможно школа. А рядом с ним был современный дом, но построенный в интересном стиле. </p>

<img src=\"../../upload/posts/baranovichi/28.jpg\"><img src=\"../../upload/posts/baranovichi/29.jpg\"><p>До парка я все таки дошел и увидел там красивую карету. Время поджимало и я не хотел, чтобы меня ждали, поэтому не стал кататься.</p>

<img src=\"../../upload/posts/baranovichi/30.jpg\"><p>В парк я решил зайти на обратном пути и сверяясь с картой пошле искать кинотеатр. Как я позже узнал от своей спутницы, главный кинотеатр в городе. Есть еще несколько, но этот самый главный, так сказать :) Но по пути увидел строения очень знакомые. Такие я видел в одном старом районе Минска. Может просто похоже, а может и своя история у них.</p>

<img src=\"../../upload/posts/baranovichi/31.jpg\"><p>Ну а вот и сам кинотеатр.</p>

<img src=\"../../upload/posts/baranovichi/32.jpg\"><p>Напротив кинотеатра находится главный вход в парк. Удачно я выбрал маршрут.</p>

<img src=\"../../upload/posts/baranovichi/33.jpg\"><p>Местный Герой Грицевец Сергей Иванович. Именно в честь его установлен этот памятник.</p>

<img src=\"../../upload/posts/baranovichi/34.jpg\"><p>Выйдя из парка я попал опять на центральные улицы. Город гораздо больше, но как и везде - окраины - это спальные районы. Но я увидел название улицы, вернее бульвара. Это название мне до сих пор не дает покоя. Я не могу понять его смысл. Может кто подскажет?</p>

<img src=\"../../upload/posts/baranovichi/35.jpg\"><p>А вот такую замечательную бабушку я встретил в одном из дворов.</p>

<img src=\"../../upload/posts/baranovichi/36.jpg\">
<h2>Площадь, встреча, прогулка</h2>
<p>Наконец я добрался до центральной площади города. Площадь Ленина. Такие площади остались почти в каждом городе. Она классическая - с памятником. Но меня не впечатлил ее размер. Но с друго стороны я увидел здание в стиле... футуризма что ли.</p>

<img src=\"../../upload/posts/baranovichi/37.jpg\"><p>На площади я встретился с однокласницей своей. После небольших подсчетов выяснилось, что я с ней не виделся целых 8 лет. Долго рассказывать, почему так случилось. Но поговорить было о чем и фотографировал я немного меньше, а местами заговорившись, совсем забывал. Прошу меня простить за эту оплошность. Но, например, мужика, выбирающего из люка, я не мог пропустить. </p>

<img src=\"../../upload/posts/baranovichi/38.jpg\"><p>Дальше мы пошли в совсем другой район города - микрорайон Северный. Название говорит само за себя - он на севере города. Район новый и как мне показалось, больше промышленный. Забыл сфотографировать ледовый дворец, но видимо засмотрелся на танцующих пчелок... Но подходя к острову любви увидел интересную задумку. С виду обычный вагон, но давили купол и уже небольшая церквушка. Экономно и практично.</p>

<img src=\"../../upload/posts/baranovichi/39.jpg\"><img src=\"../../upload/posts/baranovichi/40.jpg\"><p>А потом мы посетили остров любви. Такие места есть во многих городах. Но некоторые вещи меня удивили :)</p>

<img src=\"../../upload/posts/baranovichi/41.jpg\"><p>Удивил пример очень крепкой семьи... и такой вот большой амбарный замок.</p>

<img src=\"../../upload/posts/baranovichi/43.jpg\"><img src=\"../../upload/posts/baranovichi/42.jpg\"><p>Недалеко от вокзала, уже возвращаясь, заметил церковь \"Адвентистов седьмого дня\". Надеюсь не ошибся с названием.</p>

<img src=\"../../upload/posts/baranovichi/44.jpg\"><p>А еще, не знаю правда что это за район, увидел такую вот полуторку.</p>

<img src=\"../../upload/posts/baranovichi/47.jpg\"><p>В целом на этом путешествие закончилось. Еще я побывал в гостях у своей одноклассницы, познакомился с ее маленьким сыночком Максимкой. Меня вкусно накормили. Через какое-то время пришлось все таки прощаться и возвращаться домой в Минск.</p>

<p>В подтверждение, что я там был, моя физиономия :)</p>

<img src=\"../../upload/posts/baranovichi/46.jpg\"><p>И огромное спасибо Ире, за то что встретила и составила компанию и показала город.</p>

<img src=\"../../upload/posts/baranovichi/45.jpg\"><p>Поездка домой была сонной и сказывалась усталость за день. Но ехал я довольный и отдохнувший от серых будней шумного Минска.</p>

<p>P.S. Фото для сайта были урезаны и ужаты, потому полные версии фото я оформил отдельным архивом. Скачать по можно по этой <a href=\"http://test.alroniks.com/baranovichi.zip\" title=\"\">ссылке</a></p></cut>","createdon": 1282507200,"editedon": 0,"deletedon": 0,"publishedon": 1282633444,"menutitle": "","uri": "blog/closet/baranovichi-po-gorodam-belarusi/"}, {"id": 50,"pagetitle": "\"Золотые слова\" Лукашенко","longtitle": "Лукашенко, цитатник, политика","description": "","alias": "zolotye-slova-lukashenko","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Иметь твердую гражданскую позицию - это не право, это обязанность гражданина страны. Хоть возможно и не хотелось бы писать о политике в блоге технической направленности, но видимо придется.  Для начала неплохая подборочка высказываний Лукашенко. С виду обычные фразы, но даже читая их, понимаешь, за кого он держит народ. За простых идиотов. Говорит почти правду и о себе и о том, что он с нами делает. Прочитайте и подумайте что не так? Главное - начните думать!</p><cut>

<blockquote>Я свое государство за цивилизованным миром не поведу.<br />
Гуманитарная помощь - это бесплатно, это для народа, в том числе для ученых, для чиновников.<br />
Возле кормушки, имя которой власть, все хрюкают одинаково: и красные, и белые.<br />
Вы мне тут на болезнь не жалуйтесь. У нас в правительстве больных много.<br />
Я на этой земле родился, я здесь и умру. Чего бы мне это ни стоило.<br />
Я работал в деревне и жил с мужиками.<br />
Я очень люблю спорт - это самое лучшее мое качество.<br />
Уникальность ситуации в Белоруссии состоит в том, что я никому ничего не обязан.<br />
Я обещаю, что к Новому году у каждого белоруса на столе будут нормальные человеческие яйца.<br />
Я с жуликами, в том числе и с Россией, акционироваться не буду.<br />
Ради сохранения спокойствия в стране я готов пожертвовать собственным разумом!<br />
Жить будете плохо, но недолго!<br />
В детстве я рос среди животных и растений.<br />
На меня, так сказать, обвалилась философская мысль! Я просто обязан сейчас быть в центре!<br />
Я буду легитимным еще долго. Я ещё не всё сделал, из-за этого власть потеряю не скоро.<br />
И дай бог справиться с родной Беларусью. Согласитесь, что достаточно 
этого куска, чтоб его проглотить. Дай бог за пять лет хоть как-то 
прожевать.<br />
Я своими руками пощупал боеголовки и знаю, что никто их снимать не будет.<br />
Только я взялся за яйца, как сразу масло пропало.<br />
Пора принять меры и наложить вето на табу!<br />
(с акцентом) Я регулярно ператрахиваю все кадры и точно знаю, кто врот, а кто не врот!<br />
Мы эту проблему решили в узком кругу ограниченных людей.<br />
Мы им окажем гуманитарную помощь (пауза) оружием.<br />
Нам такая демократия с гвалтом не надо. Нам демократия надо, когда 
человек работает, получает хоть какую-то зарплату, чтобы и хлебушка 
купить, молочка, сметаны, творожку, иногда кусочек мяса, чтобы накормить
 ребенка и так далее. Ну, с мясом уже давайте летом много есть не будем.<br />
Мы, как в 1941 году, находимся во вражеском кольце. Враги засели в 
руководстве соседнего государства, с которым мы недавно подписали 
договор о сообществе.<br />
Там, где в военных вложишь, там и отдача будет.<br />
В вечернее время, когда весь народ в автомобилях едет, слушает, должен 
транслироваться именно наш продукт, наших людей. Пугачёву мы слышим с 
каждого утюга. Я не говорю, что её там не должно быть, но 25% вполне 
достаточно!<br />
Я очень люблю играть в футбол, хоккей, но чаще играю один.<br />
Дело не в том, изберёте вы меня или нет. Где вы денетесь, изберёте! И если вас устраивает, то я буду работать.<br />
Кто пьёт, у того нормальных детей не будет. С этим злом мы будем 
сражаться, как с самым страшным злом. А то получается - напился, 
случайно родил, а ты, Лукашенко, расти этого ребёнка. И таких детей у 
нас в стране 35 тысяч...<br />
Кто пьёт - лучше за меня не голосуйте, я с такими дружить не буду.</blockquote>","createdon": 1280865600,"editedon": 0,"deletedon": 0,"publishedon": 1283195009,"menutitle": "","uri": "blog/closet/zolotye-slova-lukashenko/"}, {"id": 51,"pagetitle": "Появился favicon на сайте","longtitle": "IE, favicon, блог, иконка, инициалы, браузер, ico, Internet Explorer, зло","description": "","alias": "pojavilsja-favicon-na-sajte","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Признаком качественно сайта на данный момент является так же всем известный <i>favicon</i>. Если кто не знает - маленькая иконка в строке браузера, слева от адреса страницы. Кроме того, в различных каталогах, приложениях эти иконки учитываются и показываются. Так что рано или поздно нужно было сделать такую иконку и для своего сайта. </p>

<cut>




<h2>Идея</h2>



<p>Идея до безобразия проста. Сайт личный, да еще и с доменом фамильным, поэтому нужно было отразить это как-то в иконке, или даже почти логотипе сайта. Самое простое, что приходит на ум для личного сайта - инициалы. Именно инициалы и легли в основу задумки. Меня зовут Иван Климчук. На латиннице инициалы будут выглядеть так: <b>IK</b>. А теперь смотрим на картинку и пытаемся угадать где \"I\", a где \"K\"? :)</p>






<p><img src=\"../../upload/posts/favicon-big.png\" width=\"256px\"></p>








<h2>Установить на сайт</h2>



<p>Рассказывать, как рисовать свою иконку в Photoshop или Gimp я не стану, мы сейчас не об этом. Главное, после того, как мы создали свою иконку, уменьшить ее до разумных размеров и положить в корень сайта. Разумные размеры? Тут сложно сказать, что считать разумным. Браузерам обычно нужна картина 16х16px, но мало ли где еще иконка может использоваться. Я сделал размер 32x32px, хотя и этого может быть мало. Еще лучше всего назвать ее именно favicon.<br /></p>







<p>Дальше нужно подключить ее к странице - это делается очень просто:</p>







<pre class=\"html4strict\" style=\"font-family: monospace;\"><ol><li style=\"font-weight: normal; vertical-align: top;\"><div style=\"font: 1em/1.2em monospace; margin: 0pt; padding: 0pt; background: none repeat scroll 0% 0% transparent; vertical-align: top;\"><span style=\"color: rgb(0, 153, 0);\"><<span style=\"color: rgb(0, 0, 0); font-weight: bold;\">link</span> <span style=\"color: rgb(0, 0, 102);\">rel</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"icon\"</span> <span style=\"color: rgb(0, 0, 102);\">href</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"/favicon.png\"</span> <span style=\"color: rgb(0, 0, 102);\">type</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"image/x-icon\"</span>></span><br /></div></li><li style=\"font-weight: normal; vertical-align: top;\"><div style=\"font: 1em/1.2em monospace; margin: 0pt; padding: 0pt; background: none repeat scroll 0% 0% transparent; vertical-align: top;\"><span style=\"color: rgb(0, 153, 0);\"><<span style=\"color: rgb(0, 0, 0); font-weight: bold;\">link</span> <span style=\"color: rgb(0, 0, 102);\">rel</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"shortcut icon\"</span> <span style=\"color: rgb(0, 0, 102);\">href</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"/favicon.png\"</span> <span style=\"color: rgb(0, 0, 102);\">type</span><span style=\"color: rgb(102, 204, 102);\">=</span><span style=\"color: rgb(84, 172, 254);\">\"image/x-icon\"</span>></span><br /></div></li></ol></pre>



<h2><br /><span style=\"font-family: monospace;\"></span></h2>



<h2><span style=\"font-family: monospace;\"></span>Internet Explorer - вселенское зло</h2>



<p>Хотя на самом деле особых проблем нету с IE, но я не стал связываться с ним. Дело в том, что он требует иконку только в формате ICO. Я не люблю IE, и советую пользователям, кто им все же пользуется - скачайте нормальный браузер! И извиняюсь сразу же за то, что у вас не будет иконка отображаться.</p></cut>","createdon": 1278878400,"editedon": 0,"deletedon": 0,"publishedon": 1279110669,"menutitle": "","uri": "blog/closet/pojavilsja-favicon-na-sajte/"}, {"id": 53,"pagetitle": "Доллар слева - доллар справа","longtitle": "доллар, рубль, белорусский рубль, кризис, юмор, грусть","description": "","alias": "dollar-sleva-dollar-sprava","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p><img src=\"http://files.alroniks.com/files/alroniks/17092011523.jpg\"></p>","createdon": 1316216983,"editedon": 0,"deletedon": 0,"publishedon": 0,"menutitle": "","uri": "blog/closet/dollar-sleva-dollar-sprava/"}, {"id": 54,"pagetitle": "Рецепты приготовления MODx","longtitle": "рецепты, приготовление, modx, revolution, Иван, Климчук, Иван Климчук","description": "","alias": "recepty-prigotovlenija-modx","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Выкладываю видео своего выступления. Хоть и с опозданием большим, но для порядку нужно, чтобы оно тут было.</p>

<p><iframe src=\"http://player.vimeo.com/video/28147253?portrait=0&amp;color=59a5d1\" width=\"540\" height=\"405\" frameborder=\"0\"></iframe></p>

<p>Так же ссылка на презентацию (работает в браузере):&nbsp;<a target=\"_blank\" href=\"http://klimchuk.com/pres/rcm/\" title=\"Откроется в новом окне\">Рецепты приготовления MODx</a></p>","createdon": 1315339200,"editedon": 0,"deletedon": 0,"publishedon": 1315345357,"menutitle": "","uri": "blog/closet/recepty-prigotovlenija-modx/"}, {"id": 55,"pagetitle": "Seo-марафон (гостевой пост)","longtitle": "seo марафон, seo marafon, seo, marafon, марафон, сео","description": "","alias": "seo-marafon","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>На курсах seo специалистов компании Artox Media в самом разгаре борьба за место в топе по учебному запросу - seo марафон.</p>

<p>Хочу подержать в данной, пусть и учебной, но гонке блог <a href=\"http://seoeuronet.ru/\"><strong>seo марафон</strong></a>.</p>

<p>Успехов!</p>","createdon": 1314129600,"editedon": 0,"deletedon": 0,"publishedon": 1314131653,"menutitle": "","uri": "blog/closet/seo-marafon/"}, {"id": 56,"pagetitle": "Ляпис Трубецкой “Купляй беларускае!”","longtitle": "видео, ляпис трубецкой, премьера","description": "","alias": "ljapis-trubeckoj-kupljaj-belaruskae","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http://www.youtube.com/v/Yu08gmOYRwo&amp;hl=en_US&amp;fs=1?rel=0&amp;color1=0x006699&amp;color2=0x54abd6\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/Yu08gmOYRwo&amp;hl=en_US&amp;fs=1?rel=0&amp;color1=0x006699&amp;color2=0x54abd6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"></embed></object>","createdon": 1280182936,"editedon": 0,"deletedon": 0,"publishedon": 0,"menutitle": "","uri": "blog/closet/ljapis-trubeckoj-kupljaj-belaruskae/"}, {"id": 57,"pagetitle": "reader.jquery — читаем с удовольствием","longtitle": "jquery, safari reader, safari, apple, plugins, javascript, разработка, велосипеды, habrahabr","description": "","alias": "reader-jquery-chitaem-s-udovolstviem","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p><img src=\"http://habreffect.ru/files/6c6/d105e9ad7/image2.png\" alt=\"image\"> </p>

<p>Как мы помним, совсем недавно вышел Safari 5. Одной из интересных особенностей новой версии браузера оказался так называемый \"читальщик\" - Safari Reader. Данный модуль позволяет выделить на странице основной текст и отобразить его в удобном виде без лишних элементов сайта и рекламы. Согласитесь, довольно удобно читать, когда тебе ничего не мешает. К плюсам модуля также стоит отнести и возможность минимальной, но нужной настройки размера шрифта (скролл сайта увеличит все и не всегда хорошо). Из минусов - работает только в Safari.

</p>

<p>Решение проблемы отчасти было <a href=\"http://habrahabr.ru/blogs/browsers/95908/\">придумано</a> . Но меня не устроило то, что все плагины и расширения нужно устанавливать в браузер (кроме Safari разумеется). Я то поставлю, а вот человек постарше этого делать не станет из-за незнания или страха что-то сломать или вообще из-за лени. В связи с этим у меня возникла идея: а что если предложить ему тоже самое, но только средствами самого сайта? Что я собственно и попытался сделать.

<cut>

</p>

<p><habracut text=\"Что за зверь такой?\"><b>Reader</b> - это обычный плагин для популярной библиотеки jQuery. Особенностью плагина, как и любых других, является легкость подключения к сайту и простая настройка плагина под свои нужды. К тому же он более гибкий, нежели Safari Reader или плагины для других браузеров, так как есть возможность задавать параметры отображения. Это позволяет оформить окно \"ридера\" в стиле сайта.

</p>

<p><habracut text=\"Что за зверь такой?\">С опциями по умолчанию он выглядит почти так же, как и Safari Reader.</p>

<p><habracut text=\"Что за зверь такой?\"> <img src=\"http://habreffect.ru/files/8d9/29ddedeb4/image1.png\">
<br /></p>

<habracut text=\"Что за зверь такой?\"><br />


<h2>Важно</h2>
</habracut><p><habracut text=\"Что за зверь такой?\">

Для правильной работы содержимое страницы, которое предполагается выводить с помощью плагина, следует поместить в блочный элемент. Важным условием является наличие внутри заголовка H1, именно к нему цепляется кнопка активации режима чтения.

</habracut></p>

<p><habracut text=\"Что за зверь такой?\">Для более гибкой настройки в самом плагине в функции analysis можно указать правила для фильтрации контента. Правила задаются в виде регулярных выражений. В планах сделать фильтрацию настраиваемой с помощью опций.
 </habracut></p>

<habracut text=\"Что за зверь такой?\">
<h2>Как использовать</h2>


Думаю, рассказывать хабралюдям, как подключать скрипты к страницам не имеет смысла, но все же приведу пример.

<blockquote><ol><li><font color=\"#009900\"><<font color=\"#660066\">script</font> <font color=\"#000066\">type</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"text/javascript\"</font> <font color=\"#000066\">src</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"jquery-1.4.2.js\"</font>><<font color=\"#66cc66\">/</font><font color=\"#660066\">script</font>></font></li>
		<li><font color=\"#009900\"><<font color=\"#660066\">script</font> <font color=\"#000066\">type</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"text/javascript\"</font> <font color=\"#000066\">src</font><font color=\"#66cc66\">=</font><font color=\"#3366CC\">\"reader.jquery.js\"</font>><<font color=\"#66cc66\">/</font><font color=\"#660066\">script</font>></font></li></ol
</blockquote>



Самый простой пример инициализации плагина:

<blockquote><ol><li>$<font color=\"#009900\">(</font><font color=\"#3366CC\">\"document\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">ready</font><font color=\"#009900\">(</font><font color=\"#003366\">function</font><font color=\"#009900\">(</font><font color=\"#009900\">)</font><font color=\"#009900\">{</font></li><li> </li><li>    $<font color=\"#009900\">(</font><font color=\"#3366CC\">\"#reader\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">reader</font><font color=\"#009900\">(</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li><li> </li><li><font color=\"#009900\">}</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li></ol
</blockquote>


Инициализация с опциями:

<blockquote><ol><li>$<font color=\"#009900\">(</font><font color=\"#3366CC\">\"document\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">ready</font><font color=\"#009900\">(</font><font color=\"#003366\">function</font><font color=\"#009900\">(</font><font color=\"#009900\">)</font><font color=\"#009900\">{</font></li><li>    $<font color=\"#009900\">(</font><font color=\"#3366CC\">\"#post\"</font><font color=\"#009900\">)</font>.<font color=\"#660066\">reader</font><font color=\"#009900\">(</font><font color=\"#009900\">{</font>                </li><li>        <font color=\"#3366CC\">\"shadow\"</font> <font color=\"#339933\">:</font> <font color=\"#009900\">{</font>                    </li><li>            <font color=\"#3366CC\">\"opacity\"</font><font color=\"#339933\">:</font> <font color=\"#3366CC\">\".8\"</font></li><li>        <font color=\"#009900\">}</font><font color=\"#339933\">,</font></li><li>        <font color=\"#3366CC\">\"window\"</font> <font color=\"#339933\">:</font> <font color=\"#009900\">{</font></li><li>            <font color=\"#3366CC\">\"width\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"800px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"color\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"#000\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontFamily\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"Georgia\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontSize\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"16px\"</font></li><li>        <font color=\"#009900\">}</font><font color=\"#339933\">,</font></li><li>        <font color=\"#3366CC\">\"button\"</font> <font color=\"#339933\">:</font> <font color=\"#009900\">{</font></li><li>            <font color=\"#3366CC\">\"background\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"#54ACFE\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"color\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"#FFFFFF\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"text\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"основное\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"padding\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"0 4px 1px 4px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"margin\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"0 0 0 10px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontSize\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"12px\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontFamily\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"sans-serif\"</font><font color=\"#339933\">,</font></li><li>            <font color=\"#3366CC\">\"fontWeight\"</font> <font color=\"#339933\">:</font> <font color=\"#3366CC\">\"normal\"</font></li><li>        <font color=\"#009900\">}</font></li><li>    <font color=\"#009900\">}</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li><li><font color=\"#009900\">}</font><font color=\"#009900\">)</font><font color=\"#339933\">;</font></li></ol
</blockquote>
</habracut><p><habracut text=\"Что за зверь такой?\">

Описания параметров:</habracut></p>

<p><br /></p>

<p><habracut text=\"Что за зверь такой?\">

</habracut></p>

<habracut text=\"Что за зверь такой?\">
<h3>shadow</h3>

Набор опций задает настройки для тени. Пока доступна только одна возможная настройка для тени.
<dl><dt><b>opacity</b></dt>
<dd>
Задает степень прозрачности для фона.
</dd></dl>

</habracut>
<h3><br /></h3>
<habracut text=\"Что за зверь такой?\">
<h3>window</h3>

Набор опций задает настройки для окна, в котором отображается текст статьи.
<dl>
<dt><b>width</b></dt>
<dd>
Задает ширину окна.
</dd>

<dt><b>color</b></dt>
<dd>
Задает цвет текста внутри окна.
</dd>

<dt><b>fontFamily</b></dt>
<dd>
Указывает шрифт для отображения текста.
</dd>

<dt><b>fontSize</b></dt>
<dd>
Указывает размер шрифта по умолчанию для окна.
</dd>
</dl>

</habracut><p><br /></p>


<h3><br /></h3>
<habracut text=\"Что за зверь такой?\">
<h3>button</h3>

Набор опций задает настройки для кнопки, формируемой рядом с заголовком статьи.

<dl>
<dt><b>background</b></dt>
<dd>
Задает цвет фона кнопки.
</dd>

<dt><b>color</b></dt>
<dd>
Задает цвет текста внутри кнопки.
</dd>

<dt><b>text</b></dt>
<dd>
Указывает какой текст выводить на кнопке.
</dd>

<dt><b>padding</b></dt>
<dd>
Указывает внутренние отступы.
</dd>

<dt><b>margin</b></dt>
<dd>
Указывает внешние отступы.
</dd>

<dt><b>fontSize</b></dt>
<dd>
Указывает размер шрифта для кнопки.
</dd>

<dt><b>fontFamily</b></dt>
<dd>
Указывает семейство шрифтов для кнопки.
</dd>

<dt><b>fontWeight</b></dt>
<dd>
Задает полужирный шрифт текста на кнопке.
</dd>
</dl>



<h2>Ссылки</h2>
</habracut><p><habracut text=\"Что за зверь такой?\">
<a href=\"http://klimchuk.com/projects/reader\">Страница проекта</a>
</habracut></p>

<p><habracut text=\"Что за зверь такой?\"><a href=\"http://klimchuk.com/reader-demo.html\">Демонстрация</a>
</habracut></p>

<p><habracut text=\"Что за зверь такой?\"><a href=\"http://klimchuk.com/reader.jquery.zip\">Скачать в zip</a>

</habracut></p>

<habracut text=\"Что за зверь такой?\">
<h2>В качестве заключения</h2>
</habracut><p><habracut text=\"Что за зверь такой?\">

На чистоту и красоту кода я не претендовал, делал так, чтобы работало. Я не профи в jQuery, поэтому не ругайте сильно. Рад критике и любым предложениям по поводу реализации самого плагина.

Пользуйтесь на здоровье!

</habracut></p>

<p><habracut text=\"Что за зверь такой?\"></habracut><a href=\"http://habrahabr.ru/blogs/jquery/98387/\" title=\"Оригинал статьи на habrahabr.ru\">Оригинал статьи</a> <habracut text=\"Что за зверь такой?\"></habracut></p>","createdon": 1279137600,"editedon": 0,"deletedon": 0,"publishedon": 1279188260,"menutitle": "","uri": "blog/closet/reader-jquery-chitaem-s-udovolstviem/"}, {"id": 58,"pagetitle": "Велопрогулка по Минску","longtitle": "велик, поездки, путешествия, Минск","description": "","alias": "veloprogulka-po-minsku","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Как-то заработался и совсем забыл про свой блог. Оправдываться не буду. Потому дальше только по теме.</p>

<p>А тема такая. Кататься на велосипеде я люблю, к тому же для программиста спорт просто необходим из-за сидячего образа жизни. Вот я и решил размять мышцы и совершить мини-марафон на велосипеде. Описание поездки, впечатления и немного фото ниже.</p>

<cut>




<h2>Начало.</h2>


<p>Началось все с того, что своего велика у меня нет, пришлось брать на прокат. Радует, что в этом плане в Минске сервис немного начал развиваться. Найти прокат велосипедов не совсем просто, но и не сложно. Основные точки у всех на слуху и всегда можно узнать или через знакомых или спросить у Google.  </p>





<p>Я уже который год беру велик в одном месте - точка проката по адресу Сухая, 23. Вполне нравятся тамошние велосипеды. Не новые, но за ними следят. К тому же цена вполне приемлема. Из минусов - на выходные разбирают почти всю технику.</p>





<p>Так вот, велосипед я взял. Прокатился по центру, освоился после длительного перерыва и решил сгонять по делам к другу. Ехать пришлось в самое Уручье. Для минчан несложно представить маршрут: метро Фрунзенская - метро Уручье. Добрался я туда не сказать чтобы быстро, просто ехал не спеша и не по самому короткому маршруту, но дела уладил и решил отправиться домой поспать, поесть и готовиться к основной вылазке.</p>





<p>Домой ехал я дольше, так как от Уручья до Лошицы значительно дальше, но справился. Хотя ехать было весело, так как дороги я не знал короткой и удобной. Спас навигатор, без него я колесил бы по городу куда дольше.</p>





<p>Зато когда искал дорогу из Серебрянки в Лошицу, наткнулся на забавных уток, которые совсем не боятся людей. <br /><img src=\"http://klimchuk.com/upload/posts/velo/utki.jpg\"></p>





<p>А вот путь из поселка к самому дому был просто экстремальным. К сожалению уже смеркалось и моя камера просто отвратительно запечатлела местность, потому фото не покажу. Но мне пришлось проехать по маленькой, едва заметной тропинке, порядка 400 метров. Адреналина добавляли трава и сорняки в рост человека и еще листья растения, очень похожего на борщевик. Этот участок я проскочил очень быстро :)</p>





<p>Дальше я ужинал, читал новости и спал.</p>








<h2>День второй.</h2>


<p>Маршрут на 2 день был выбран самый простой - обновить недавно построенную велодорожку в Минске. Протяженность - 27 км. Начинается в Чижовке и заканчивается за Веснянкой, проходя через весь город. Как оказалось, 27 км мне оказалось мало, о чем я потом немного жалел.</p>





<p>Так как я живу в Лошице, то чтобы попасть на старт, мне пришлось объехать Чижовское водохранилище вокруг, так как я не рискнул опять прокатиться по тропинке среди зарослей. Смотрится красиво.<br /><img src=\"http://klimchuk.com/upload/posts/velo/chig1.jpg\"></p>

<p><br /><img src=\"http://klimchuk.com/upload/posts/velo/chig2.jpg\"></p>





<p>Собственно момент старта я не подумал сфотографировать. Все таки цель была - велопоездка, я не фотосессия. Но ближе к центру я исправился.<br /><img src=\"http://klimchuk.com/upload/posts/velo/road1.jpg\"></p>





<p>По отдельный участкам дорожки я катался и раньше, но тогда это было не так хорошо, как сейчас. Тогда местами ее просто не было. Сейчас это просто отличная трасса, с отличным покрытием. Из минусов я отметил бы только 2 моста в районе студгородка БГУ и парочку крутых поворотов на спусках.</p>








<h2>День пожарника.</h2>


<p>Трасса проходит через Детский парк имени Горького. И так получилось, что в тот день свой профессиональный праздник отмечали пожарники. Пару кадров я решил сделать для коллекции.<br /><img src=\"http://klimchuk.com/upload/posts/velo/fire1.jpg\"></p>

<p><br /><img src=\"http://klimchuk.com/upload/posts/velo/fire2.jpg\"></p>

<p><br /><img src=\"http://klimchuk.com/upload/posts/velo/fire3.jpg\"></p>








<h2>Привал.</h2>


<p>Я люблю кататься на относительно высокой скорости. Не гоняю конечно, но и не медленно езжу. Отдыхать иногда тоже нужно. Поэтому недалеко от стеллы \"Город-герой Минск\" решил устроить небольшой отдых и зафоткать велик и себя.<br /><img src=\"http://klimchuk.com/upload/posts/velo/merida.jpg\"></p>

<p><br />Я получился размытым из-за ветра. Телефон несколько раз падал и я решил не мучаться и оставить лучшее из того, что получилось.<br /><img src=\"http://klimchuk.com/upload/posts/velo/iam.jpg\"></p>








<h2>До конца.</h2>


<p>Дальше я уже не фотографировал. Начало выглядывать солнце, стало жарко, да и усталость накапливалась. Я добрался до разворотного кольца, но решил посмотреть что за ним и проехал чуть дальше. И дернул меня черт посмотреть на карту. Увидел, что вроде недалеко Минское море и мне жутко захотелось на него посмотреть, так как не видел его до этого ни разу. И я поехал. Дороги нет, дорожка уже позади. Опять спас навигатор. По проложенному маршруту я быстро добрался до места назначения. Увидел, не сильно впечатлился и решил ехать назад. А назад ехать ни много не мало, а почти 30 километров. Учитывая что я уже проехал 27 км дорожки, добавляем сюда объезд Чижовки и путь от кольцевой до Минского моря - набираются все 40. Но делать нечего - я поехал.</p>





<p>Поплутал по рынку на въезде в Минск, прокатился мимо своей работы по Тимирязева и отвез велик. Почему не рассказываю, как ехал домой? Потому что был уставший и уже смутно помню все. Последние километры давались с трудом.</p>








<h2>Домой.</h2>


<p>Велик я сдал обратно. Уставший, но довольный поездкой, отправился домой. Ноги отказывались нести, но силы еще были. Плюхнулся в автобус, доехал до дома и дальше был просто отдых.</p>





<p><b>Самому кататься мне не привыкать, но кататься компанием порой все же интереснее. Поэтому если кто-то читает эту заметку и загорелся желанием покататься на велике, но не знает как и где его взять - пишите. Я с радостью с кем-нибудь покатаюсь.</b></p>



</cut>","createdon": 1280865600,"editedon": 0,"deletedon": 0,"publishedon": 1283195076,"menutitle": "","uri": "blog/closet/veloprogulka-po-minsku/"}, {"id": 59,"pagetitle": "Дома вкусно кормят - 2","longtitle": "Лунинец, путешествия, дом","description": "","alias": "doma-vkusno-kormjat-2","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "Как и обещал, решил рассказать о втором дне поездки домой. К сожалению, время нашлось только сейчас и все в деталях уже не помню, но постараюсь вспомнить самое интересное.

<cut>



<h2>Утро</h2>

<p>Утро было самым обычным. Летом дома как всегда жарко до невыносимости, но я спал как убитый. Сказалась дорога в субботу ночью и вечер программинга на С++ и Qt. Но выспаться как следует мне не дали. Мама разбудила, аргументировав: \"Пора завтракать!\". =)</p>



<p>Хорошенько подкрепившись (не зря в названии упоминается еда), было решено съездить навестить бабушку и другую родню, так как домой я приезжаю не часто. Поехали я, брат и батя. Дорога как дорога, ничего особенного. Но мне удалось порулить. Прав у меня пока нету, потому свободно где попало рулить я не могу, но вдалеке от города ГАИ не так часто встретишь, потому там мне кататься можно. </p>





<h2>Приплыли</h2>

<p>Сюрприз нас ждал, когда мы заехали к первой бабушке. После того, как мы распрощались, а время было ограниченно, зоркий взгляд брата-автомеханика заметил поломку. Поломка вроде пустяковая, но риск угробить двигатель приличный. Слетел ремень генератора и разбился натяжной ролик для этого ремня. Время поджимало, под рукой ничего не было, но брат не последний человек в городе и уже через 5 минут на помощь летел его друг с нужной деталью. Стоит заметить, что расстояние от города - 30 км, а нам порой и 300 метров бывает лень пройти. Вот он - пример настоящей дружбы и взаимовыручки.</p>





<h2>Едем дальше</h2>

<p>Устранив поломку тронулись дальше. Так как времени стало еще меньше, решено было ехать быстро и потому меня в скорости никто не ограничивал, что мне собственно и понравилось. Быстро ездить я люблю :)&nbsp; Ко второй бабушке заскочили мы быстро, пробыли там где-то с полчаса и тронулись обратно. Мне нужно было в определенное время ехать обратно в Минск, поэтому все происходило быстро и неинтересно.</p>



<p>По приезду домой меня опять накормили, я собрал вещи и приготовился ехать обратно в столицу, учиться и работать.</p>





<h2>В качестве заключения</h2>

<p>Так вот прошел 2 день моей поездки домой. Без фото, без интересных фактов, скучно и обыденно, но без этого топика образ поездки остался бы незавершенным, тем более что я обещал вторую часть. Но это не последнее мое путешествие и не только домой, так что в скором времени можно будет прочитать о новых местах, где я был, что видел. Я обязательно поделюсь своими впечатлениями и фото.</p>

</cut>","createdon": 1277582400,"editedon": 0,"deletedon": 0,"publishedon": 1278452618,"menutitle": "","uri": "blog/closet/doma-vkusno-kormjat-2/"}, {"id": 60,"pagetitle": "Завершился круглый стол по Rails в Минске","longtitle": "ruby, rails, разработка, конференции","description": "","alias": "zavershilsja-kruglyj-stol-po-rails-v-minske","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Все таки попал я на эту конференцию, хотя злоключений по пути было, но сейчас не об этом.</p>


<h2>Начало</h2>
<p>К началу я не успел, к сожалению, и опоздал минут на 10. К тому времени, когда я зарегистрировался, уже потихоньку началось выступление. Хотя, как оказалось, выступал организатор мероприятия, а доклад начался позже. Началось все с рассказа об истории языка Ruby: кто его разработал, почему и зачем, как он развивался и откуда появились Рельсы (Rails). Было довольно интересно слушать. Так же оказалось, что многие известные проекты, такие&nbsp; как Twitter, BaseCamp и др. были разработаны с использованием языка Ruby. Для кого-то это может и не новость, но я был слегка удивлен. </p>

<cut>

<p>После небольшого экскурса в историю начали разбираться, что за зверь такой - Ruby. Как сказали докладчики, сравнивать нужно с чем-то, потому будем сравнивать с Java, которую немножко обидели. Но по заверениям тех же докладчиков, другие языки ни чем не хуже Ruby, просто он сам по себе хорош как язык и приятен. С такой позицией я согласен, каждый язык хорош в своем деле и холивары устраивать на пустом месте незачем. Видимо, это поняли и все остальные участники конференции, кроме одного бойкого и ярого питониста, но питонистам это простительно =) </p>





<h2>Ruby. Основы.</h2>

<p>Далее нам рассказали о преимуществах и особенностях языка, причем даже с примерами. К сожалению мое зрение с последних рядов не позволяло мне увидеть все, а народа было много. Организаторам пришлось приносить дополнительные стулья. Но что мне не понравилось, что слишком уж много было \"технических\" моментов озвучено, вместо того, чтобы рассказать об основных идейных принципах языка Ruby и фреймворка Rails. Видимо организаторы слегка просчитались с аудиторией, потому что знающих Ruby было всего процентов 20, а то и меньше, и в таком случае нужно было делать упор на рекламу языка и популяризацию, а не на технические аспекты. Хотя мне, как программисту со стажем, многие вещи все же были понятны.</p>



<p>Затем очень кратко и сжато было рассказано о фреймворке Rails. Штука оказалась интересной и не сильно сложной, что побудило ее в ближайшее время потрогать собственными руками. Время было ограниченно и многое пришлось лишь вскользь упомянуть, хотя о многих вещас стоило бы рассказать подробнее. Хотя докладчики и говорили, что язык и фреймворк сделаны так, чтобы ими можно было удобно пользоваться, не особо зная как это работает. Возможно это так, но профессионально разрабатывать приложения и не знать как они работают - это плохой путь. Всему виной явилась нехватка времени.</p>



<p>В целом сжато, местами скомкано, но все же было довольно интересно рассказано. Думаю, у начинающих изучать Ruby, или просто заинтересовавшихся сложилось хорошее впечатление о языке и его возможностях (я, например, подумываю заняться им серьезно). Дальше был кофе-брейк. </p>





<h2>Перерыв.</h2>

<p>Орагнизаторы поступили разумно и заготовили печеньки и кофе с чаем, так чтобы студентам или трудящимся людям было чем подкрепиться после учебы или работы. Ничего примечательного во время перерыва не было, просто передохнули немного.<br /><img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/1.jpg\"></p>





<h2>Блог за 15 (45 :) минут</h2>

<p>Дальше начался практический урок о том, как написать на Ruby on Rails блог с <strike>блекджеком и шлюхами</strike> постами и комментариями к ним. Если быть честным, то было немного скучновато, хотя звук рвущегося скотча в микрофон порадовал всех. Скучно было, потому что с задних рядов по прежнему было не очень видно что и как происходит на экране, к тому же окна сменялись достаточно быстро. Кто программировал, тот знает, что такое переключаться между окнами хоткеями и как при этом выглядит процесс со стороны. Поэтому в это время я читал твиттер и спрашивал гугл о жизни, отвлекаясь только на важные моменты и когда мне удавалось хоть что-нить разглядеть с экрана проектора.</p>



<p>В теме было заявлено, что блог можно сделать за 15 минут, вместе с комментариями мы уложились за 45 минут. Хотя я уверен, что у программиста с хорошим опытом создание такого блога действительно займет не больше 15 минут. У меня на php на простой блог уходит около часа без использования фремфорков, так что цифры вполне реальные.</p>


<img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/3.jpg\">



<h2>Круглый стол</h2>

<p>После того, как блог был написан, начался круглый стол. Часть людей ушли, кто по делам, кто еще по каким причинам, но около половины решило остаться, несмотря на позднее время. Было начало 10 вечера.</p>



<p>Во время круглого стола технические вопросы уже не рассматривались. Говорили больше об экономической составляющей разработки на Ruby on Rails и перспективах развития как языка, так и сферы применения возможностей технологии. Было затронуто множество вопросов касательно стоимости разработки на Ruby, были описаны проблемы поиска первого проекта для разработки, докладчики, выступающие теперь в роли экспертов, рассказывали о своем первом опыте в Ruby. Последний час обсуждения мне понравился больше, чем первые доклады, потому что во время обсуждения прозвучали реальные доводы в пользу разработки на RoR.</p>



<p>Правда время было ограниченно и вопросы из зала уже не успели прозвучать, в основном вопросы задавал ведущий и со стороны казалось что они играют в эдакий театр, а мы зрители. Но все прошло отлично, думаю все остались довольны.</p>


<img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/4.jpg\">
<img src=\"http://klimchuk.com/upload/posts/zavershilsja-kruglyj-stol-po-rails-v-minske/5.jpg\">



<h2>Заключение</h2>

<p>Для первой встречи такого рода мероприятие организовано толково, а накладки случаются даже у профессионалов. Думаю, следующая встреча буде куда интереснее и будет время, чтобы успеть пообщаться подольше (если орагнизуют в выходной день). Те, кто пришел на конференцию, получили нужную информацию для размышления и возможно сделают правильные выводы и примут в последствии верные решения, но это их уже дела. Орагнизаторам хочу пожелать не останавливаться на достигнутом, а продолжать работать в том же духе и проводить новые мероприятия, более интересные и запоминающиеся.</p>





<h2>PS</h2>

<p>Если верить словам докладчиков, велась аудиозапись выступлений и скоро данная запись и презенетации с конференции будут доступны в сети. Узнать можно будет <a href=\"http://belarusrubyonrails.org\">на сайте сообщества belarusrubyonrails.org</a></p>

</cut>","createdon": 1277236800,"editedon": 0,"deletedon": 0,"publishedon": 1277290361,"menutitle": "","uri": "blog/closet/zavershilsja-kruglyj-stol-po-rails-v-minske/"}, {"id": 61,"pagetitle": "Почему все считают неправильно?","longtitle": "блоги, твиттер, разработка, активность, пользователи","description": "","alias": "pochemu-vse-schitajut-nepravilno","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Вот задался я таким вопросом и сейчас объясню суть проблемы. Примером возьмем твиттер, хотя подойдет и любой другой сервис или сайт, или даже программа.</p>

<cut>

<p>Проблема заключается в алгоритме подсчета активности пользователя - т.е. сколько он чего сделал в определенный промежуток времени. Все, как правило, поступают следующим образом: берется текущая дата, дата регистрации или начала активности пользователя, считается количество дней в этом промежутке и количество действий делится на количество дней, получаем результат - столько-то пунктов в день. Это обычное среднее арифметическое и в целом оно отражает верную картину, но не совсем.</p>



<p>Рассмотрим пример. Вот завел я себе твиттер, написал первый твитт и забыл о сайте на месяц, а потом вспомнил и стал активным пользователем. Рассчитанное среднее арифметическое упорно твердит мне, что я делаю 2 твитта в день, хотя на самом деле количество иногда достигает 10 или более. Понятно, что таким образом сглаживаются острые пиковые значения, но если я действительно оставляю каждый день 5 твиттов в течении недели, а потом опять замолкаю. Получается что в данный момент показатель неверен, как неверен и потом, когда я молчу. Я же тогда не пишу ничего, но показатель не на нуле.</p>





<h2>Проблемы</h2>


<p>Ясное дело, что посчитать среднее арифметическое до безобразия просто и даже работая с базой данных, приходится выполнять не так много запросов и вообще действий в программе, чтобы получить требуемое значение. Более сложный алгоритм работал бы медленнее. Не желание правильно считать терпимо для таких гигантов, как твиттер или другие социальные сети. Но минус в том, что с популярных сервисов все копируют не особо задумываясь, как улучшить копию. Это отдельная тема, почему там происходит.</p>



<p>Еще одной проблемой можно считать то, что для реализации более сложного алгоритма требуются хорошие познания в математике, если требуется решить задачу эффективно, что собственно удорожает разработку. Но я считаю эту проблему некритической, так как тут скорее важны объемы обрабатываемых данных. Потому что для среднего арифметического нам достаточно получить время первой активности и количество записей в БД за это время, т.е. всего 2 значения из БД и получить текущее время средствами языка программирования или самой БД. Итого выходит всего 3 значения, а если разрабатывать сложный алгоритм, нам нужно знать пики активности, спады и другие параметры, что замедлит работу. В этом заключается вторая проблема - неприменимость к существующим средствам хранения данных.</p>





<h2>Решение</h2>


<p>Есть более просто решение, которое не решит задачу полностью, но будет отражать более правильную картину. На каждом сервисе можно приблизительно посчитать среднее время реакции пользователей. Не знаю как правильно это назвать, но приведу пример для сравнения: ответ на форуме приходится ждать от нескольких часов до нескольких дней, в социальной сети чуть быстрее, в сервисах мгновенного обмена сообщениями - почти сразу же. Таким образом мы можем предположить, какое время отклика пользователя у нас на сайте. Зная это время мы можем рассчитать активность более точно.</p>



<p>На твиттере данные обновляются довольно часто, но у нас в условии изначально стояла задача - получить активность за день. Самый простой способ - взять текущий день, получить количество твиттов за этот день и вот вам активность, но она не будет отражать правды. Для такого случая одного дня не достаточно, нужно немного расширить временные границы. Узнать, до какой степени расширять диапазон, можно, основываясь на показателе времени отклика. Если у нас форум, то можно считать посты за последнюю неделю, если социальная сеть, то за несколько дней, если это сервис IM - то вообще за несколько часов или минут. Идея, я думаю, ясна.</p>



<p>Такая реализация мало чем отличается от реализации с крайними границами и средним арифметическим, но возможно будет работать быстрее, так как нам не нужно узнавать дату первой активности, мы ее можем получить просто вычетом длины диапазанона из текущего времени. </p>





<h2>Итог</h2>


<p>Что в итоге? В итоге, с теми же малыми затратами на ресурсы мы получаем более точную информацию об активности пользователя. Если я 3 дня подряд писал по 10 твиттов, а потом замолк на неделю, то мой показатель активности постепенно упадет до 0 и это будет правдой, так как он будет показывать, что последние дни я ничего не пишу.</p>



<p>Если у вас возникли вопросы или есть чем поделиться, пишите в комментариях. Я с радостью пообщаюсь на эту тему.</p>","createdon": 1277496000,"editedon": 0,"deletedon": 0,"publishedon": 1278340191,"menutitle": "","uri": "blog/closet/pochemu-vse-schitajut-nepravilno/"}, {"id": 62,"pagetitle": "Дома вкусно кормят","longtitle": "дом поезд поездки путешествия Лунинец","description": "","alias": "doma-vkusno-kormjat","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>На этих выходным по просьбам родителей, да и так уже по необходимости изредка появляться домой, ездил к себе на родину, в свой родной город. Там я уже не живу 4 года (ровно столько я учусь в университете). Поездкой я остался весьма доволен, чтото успел запечатлеть на фото, когда телефон с камерой был под рукой. </p>

<cut>


<h2>Вечер пятницы</h2>


<p>С работы в начале думал отпраситься пораньше, но не получилось этого сделать. Сидел до упора. Потом проделал путь до вокзала лишь для того, чтобы убедиться, что билетов на поезд нет. Это меня огорчило и уже было пропало желание ехать домой, так как были другие важные нерешенные дела и перспектива добираться обратно в Минск непонятно на чем (а это 270 км пути) меня собственно не радовала. Но ближе к вечеру вопрос разрешился, нашлись нужные люди, телефоны и я договорился, что за умеренную плату обратно в Минск меня повезут машиной, что собственно и случилось, но об этом ниже. После непродолжительных сборов в 00.00 я отправился на вокзал, ловить электричку, так как ехать мне предстояло с пересадками. До 3 часов ночи ничего примечательного не случалось, так как включив хорошую музыку в наушниках я мило дремал в вагоне. В 3 часа ночи электричка приехала в Барановичи, где мне предстояло провести почти 2 часа в ожидании дизель-поезда до своего города. </p>




<h2>Привал</h2>


<p>Ничем не примечательный вокзал в Барановичах, за 4 года поездок абсолютно ничем не примечательный :).&nbsp; Единственная особенность, что там ночью работают все кафешки, две газетно-книжных лавки и киоск. И что меня поразило, там можно было спокойно пить пиво, прямо возле ларька, никто никого не гонял и не штрафовал. Из моих событий - там лишь была подзаправка кофе, так чтобы немного взбодриться, а все остальное время я провел в зале ожидания разгребая барахло из бекапа на нетбуке. </p>




<h2>Едем дальше</h2>


<p>Потом я сел в свой поезд, открыл нетбук и продолжил чтение книги почти до самого города. Ехал я всего 2 часа, но когда едешь целую ночь, тянуться они очень долго. Книга не дала скучать :)</p>



<p>Фотки ночью я не делал, так как качество было бы овтратительное, да и смотреть ночью нечего, а когда стало светать, я совсем забыл про то, что у меня есть камера в телефоне.</p>




<h2>Приплыли :)</h2>


<p>Приехал я на вокзал, там меня встретил брат, отвез домой на машине. Дома меня отлично накормили, так что даже спать перехотелось и я вспомнил, что камера есть, и что нада бы узнать, что дома изменилось за время моего отсутствия. А изменилось не так чтобы много, но было чему менятся. Были снегопады, были ливни и пришлось родителям и брату чинить крышу и сделали они нормальную лестницу на 2 этаж. Стыдно признаваться, но в свои 21 с хвостиком год я ни разу не был на крыше своего дома (всего 2 этажа) и решил туда залезть. Виды оттуда прекрасные, хоть и не очень высоко.</p>



<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-1.jpg\" width=\"500px\"></p>



<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-2.jpg\" width=\"500px\"></p>



<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-3.jpg\" width=\"500px\"></p>



<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-4.jpg\" width=\"500px\"></p>



<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-5.jpg\" width=\"500px\"></p>



<p><img src=\"../../upload/posts/doma-vkusno-kormjat/19-06-2010-6.jpg\" width=\"500px\"></p>


<h2>Что было дальше?</h2>

<p>А дальше был отдых. Просто отдых - обычное ничегонеделание :) Покормили, поспал, поругался на dial-up, поигрался на компутере и тут меня ждал подвох, пришлось чинить компьютер брата. Проблема - перегрев. Ребята чистили компьютер - про пасту на процессор они конечно не в курсе. К счастью нашлись добрые люди и выручили, комп я починил. Поиграть мне удалось, ближе к вечеру я еще и попрограммировать успел. Вернее мое попрограммировать растянулось часа эдак на 4, но это уже издержки профессии. </p>

<p>День закончился неожиданно быстро и было решено лечь спать, а потом начался следующий день. Приключения были и там, но об этом напишу завтра, сегодня уже нету сил :)</p>","createdon": 1277064000,"editedon": 0,"deletedon": 0,"publishedon": 1277068004,"menutitle": "","uri": "blog/closet/doma-vkusno-kormjat/"}, {"id": 63,"pagetitle": "Новый дизайн сайта","longtitle": "","description": "","alias": "novyj-dizajn-sajta","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<h2>Вместо предисловия<br /></h2>
<p>Как вы уже наверное заметили, уважаемые читатели, работа не стоит на месте. Постоянно я что-то делаю и меняю как на сайте, так и в блоге. Сайт родился недавно и это закономерно. Рубрика называется \"Новости блога\" и именно в ней я собираюсь рассказывать о новых возможностях и фичах моего сайта и блога. Я же программист и постоянно хочется что-то новое написать :)</p>

<cut>



<h2>С чего все началось?<br /></h2>

<p>Изначально я сделал сайт в серых тонах. Выглядел он красиво, все таки умение верстать никуда не пропало, но вот с цветом я прогадал. Кому не показывал сайт, все говорили что какой-то он скучноватый, серый весь, тоску навевает. И я решил исправиться. Я не знаю вашего мнения пока что, но надеюсь я его услышу в <a href=\"../../blog/kommentarii-k-blogu\" title=\"\">комментариях</a>, которые уже работают. Один мой друг высказался: \"твою мать, какой яркий!\".&nbsp; Это еще не показатель, но это говорит о том, что направление верное.</p>





<h2>Почему именно голубой?<br /></h2>

<p>Всегда моим любимым цветом был зеленый, но как показала практика его применения, использовать его нужно осторожно и с умом. А мой максимализм и желание увидеть побольше зеленого цвета мешает соблюсти правильный баланс, потому я выбрал более нейтральные, но не менее привлекательный (по статистике самый любимый цвет у людей) - небесно-голубой. Из положительных качеств цвета - он практически не раздражает, не вызывает эмоций как красный, не нагоняет тоску как черный, не вызывает отвращение как коричневый. Я конечно не беру в расчет фанатов этих цветов, у всех у нас различные пристрастия, но всем не угодишь, поэтому самый рациональный путь в данном случае - путь наименьшего сопротивления. Если кто-то против голубого цвета, выскажитесь в комментариях. Мне будет интересно выслушать ваши мнения по поводу цвета, возможно даже, проблеме цвета можно посвятить отдельную статью.</p>





<h2>Что еще планирую менять?<br /></h2>

<p>Ответ будет коротким: пока ничего. В самом деле, пока все нравится и менять ничего не хочется. Исключения составят различные мелочи и исправления недочетов. О каком-либо крупном изменении я обязательно напишу, да и вы сами заметите.</p>



<p>На этом пожалуй закончу свой рассказ. Задавайте вопросы в комментариях или в <a href=\"../../fb\" title=\"\">форму обратной связи</a> , я всегда рад пообщаться.</p>

</cut>","createdon": 1276376617,"editedon": 0,"deletedon": 0,"publishedon": 1276377222,"menutitle": "","uri": "blog/closet/novyj-dizajn-sajta/"}, {"id": 64,"pagetitle": "Лицемерие живет в каждом","longtitle": "тупые американцы, лицемерие, Беларусь, общество","description": "","alias": "licemerie-zhivet-v-kazhdom","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Помнится, все от смеха падали, когда Задорнов в своих выступлениях так протяжно говорил: «Ну американцы и тупые! Ну тупые!!».</p>

<p>И все смеялись, когда смотрели видео-ролики об американцах, которым на улице задают элементарные вопросы, на которые они не могут ответить. Мы то думали, что вот они тупые, а мы все тут академики. И только молодое поколение дебилы, которые смотрят только телик. Согласитесь, взрослые иногда позволяют себе такие высказывания в адрес молодежи. </p>

<cut>
<p>Люди бывают разные и порой я могу стерпеть такие выпады в свой адрес, потому что действительно еще молодой, неопытный, не прожил того, что прожили они. Но оказывается, лицемерие в обществе - это абсолютно нормально. Нормально так же то, что люди не разобравшись в вопросе пытаются навязать свое мнение, хотя заведомо знают, что они не правы. Но я не об этом.</p>


<p>С американцев мы плакали от смеха, а вот с видео, которые размещено ниже, нужно плакать от горя. Ибо мне стыдно за своих соотечественников. </p>


<p>
<object width=\"500\" height=\"400\"><param name=\"movie\" value=\"http://www.youtube.com/v/_0CNOliaACM?fs=1&hl=en_US&color1=0x006699&color2=0x54abd6\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/_0CNOliaACM?fs=1&hl=en_US&color1=0x006699&color2=0x54abd6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"400\"></object></p>

<p>И не говорите, что вот если бы меня спросили, то я сразу бы ответил. А вас спрашивали? А вы отвечали? Рядом с google.com каждый может считать себя умным. Так может проблема не в тупых американцах?</p>

<p>P.S. Спасибо авторам за видео. Открыли глаза.</p>","createdon": 1290286800,"editedon": 0,"deletedon": 0,"publishedon": 1311884294,"menutitle": "","uri": "blog/closet/licemerie-zhivet-v-kazhdom/"}, {"id": 65,"pagetitle": "Developing an Extras in MODx: configuring of the environment","longtitle": "modx, extra, developing, configuration, environment, настройка окружения, разработка","description": "","alias": "developing-an-extras-in-modx-configuring-of-the-environment","published": 1,"pub_date": 0,"parent": 88,"isfolder": 1,"introtext": "Some days ago I did have some free minutes and I started develop a new Extra for MODx Revolution. Results you will see later. But now I talk as about I configured my development environment for the comfortable developing and for simple assembly and deploying packages for MODx.","content": "<p><b>Hi, colleagues!</b></p>

<p>Some days ago I did have some free minutes and I started develop a new Extra for MODx Revolution. Results you will see later. But now I talk as about I configured my development environment for the comfortable developing and for simple assembly and deploying packages for MODx.</p>

<p>At first, I read article <a href=\"http://www.markhamstra.com/\" target=\"_blank\">Mark Hamstra</a>, where he wrote how we can change destination directory for assembling package. It was handy. Thanks, Mark! But I went on. Because... By this way I need every time build new packages and install it. And yet one problem - for successfull installation I need to change version for the packages. It takes a lot of time. But... I found a solution! (Maybe my solution will not interesting for MODx Team, as they create and build packages every day almost, but it will usefull for other developers).</p>

<p>My solution allow skip the stage of build and instalation of packages. We just writing code, debugging and if our code works, then we build our packages and we gives somebody it. Let\'s start!</p>


<h2>1. Environment</h2>
<p>I use Ubuntu 11.10 and this instruction is applied only for OS based on linux.</p>

<p>My instance of Revolution  was placed in directory on server:</p>

<pre><code class=\"bash\">/home/www/modx</code>
</pre>
<p>My packages placed in special folder near with Revo instance (we can put it to other place):</p>

<pre><code class=\"bash\">/home/www/pkgs/</code>
</pre>
<p>Example of pkgs folder:</p>

<pre><code class=\"bash\">root@server:/home/www/pkgs# tree -L 1
    .
    ├── modx-articles
    ├── modx-minishop
    └── modx-semanager

    3 directories, 0 files
</code>
</pre>
<p>Code of an Extra placed in folder with name as package name and this folder have this structure:</p>
<pre><code class=\"bash\">root@server:/home/www/pkgs/modx-semanager# tree -L 1
    .
    ├── assets
    ├── _build
    ├── config.core.php -&gt; /home/www/modx.by/config.core.php
    ├── core
    └── README

    3 directories, 2 files
</code></pre>
<p>In this example you see this line:</p>

<pre><code class=\"bash\">|-- config.core.php -&gt; /home/www/modx/config.core.php</code></pre>
<p>It is a symlink. What is a Symlink? <a href=\"http://en.wikipedia.org/wiki/Symbolic_link\" target=\"_blank\">Wiki</a> is describing it very details.</p>


<h2>2. Symlinks</h2>
<p>Symlinks on Ubuntu and on others Linux systems is a file, that contains path to destination. System thinks that it not a file, it is follow path and it is seeing other files, on that symlink is pointing. It is as pointer or just a simple link to other file or directory.
And this fact allow us use it for the good of us.</p>


<h3>core.config.php</h3>
<p>You see, that config.core.php is a symlink who follow my instance of modx revolution. It is nessessary for to work of the connectors and processors, because on /assets/components/modx-semanager/connector.php (on working instance of modx) contains this lines:</p>

<pre><code class=\"php\">require_once dirname(dirname(dirname(dirname(__FILE__)))).\'/config.core.php\';</code></pre>
<p>It means, that our connector.php trying get config.core.php from root path of our site on MODx. But if we have our package\'s code in other place, server will return error, because file will be not found. For exclude this situation we create symlink to original 
file config.core.php. In our case we need write the command in dir with our package:</p>

<pre><code class=\"bash\">ln -s /home/www/modx/config.core.php config.core.php</code></pre>
<p><strong>Note! You should write path to your own modx instance.</strong></p>


<h3>core and assets</h3>
<p>Our code placed in package\'s folder, but modx at the time of work will be try get code from the own packages folders as assets/components/component_name and core/components/component_name. To avoid this we need заставить modx to think, that code of packages placed in it own folders. Symlinks can help us.</p>

<p>Going on to /home/www/modx/core/components/ and make there our symlink:</p>

<pre><code class=\"bash\">ln -s /home/www/pkgs/modx-semanager/core/components/semanager semanager</code></pre>
<p>and going on to /home/www/modx/assets/components/ and make there other symlink:</p>

<pre><code class=\"bash\">ln -s /home/www/pkgs/modx-semanager/assets/components/semanager semanager</code></pre>
<p>After this manipulations modx will be think that code of components placed in it own folders, but in fact code will be placed in our special for package folder.</p>


<h2>3. What it will give?</h2>
<p>We is starting develop a new Extra in our modx folder. I am writing some code into file and I am refreshing page on back-end and it works. And if we wrote some code and it passed all test we can build packages in our directory with sources. And we can initiate git or hg repository in our folder, that will not include other source of code. </p>

<p>My name is Ivan Klimchuk. You can to ask me.</p>

<p>Sorry for my English. I am not a profi on english, but I hope I will better by time.</p>

<p>Your asks you can write to <a href=\"http://twitter.com/iklimchuk\">my twitter</a> or <a href=\"#addcomment\">via comments</a> at bottom. Thanks.</p>","createdon": 1329858000,"editedon": 1377001328,"deletedon": 0,"publishedon": 1377001260,"menutitle": "","uri": "blog/modx/developing-an-extras-in-modx-configuring-of-the-environment/"}, {"id": 66,"pagetitle": "Полезная литература. web-dev","longtitle": "","description": "","alias": "poleznaja-literatura-web-dev","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "Обзор литературы, полезной для освоения навыков программирования на php, верстки на html и css. <br /><br />Подборки книг.<br />php<br />html<br />css<br />дизайн<br />книги около тем<br /><br />формат - прочитал, не прочитал - но хочу или собираюсь. небольшие отзывы о том, что прочитал<br />","createdon": 1276027200,"editedon": 0,"deletedon": 0,"publishedon": 1279111439,"menutitle": "","uri": "blog/closet/poleznaja-literatura-web-dev/"}, {"id": 67,"pagetitle": "600-годдзе Грунвальдскай бітвы","longtitle": "Грунвальд, Беларусь, 1410, 15 ліпеня, 600-годдзе","description": "","alias": "600-goddze-grunvaldskaj-bіtvy","published": 0,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Роўна 600 год таму, 14 ліпеня 1410 года адбылася ўсім вядомая Грунвальдская бітва. Усе мы праходілі курс гісторыі ў школе і павінны памятаць. Калі хтось запамятаваў, друкую урыўкі гісторыі таго часу словамі спадара </p>

<b>narnian</b><p> (<a href=\"http://podushki.org/?p=40\" title=\"\">крыніца</a> ).</p>

<p>Я ж віншую вас, шаноўныя беларусы, з нацыянальным святам. Падзея вельмі даўняя, але ж народ помніць яе гераічнаць, помніць сваіх сапраўдных герояў, якія змагаліся у тыя часы за нашу краіну, на нашу свабоду. Са святам, Беларусь!</p>
<cut>

<img src=\"../../upload/grunvald.jpg\">
<h2>Кавалачак гісторыі</h2>
<blockquote>На працягу некалькі стагоддзяў заходнім суседам Вялікага княства Літоўскага быў Тэўтонскі рыцарска-манаскі ордэн. Але “манаскім” ён быў толькі называўся, манахi там павiнны былi не малiцца, а ваяваць — каб распаўсюджваць веру Хрыстову сярод язычнiкаў (паганцаў). У Тэўтонскiм ордэне былi не толькi немцы — туды прыязджалi для практыкi рыцары з усiх краiнаў Еўропы: былi i англiйскiя, i бургундскiя, i французскiя, нават з Пiрынейскага паўвострава. З нашага боку — беларусы, палякi, летувiсы,&nbsp; балты, чэхi на чале з Янам Жыжкам, невялiкая група татараў.<br /><br />
Як вядома, у ХIII стагоддзi, калi скончылiся ў асноўным крыжовыя паходы ў Святую зямлю, тэўтонцы знайшлi для сябе поле&nbsp; дзейнасцi — гэта Прыбалтыка, дзе былi цi не апошнiя няхрышчаныя людзi. А заадно вырашылi ахрысцiць i тых, хто быў побач, —&nbsp; праваслаўных беларусаў i каталiкоў-палякаў.Зразумела ж, што хрысціць палякаў з каталiцызму ў каталiцызм – шлупства і абсурд,&nbsp; гаворка iшла, безумоўна, пра захоп земляў. А ў нас — пра захоп i хрышчэнне ў сваю веру. Iм трэба было пашыраць сваю тэрыторыю,&nbsp; але рабiлася гэта пад рэлiгiйнай шыльдай. І менавіта Грунвальд стаў месцам, дзе адзін раз і назаўсёды трэба было высвятліць – хто і&nbsp; што будзе рабіць на гэтых землях. Настала 15 лiпеня 1410 года, і больш за 40 тысяч чалавек, расцягнуўшыся на два з паловай кіламетры, скланілі свае калені ў малітве, без гэтага нiводная бiтва не магла адбыцца. Войскi пастроiлiся — i адны, i другiя. Ягайла&nbsp; ўвесь час малiўся — паўсюль пра гэта пiшацца. Ён вельмi сумняваўся ў тым, што цi пераможа. Думаў, што калi больш памолiцца —&nbsp; дык пераможа. <br /><br />Скончылася тым, што Вялiкi Магiстр ордэна прыслаў Ягайлу два мячы, каб ён урэшце пачаў бiтву, бо колькi чакаць?! А Вiтаўт iрваўся&nbsp; ў бой. Тым больш што нашы ваяры ўжо не маглi чакаць, бо ўявiце — на лiпеньскай спякоце сядзець ва ўсiм гэтым жалезе!.. Толькi&nbsp; пасля, калi ўжо кiпеў бой, Ягайла стаў актыўна кiраваць ягонай хадой, нават паслаў у гушчар сваю прыдворную харугву… Усiм вядомы&nbsp; такi эпiзод. На правым флангу былi воiны Вялiкага Княства Лiтоўскага i Рускага, як яно тады называлася. У пэўны момант&nbsp; лёгкая коннiца “не вытрымала” нацiску нямецкiх рыцараў — i пачала адступаць. Рыцарам падалося, што яны перамагаюць. Пачаўся&nbsp; крык: “Лiтва ўцякае!” Яны натхнiлiся — i за iмi паiмчалiся iншыя, каб бiць “уцекачоў”. Гэта звычайная тактыка беларусаў!.. Тое&nbsp; самае рабiў пасля i Канстанцiн Астрожскi! Уцякалi-ўцякалi, строй ворагаў перамяшаўся, нiякага парадку ўжо не было, i тады наша&nbsp; коннiца развярнулася — i давай секчы тых тэўтонцаў… <br /><br />Бітва цягнулася доўгіх шэсць гадзiн. За гэты час былі забіты больш за восем тысяч тэўтонскіх псоў-крыжакоў, знішчана ўсё&nbsp; кіраўніцтва Ордэна, захоплены багаты абоз. Але і гэта не галоўныя вынікі бітвы. <br /><br />Па-першае, гэта перамога над вельмi сур’ёзнай&nbsp; армiяй, якая ўвесь час наносiла ўдары. Дзякуючы перамозе пад Грунвальдам&nbsp; спынiлiся набегi крыжакоў: на беларускую тэрыторыю яны ўжо не прыходзiлi. Спынiлася пагроза знiшчэння дзяржавы,&nbsp; падпарадкавання нашых народаў ордэну i анямечвання. У эканамiчным сэнсе быў вызвалены шлях да Балтыйскага мора праз Нёман i&nbsp; праз Заходнюю Дзвiну. Пасля гэтага мы пачалi вольна гандляваць з краiнамi Балтыйскага мора. Гэта справакавала аграрную рэформу, пасля якой вялiкая колькасць збожжа i лесу iшла на продаж у краiны Скандынавii i Паўночнай Германii. Быў перыяд, калi&nbsp; Беларусь была настолькi заможная, што кармiла сваiм хлебам усю Паўночную Еўропу. <br /><br />Да ўсяго ж, Грунвальдская бiтва — паказчык,&nbsp; што беларускi народ ужо ў тыя часы змагаўся за сваю незалежнасць, за сваю дзяржаву. Гэта — сведчанне вялiкага вайсковага&nbsp; майстэрства беларусаў. Напамiн, што мы — нацыя рыцараў i асiлкаў. Гэта зараз iснуе прыкры стэрэатып пра рахманых i памяркоўных&nbsp; беларусаў. Ведаеце, магiстру фон Юнгiнгену беларусы не падалiся рахманымi!..<br /></blockquote>","createdon": 1279137600,"editedon": 0,"deletedon": 0,"publishedon": 1279266475,"menutitle": "","uri": "blog/closet/600-goddze-grunvaldskaj-bіtvy/"}, {"id": 68,"pagetitle": "ToDo лист по cms","longtitle": "","description": "","alias": "todo-list-po-cms","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "1. перенести на поддомен и подбазу флинкер.<br />2. нарисовать и сверстать макет сайта. поставить новую версию системы с блогов, натянуть верстку и поднять контент. выложить старые версии систем.<br />3. сделать todo лист, сделать небольшой багтрекер на поддомене.<br /><br />4. сделать абсолютно новый скин для админки, по сути можно вообще не юзать чистые html в модулях, а написать пару хелперов для генерации определенным типов данных - списков и тд. с автоматической расстановкой полей и другой хренатени. Чтобы не писать каждый раз все копипастом. скин должен быть в серых тонах, а вот надписи можно менять от оранжевого, до голубого неона или зелени.<br /><div><br /></div><div>идеи проектов</div><div>1. phpdev.by - сообщество разработчиков Беларуси</div><div>2. Piala.by - сообщество любителей чая и все дела</div><div>3. Мобильная версия твиттера с удобными кнопками и тд. аналог гравити.</div><div>4. мобильная версия моей админки</div><div>5. мобильная версия сервиса для минска - вводишь автобус, название остановки и получаешь все расписания автоматом.</div>","createdon": 1276632000,"editedon": 0,"deletedon": 0,"publishedon": 1286896917,"menutitle": "","uri": "blog/closet/todo-list-po-cms/"}, {"id": 69,"pagetitle": "Андрей Олегович Санников","longtitle": "Андрей, Олегович, Санников, президент, кандидат, Беларусь","description": "","alias": "andrej-olegovich-sannikov","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<img src=\"http://europeanbelarus.org/photos/20100514_sannikov1_t.jpg\" style=\"width: 260px; float: left; margin-left: 10px; margin-bottom: 10px; border: 0;\"><p>Родился 8 марта 1954 года в Минске. Отец – известный белорусский искусствовед Олег Санников, мать – преподаватель русского языка Алла Санникова. Дед Константин Санников, известный белорусский режиссер, Народный артист БССР, один из основателей Национального Купаловского театра.
</p>

<p>
Санников закончил 42-ю минскую школу, в 1977 году - Минский Государственный институт иностранных языков (сегодня - Минский государственный лингвистический университет) по специальности «переводчик-референт, английский и французский языки». В Пакистане и Египте работал в нефтяной кампании и на строительстве алюминиевого завода. Работал в Обществе Дружбы с зарубежными странами в 1980-1981 годах, в 1982-1987 годах работал в Нью-Йорке в секретариате ООН.
</p>

<cut>

<p>
В 1989 году закончил дипломатическую академию Министерства иностранных дел СССР в Москве.
</p>





<p>
В 1993-1995 годах Андрей Санников работал советником представительства Республики Беларусь в Швейцарии.
</p>





<p>
В 1992-1995 году возглавлял белорусскую делегацию на переговорах по обычному и ядерному разоружению с правом подписи от имени страны.
</p>





<p>
В 1995—1996 годах Санников - заместитель министра иностранных дел Беларуси.
</p>





<p>
Имеет ранг Чрезвычайного и Полномочного Посла.
</p>





<p>
В ноябре 1996 года, накануне антиконституционного референдума, уничтожившего систему разделения властей в стране, подал в отставку в знак протеста.
</p>





<p>
В ноябре 1997 году Андрей Санников, выступил инициатором «Хартии 97», стал международным координатором этой гражданской инициативы. В 1998 году вместе с Геннадием Карпенко создал Координационную раду демократических сил Беларуси. Как профессиональный дипломат, отстаивал интересы демократической Беларуси на международной арене, активно поднимал тему нарушения прав человека в стране, защищал независимость Беларуси.
</p>





<p>
В 1998-2002 Санников – ректор Народного университета, неформального образовательно-просветительского проекта.
</p>





<p>
Андрей Санников выступал организатором известных маршей протеста «Раздавим фашистскую гадину!», «Так жить нельзя!» и «За лучшую жизнь», акций против фальсификации выборов в 2001, 2004, 2006, 2008 годах. За свою политическую деятельность подвергался аресту, избиению и преследованиям со стороны режима. В 2008 году Андрей Санников вместе с Виктором Ивашкевичем, Михаилом Мариничем и другие известными политиками стал инициатором гражданской кампании «Европейская Беларусь», которая ставит своей целью вступление нашей страны в Европейский Союз.
</p>





<p>
Весной 2010 года Санников в эфире телеканала «Белсат» заявил о своем намерении участвовать в предстоящих президентских выборах:<br /></p>





<p style=\"font-weight: bold;\">\"Я считаю, что сейчас у нашей страны появится шанс на позитивные перемены. Я много с кем разговариваю, и всех интересуют вопросы – что будет с независимостью, с экономикой, как вообще людям выживать в нынешних условиях. Очевидно, что белорусы желают перемен и лучшей жизни. Честные и сильные политики должны брать ответственность. И я хочу объявить, что готов участвовать в президентской кампании в качестве кандидата. Я готов брать на себя ответственность, чтобы подтолкнуть эти процессы. Очень скоро мы можем придти к настоящей демократии и нормальной жизни. В 2011 году Беларусь может стать свободной, а в 2016-м стать членом Европейского Союза.\"</p>





<b></b><p>
Женат, имеет двух сыновей. Супруга – известная белорусская журналистка Ирина Халип.
</p>





<p>
Андрей Санников - лауреат международной премии имени Бруно Крайского в области защиты прав человека.<b><br /></b></p>





<p><b>\"Основной своей задачей я вижу восстановление законности в стране. Будут твердо обеспечены принципы разделения властей, восстановлена нормальная деятельность парламента и независимость судов.\"</b></p>





<p><b>\"Без возвращения независимой прессы, ее влияния и контроля за деятельностью государства, построить свободное общество невозможно.\"</b><b><br /></b></p>





<p><b></b><b>\"В стране необходимо провести коренные реформы всей политической и экономической системы. Нужно дать людям свободу жить, работать, заниматься бизнесом. Высвободить и поощрить частную инициативу. Привлечь в Беларусь лидеров мировой экономики, стать значимой частью могущественного европейского экономического центра. Беларусь сможет совершить технологический прорыв, только если к нам придут мировые бренды. Для них дверь будет открыта.\"</b></p>





<p><b>\"Надо восстановить достоинство белорусов. Это способны сделать бело-красно-белый флаг и герб «Пагоня», потому что они объединяют нас. И не только в Беларуси, а во всем мире. Надо уважать себя и свою тысячелетнюю историю.\"</b></p>





<p><b>\"Государственным должен быть белорусский язык. А русский язык останется де-факто как язык общения. Необходимо возродить в белорусах уважение к родному языку, который дан нам Богом.\"</b><b><br /></b></p>





<p><b>\"Амнистия, компенсации и восстановление в правах должны коснуться всех тех, кто пострадал от чиновничьего произвола. Все занимавшиеся политическим преследованием могут быть привлечены к ответственности. Однако, каждый человек должен иметь право на покаяние и прощение.\"</b><b><br /></b></p>





<p><b>\"Свою международную политику Беларусь должна строить не на дружбе с режимами-изгоями и грязных экономических схемах, а на четко осознаваемых национальных интересах. Беларусь – европейская страна. Считаю, что отношения с Россией должны быть построены на взаимопонимании, а не на мелких конфликтах. Мы нужны России, также как она нам.\"</b><b><br /></b></p>





<p><b>\"Моя кампания будет опираться на семью, единомышленников, одноклассников и белорусский народ.\"</b><br /></p>





<p style=\"font-weight: bold;\">\"Стратегическая цель – построение нормального государства, вступление Беларуси в Евросоюз, обеспечение европейского уровня жизни в ближайшее время. Белорусы достойны лучшей жизни.\"</p>





<b></b>


<h3>Если вы хотите поддержать Андрея Санникова или войти в его инициативную группу, звоните <b>+375-29-9465052, +375 29 6815737</b></h3>


<p>
Все подробные сведения можно найти на <a href=\"http://europeanbelarus.org/\" title=\"\">сайте гражданской кампании \"Европейская Беларусь\"</a></p>



</cut>","createdon": 1283112000,"editedon": 0,"deletedon": 0,"publishedon": 1283194933,"menutitle": "","uri": "blog/closet/andrej-olegovich-sannikov/"}, {"id": 70,"pagetitle": "Новое на сайте","longtitle": "","description": "","alias": "novoe-na-sajte","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<div><span class=\"Apple-style-span\" style=\"line-height: normal; \">Система стоит, нормально работает. Хорошее правило админов: \"работает - не трогай!\". Но оно применимо для тех вещей, которые настроил и забыл. Но если бы так поступали бы с сайтами, сидели бы мы в 90 годах и по сей день. Поэтому сайт должен быть динамичным, развиваться и совершенствоваться. Сразу конфетку создать нельзя.</span></div><div>Поэтому я тоже стараюсь не забрасывать сайт. И кроме обновления информации на сайте, написания новых постов в блог, слежу за технической составляющей сайта и дорабатываю недостающие элементы. Назвать это революцией на сайте нельзя, это просто улучшения косметические и технические и сделаны для того они, чтобы вам, пользователям, было удобнее пользоваться моим сайтом. Дальше я расскажу несколько подробнее о нововведениях.</div><div>кат</div><div>Обновленные комментарии</div><div>В системе стоит огромный модуль блога, где есть все средства для управления по сути всем происходящим. Многие вещи для вас останутся незамеченными, так как они разрабатывались для административной части сайта, но удобства это добавит.</div><div>Раз уж начала писать об админке, то о фишках в ней и расскажу сразу.</div><div>Наконец я дописал толковое управление комментариями в админке, что теперь позволяет быстрее реагировать на них. Борьба со спамом - основная проблема на настоящий момент. Каптча отчасти позволяет решить проблему, но лишает удобство пользования. Приходится лишний раз напрягаться, чтобы различить еле заметные символы, а боты совершенствуются и легко взламывают такие каптчи. Поэтому я отказался вообще от применения каптчи. Зато сделал несколько другую систему для упреждения потока спама. </div><div>Система позволяет банить неугодные IP адреса, следить за другими параметрами комментария, сканировать текст и делать соответствующие выводы. В таком случае комментарий попадает ко мне в любом случае, но не публикуется сразу на сайте. Что это дает - нормальные комментарии сразу попадают на сайт и мне не нужно тратить время, чтобы оперативно их публиковать, а плохие попадают в черный список, который я могу просмотреть и решить - спам это или нет. Исходя из практики скажу - это весьма удобно.</div><div>На этом фишки админки заканчиваются. Теперь о фишках пользовательской части.</div><div>Теги форматирования</div><div>Очень часто бывает так, что нужно в комментарии выделит какие-то слова, процитировать кого-то, привести пример. Можно все написать сплошным текстом, но это не так красиво получается и не всегда можно уловить суть автора комментария. Поэтому я добавил возможность простого форматирования текста в комментариях. Тех html-тегов, что я добавил, я считаю, достаточно, чтобы оформить текст более презентабельно. Работая с HTML уже почти 6 лет, могу сказать, что больше не нужно.</div><div>Цитирование</div><div>Я думаю, многие видели как устроены древовидные комментарии, когда можно отвечать на комментрий, а кто-то может ответить на твой комментарий. Это удобно, но не всегда. Порой проще отвечать на комментарии как на форуме - просто процитировав оппонента. Такую возможность добавил и я.</div>","createdon": 1282766400,"editedon": 0,"deletedon": 0,"publishedon": 1298032676,"menutitle": "","uri": "blog/closet/novoe-na-sajte/"}, {"id": 71,"pagetitle": "задачи","longtitle": "","description": "","alias": "zadachi","published": 0,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>написать такой плагин - публикатор. который проверяет, опубликованы ли отдельные записи в социальных сетях. Соц. сети можно добавлять и удалять. Можно блокировать для рубрики или отдельного поста отдельную социалку. Показывает у каждого поста, где еще не засветился и отдельная статистика - сколько опубликовано (перепощено, если позволяет узнать api). Что-то типа фидбека для блога.</p><p><br /></p><p>===</p><p>-4. сделать аджаксовый подсказчик тегов для поста при публикации.</p><p>-3. написать для комментариев толковый алгоритм корзин Байеса для формирования спам-листов комментариев в блоге. по сути впоследствии можно данный алгоритм внедрить и в другие модули. или придумать свой механизм определения речи человека</p><p>-1. поправить верстку для блока blockquote на главное и в комментах - слишком большой нижний отступ. и в админке сделать нормально выделении блока, а то херня получается какая-то.</p><p>0. сделать сохранение кук для пользователей. и кнопку - сохранять или нет.<br /></p><p>1. сделать навигацию по записям - типа туда и 
сюда.</p><p>2. подумать, нужно ли у записи выставлять дату публикации в будущем. т.е. если дата будущая, то пока не выводить.</p><p>3. поправить работу с тегами. редактор тегов включить. продумать, как редактировать отдельный тег и в чем фишка этих тегов.</p><p>4. доработать пагинатор. чтобы правильно считал количество записей в запросе. не работает в поиске по тегу, по категории и в редакторе тегов в админке. и в других местах работае неадекватно. в списке комментов при выводе комментов к блогу - работает неправильно.<br /></p><p>5. сделат версию сайта на английском языке. блог на русском, но основные данные на английском сделать. как вариант добавить мультиязычность.</p><p>---------------------<br /></p><p>1. сделать админку для модуля вопросов. переписать немного логику. неотвеченный вопрос публиковать на сайте с пометкой - еще не ответил. чтобы пользователь видел, что вопрос добавился.</p><p>4. Так как в блоге может быть много всего, нужно реализовать удобный поиск по блогу и в целом по сайту.</p><p>??5. дописать уведомление на почту о новых комментах к заметке. при добавлении коммента поставить галку - уведомлять о новых меня. Почта сохраняется, так что не проблема делать рассылку подписанным. - или сделать проще - сделать RSS-ленту комментариев.</p>","createdon": 1276545600,"editedon": 0,"deletedon": 0,"publishedon": 1316217933,"menutitle": "","uri": "blog/closet/zadachi/"}, {"id": 73,"pagetitle": "Комментарии к блогу","longtitle": "комментарии, блог, сайт, фишки, вопрос, уникальный, хабр","description": "","alias": "kommentarii-k-blogu","published": 1,"pub_date": 0,"parent": 4,"isfolder": 1,"introtext": null,"content": "<p>Выходной день выдался удачным и продуктивным, несмотря на такую жаркую погоду. В итоге я завершил работу над функционалом комментариев. Еще, правда, много работы в этом направлении, но это касается скорее административной части сайта. <cut></p>


<h2>Как комментировать?</h2>
<p>Учить как пользоваться комментариями не стану, расскажу лишь о том, что нужно для успешного добавления комментария. </p>

<p>В форме всего 3 поля для заполнения и все они являются обязательными. Указать нужно лишь имя, адрес emal и непосредственно само сообщение. Сразу хочу ответить на вопрос, зачем мне email? Я не собираю базу для спам-рассылки или чего-то еще, это нужно лишь для обратной связи с вами и для выявления уникальных пользователей по связке Имя-Email. Если кто-то боится оставлять свой адрес, я не заставляю, укажите любой другой адрес, главное чтобы он был правильным (например mail@example.com). </p>

<p>Если все поля заполнены, то комментарий успешно запишется в базу. На этом добавление комментария будет завершено.</p>


<h2>Фишки</h2>
<p>Из фишек комментариев на данный момент есть возможность давать уникальные ссылки на комментарий. Это должно быть как должное, но пока это является фишкой :) </p>

<p>Так же немного переделал внешний вид списка блогов, так теперь отображается количество комментариев и ссылка на комментарии непосредственно.</p>


<h2>Чего еще нет?</h2>
<p>Пока нету веток комментариев. Это не так уж и сложно реализовать и это будет, но не сразу. Есть так же желание сделать систему оценки комментариев (как на хабре), но пока это не главная задача.</p>


<h2>Критика.</h2>
<p>Если в механизме комментариев вас что-то не утсраивает или вы можете предложить какое-то решение, пишите. Пишите или в виде комментариев к этому посту, или через <a href=\"../../fb\" title=\"\">форму обратной связи</a>.</p>","createdon": 1276359267,"editedon": 0,"deletedon": 0,"publishedon": 1276613476,"menutitle": "","uri": "blog/closet/kommentarii-k-blogu/"}, {"id": 101,"pagetitle": "Как я брал напрокат машину в Минске","longtitle": "Как взять машину напрокат в Минске, прокат авто в Минске","description": "","alias": "kak-vzyat-mashinu-na-prokat-v-minske","published": 0,"pub_date": 0,"parent": 99,"isfolder": 1,"introtext": "","content": "http://avr.by/

","createdon": 1378299596,"editedon": 1378300014,"deletedon": 0,"publishedon": 0,"menutitle": "","uri": "blog/travel/kak-vzyat-mashinu-na-prokat-v-minske/"}, {"id": 106,"pagetitle": "Автоматизм","longtitle": "","description": "","alias": "automatism","published": 1,"pub_date": 0,"parent": 86,"isfolder": 1,"introtext": "Как часто вы делаете какие-то вещи на полном автомате?<br>
<br>
Автоматизм — это сила привычки, это привычка, доведенная до такого состояния, когда делаешь действие о нем не думая. Сильнее только инстинкты.<br>
<br>
Словил себя сегодня на мысли, что последнее время очень много вещей я делаю на полном автомате. Причем ситуация была не рядовая, а когда этот самый автоматизм проявил себя с не лучшей стороны.","content": "<blockquote>
	 <q>Есть три необходимые привычки, которые при любых условиях сделают доступными любую вещь, какую только может вообразить человек: привычка к труду, привычка к здоровью, привычка к учению. Если вы обладаете этими привычками и вас любит женщина, у которой тоже есть эти привычки, вы будете счастливы ныне и всегда, она будет счастлива тоже.</q><cite>Элберт Грин Хаббард</cite>
</blockquote>
<p>
	     Как часто вы делаете какие-то вещи на полном автомате?
</p>
<p>
	     Автоматизм — это сила привычки, это привычка, доведенная до такого состояния, когда делаешь действие о нем не думая. Сильнее только инстинкты.
</p>
<p>
	     Словил себя сегодня на мысли, что последнее время очень много вещей я делаю на полном автомате. Причем ситуация была не рядовая, а когда этот самый автоматизм проявил себя с не лучшей стороны.
</p>
<h2>Заваривание чая</h2>
<p>
	     Решил сделать чаю вечером, пить хотелось. Обычно алгоритм такой:
</p>
<ul>
	<li>Ставим чайник и ждем, пока закипит (пока ждешь, можно еще что-нибудь поделать, новости почитать, например)</li>
	<li>Берем 2 кружки и ложку</li>
	<li>Насыпаем чай в кружки по очереди, затем сахар</li>
	<li>Заливаем кипятком и ждем пару минут, пока чуть-чуть остынет (кипяток пить не очень приятно)</li>
</ul>
<p>
	     Каждое утро и каждый вечер я делаю чай по такому алгоритму уже больше года и он настолько стал привычен, что по другому делать чай уже сложно. И вот сегодня вечером алгоритм дал сбой. Любимая попросила сделать малинового чаю вместо черного. Обычно я делаю черный листовой чай, а тут чай малиновый и в пакетиках. Я, как обычно, взял кружки, достал пакетики, открыл их и положил в чашки, затем перенес чашки на стол, поближе к чайнику, задумался о какой-то штуке, которую хотел реализовать сегодня вечером и насыпал сахара, черного чая как обычно и залил все это кипятком! :) Осознал я это все только когда доливал воду во вторую чашку. Алгоритм сломался.
</p>
<p>
	     А таких мелочей в жизни на самом деле много, но следить за ними всеми всегда очень утомительно. Мозг сам такие действия автоматизирует и участвует в них по \"записанной\" ранее программе. Но иногда случается сбой и можно попасть в не совсем удобную ситуацию.
</p>
<p>
	     А у вас такие ситуации бывали?
</p>","createdon": 1379274906,"editedon": 1379276564,"deletedon": 0,"publishedon": 1379274900,"menutitle": "","uri": "blog/life/automatism/"}, {"id": 107,"pagetitle": "Percona Server 5.6 на VPS для MODX","longtitle": "","description": "","alias": "percona-server-5.6-na-vps-dlya-modx","published": 0,"pub_date": 0,"parent": 85,"isfolder": 1,"introtext": "","content": "<p>
	 Собственно о MODX в этой заметке почти ни слова не будет, разве что скажу о том, что настраивал новый сервер для своих нужд и на нем будут работать сайты именно на MODX.
</p>
<p>
	 Есть у меня свой VPS от eomy.net. В целом меня он устраивал за исключением того, что денег просят тоже не мало (9.95$ за 512Mb памяти и одним ядром сервера и 10 Гб диска) и когда появлялось много разных сайтиков, они значительно начинали тупить и забивать память, которой и так было не много. Но я последовал совету Василия и прикупил себе сервер у Линоды за 20$ в месяц, но с приемлемыми характеристиками. За это это время было пару обновлений у них и сейчас я умею такую конфигурацию: 8 ядер на базе Xen-виртуализации, 1Gb памяти и что-то около 50Гб диска.
</p>","createdon": 1380474523,"editedon": 0,"deletedon": 0,"publishedon": 0,"menutitle": "","uri": "blog/modx/percona-server-5.6-na-vps-dlya-modx/"}, {"id": 108,"pagetitle": "MODXpo 2013 - День первый","longtitle": "","description": "","alias": "modxpo-2013-den-pervyij","published": 0,"pub_date": 0,"parent": 85,"isfolder": 1,"introtext": "Отчет за первый день с проведенной конференции в Кёльне","content": "","createdon": 1383663961,"editedon": 1383664075,"deletedon": 0,"publishedon": 0,"menutitle": "","uri": "blog/modx/modxpo-2013-den-pervyij/"}, {"id": 110,"pagetitle": "Работаем с сайтом из PhpStorm","longtitle": "","description": "","alias": "rabotaem-s-sajtom-iz-phpstorm","published": 0,"pub_date": 0,"parent": 85,"isfolder": 1,"introtext": "","content": "<p>
	 В плотной работе с MODX был некоторый перерыв, так как на текущий момент я сотрудничаю с крупным проектом - Onliner.by, но после поездки на конференцию MODXpo в Кёльне этой осенью появилось много идей и к активной разработке я вернулся. Вернулись так же и прошлые проблемы, которые мне раньше не давали жить. Сейчас я делаю несколько своих собственных проектов, один из которых - сайт сообщества MODX в Беларуси, други связаны с интернет-комерцией и мне нужен удобный способ быстро и качественно работать над проектами.
</p>
<p>
	 Я пользуюсь в работе Ubuntu и Mac OS. В первой проблем обычно не возникает, если нужно подключить папку по sftp и заставить другие программы видеть файлы с удаленного серверка, как будто они лежат на диске, здесь же, рядом. В Mac OS с этим есть определенные проблемы, которые я честно пытался решить разными доступными средствами, но качество работы этих решений меня не устроило.
</p>
<p>
	 Так же я в повседневной работе использую замечательную IDE от JetBrains - PhpStorm. В ней есть возможность работать над удаленными проектами через тот же sftp, когда проект сначала скачивается на диск, а затем при сохранении файла он отправляется на сервер, но есть одна маленькая пакость. Все дело в том, что при каждой попытке сохранить файл на сервер, PhpStorm подымает новое соединение, т.е. логин и все остальные дела, что работает иногда медленно и к тому же не позволяет сохранять изменения часто, так как сервер блокирует частые попытки логина (защита от брутфорса паролей).
</p>
<h2>Решение</h2>
<p>
	Обладая навыками программирования и администрирования и рассказывая об этом на страницах моего круга и линкедина стыдно не придумать решения. Решение нашлось не тривиальное, но простое по своей сути.
</p>
<h3>Дано</h3>
<p>
	1. У нас есть сервер и туда мы можем поставить MODX. Так и сделаем, это не сложно. Конфиг nginx, конфиг fpm, БД, файлы самого MODX, устанавливаем и настраиваем. Тут не сложно. Возможно я позже напишу о том, как устроен мой сервер и как нужно настраивать его для MODX разработки.
</p>
<p>
	2. У нас есть локальная машина с Mac OS на боту (для Linux все аналогично), где нам нужно установить rsync, nodejs, npm и пожалуй все.
</p>
<p>
	Процесс пошел
</p>","createdon": 1386334071,"editedon": 1386334575,"deletedon": 0,"publishedon": 0,"menutitle": "","uri": "blog/modx/rabotaem-s-sajtom-iz-phpstorm/"}, {"id": 112,"pagetitle": "Правильно подключаемся к Sphinx","longtitle": "","description": "","alias": "pravilno-podklyuchaemsya-k-sphinx","published": 0,"pub_date": 0,"parent": 111,"isfolder": 1,"introtext": "","content": "","createdon": 1386590925,"editedon": 0,"deletedon": 0,"publishedon": 0,"menutitle": "","uri": "blog/development/pravilno-podklyuchaemsya-k-sphinx/"}]
